[{"id":"c057b159-202c-4abb-b03e-7f4ee7856638","type":"Full Time","url":"https://jobs.github.com/positions/c057b159-202c-4abb-b03e-7f4ee7856638","created_at":"Fri Mar 12 21:40:49 UTC 2021","company":"Versiti","company_url":"http://www.versiti.org","location":"Indianapolis, IN","title":"Sr. Systems Analyst, Applications ","description":"\u003cp\u003ePOSITION SUMMARY\nUnder the direction and guidance of the Director IT or Manager, this software development/systems professional is responsible for developing and/or supporting a broad range software of applications, integration solutions and systems for Versiti.\nDUTIES AND RESPONSIBILITIES\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eApplies expertise in the technical architecture design, development, delivery and support of software application solutions and system interfaces to meet business requirements following departmental standards and best practices\u003c/li\u003e\n\u003cli\u003eDevelops reports and queries to aid business and service lines\u003c/li\u003e\n\u003cli\u003ePerforms and/or assists with required maintenance and upgrades of assigned systems/solutions\u003c/li\u003e\n\u003cli\u003eAssists in the evaluation and selection of off-the-the shelf solutions and systems, as well as technologies, and plays a key role in implementation, integration, and maintenance of those systems and technologies.\u003c/li\u003e\n\u003cli\u003eEstablishes strong working and consultative relationships with business partner and users, vendors and internal staff\u003c/li\u003e\n\u003cli\u003eDevelops estimates for assigned work and manages time and work plans effectively to meet deadlines, provides routine updates to appropriate business and IS teams.\u003c/li\u003e\n\u003cli\u003eWorking with extended development team and management, assists in establishment of policies, processes, procedures and standards including coding standards, testing, etc.\u003c/li\u003e\n\u003cli\u003eAssists peers in design and development efforts by being an active participant in code walkthroughs and design reviews\u003c/li\u003e\n\u003cli\u003ePerforms other duties as required.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQUALIFICATIONS\u003c/p\u003e\n\u003cp\u003eEducation\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBS from an accredited institution; Computer Science, Software Engineering, Management Information Systems degree preferred; equivalent work experience may be considered\u003c/li\u003e\n\u003cli\u003eITIL foundation certification a definite plus\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e \nExperience, Skills and Knowledge – Clinical and Research Systems and Software Development\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5-8 years of progressive responsibility and experience in application development and support, with at least 3 years of demonstrated systems analysis and design experience.\u003c/li\u003e\n\u003cli\u003eExperience in laboratory, hospital, pharma or healthcare solutions and/or integrations a definite plus\u003c/li\u003e\n\u003cli\u003eDemonstrated understanding and appreciation of structure software development and support lifecycle disciplines\u003c/li\u003e\n\u003cli\u003eExperience working in a Regulated industry like healthcare, banking etc. with knowledge of privacy and compliance regulations such as HIPAA, GDPR preferred\u003c/li\u003e\n\u003cli\u003eGood communication and listening skills, with an ability to translate business requests and requirements into proposed technical solutions\u003c/li\u003e\n\u003cli\u003eUnderstands the need to balance technical solutions with practical business needs and short-term vs long-term approaches\u003c/li\u003e\n\u003cli\u003eStrong collaborator and team player, with the ability to partner well with users, peers, internal and external/vendor partners and management\u003c/li\u003e\n\u003cli\u003eMotivated, self-starter, self-directed, results-oriented\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eKey Development Tools\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDatabase and report development: MS SQL Server and Oracle; SQL to develop queries, stored procedures, reports and analytics\u003c/li\u003e\n\u003cli\u003eReporting tools: Power BI, Business Objects\u003c/li\u003e\n\u003cli\u003eCCL for Cerner\u003c/li\u003e\n\u003cli\u003eJava, VBA and/or Python scripting\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eKey Application Technologies and Environments in Use/Supported\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCerner Laboratory\u003c/li\u003e\n\u003cli\u003eSurround\u003c/li\u003e\n\u003cli\u003eOracle and MS SQL Server databases\u003c/li\u003e\n\u003cli\u003eOperating systems: Unix/Linux and Windows\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePHYSICAL REQUIREMENTS \u0026amp; WORKING CONDITIONS\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThis role can require providing system support coverage during off hours.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis job description reflects the current assignment of essential functions and is not meant to be all-inclusive or in any way construed as an employment contract.  Duties and responsibilities may be assigned or reassigned to this position at any time and may be modified to reasonably accommodate an individual with a disability or for other reasons solely at management’s discretion.  All position descriptions will be reviewed and updated at least once per year when the incumbent is reviewed or as attrition occurs\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease email \u003ca href=\"mailto:rmargolis@versiti.org\"\u003ermargolis@versiti.org\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbmVjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1c860f51b877feadf720f906c735be5a8eb64f0a/Versiti%20Color%20Logo.jpg"},{"id":"6554f4fa-9e9f-4b96-9584-50bb74993e3d","type":"Full Time","url":"https://jobs.github.com/positions/6554f4fa-9e9f-4b96-9584-50bb74993e3d","created_at":"Fri Mar 12 16:17:55 UTC 2021","company":"Pursuit","company_url":"https://www.pursuit.org/","location":"New York, NY **Currently remote**","title":"Full Stack Web Development Instructor","description":"\u003cp\u003e\u003cstrong\u003eAbout Pursuit\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePursuit is a social impact organization that creates transformation where it’s needed most. Through our intensive software developer training program, we teach high-need, high-potential adults the technical skills and industry smarts needed to get their first tech jobs, advance in their careers, and become the next generation of leaders in tech. In addition to training and career support, Pursuit’s innovative operating model combines partnerships with tech companies to retrain their blue-collar workers and social impact investments to re-envision funding for outcomes-based organizations.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the Role\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt Pursuit, all employees have the opportunity to make a profound, positive social impact. Our Web Instructors perhaps have the greatest direct impact on our program participants and we are hiring several instructors to support our program expansion. As an Instructor, you will manage a class of approximately 36 Fellows with no technical background to become job-ready over a 12-month period. Instructors will deliver technical curriculum, provide feedback to Fellows and create a positive learning environment. We are hiring instructors at all levels, from associate to lead instructor.\u003c/p\u003e\n\u003cp\u003eOur office is located in Long Island City, NY but we are currently fully remote due to Coronavirus, including our classes, and will remain so for the entirety of 2021.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCohorts have two schedules: Days (Monday - Friday 10:00 - 6:00) and Nights \u0026amp; Weekends (Saturday \u0026amp; Sunday 10:00 - 6:00; Monday - Wednesday 2:00 - 10:00pm)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout You\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are passionate about teaching and mentoring, and have a strong connection to our mission\u003c/li\u003e\n\u003cli\u003eYou have demonstrated professional experience working with front end and back end javascript, for example Node.js, React/Redux, and Postgres\u003c/li\u003e\n\u003cli\u003eYou have a no-fail attitude and love working with a big cross-functional team\u003c/li\u003e\n\u003cli\u003eYou are compassionate and able to work with a broad range of students\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eKey Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDeliver full-class instruction - currently remote over Zoom\u003c/li\u003e\n\u003cli\u003eLead small-group and one-on-one sessions for fellows in need of additional review\u003c/li\u003e\n\u003cli\u003eMonitor chat and answer fellow questions\u003c/li\u003e\n\u003cli\u003eGrade fellow work; offer robust written and verbal feedback to fellows\u003c/li\u003e\n\u003cli\u003eSpearhead workshops and activities that respond to the needs of cohort\u003c/li\u003e\n\u003cli\u003eBuild and refine curriculum materials\u003c/li\u003e\n\u003cli\u003eAssess individual Fellows and support forecasting efforts to meet org goals\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e2+ years experience in a technical instruction or technical role\u003c/li\u003e\n\u003cli\u003eDemonstrated experience developing web applications using JavaScript and React\u003c/li\u003e\n\u003cli\u003ePassion for teaching and mentorship\u003c/li\u003e\n\u003cli\u003eKnowledge of our tech stack: Postgres - Express - React/Redux - Node.js, aka PERN\u003c/li\u003e\n\u003cli\u003eStrong work ethic and reliability\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eNice to have\u003c/strong\u003e\nJest, Cypress, React Testing Library/Enzyme, and automation platforms such as CircleCI\u003c/p\u003e\n\u003cp\u003eThis is a \u003cstrong\u003efull-time, salaried position with competitive compensation and a wide range of benefits.\u003c/strong\u003e Our offerings include premium health, dental, and vision insurance, flexible paid time off, and robust 401k matching.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:talent@pursuit.org\"\u003etalent@pursuit.org\u003c/a\u003e and please indicate which schedule you prefer.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbk9jIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7cd6a370030b45eb588a308118d8718893d5fe95/Pursuit%20Wordmark%20Black.jpg"},{"id":"4150a9c0-438e-47f3-8c38-f0436e51522c","type":"Full Time","url":"https://jobs.github.com/positions/4150a9c0-438e-47f3-8c38-f0436e51522c","created_at":"Fri Mar 12 16:00:59 UTC 2021","company":"CTI Clinical Trial and Consulting Services, Inc.","company_url":null,"location":"Covington, KY \u0026 Raleigh, NC","title":"Senior Developer","description":"\u003cp\u003eJob Purpose / Summary:\nThe Senior Developer works with system owners to understand the business requirements of a system and is able to use various technologies to develop the supporting infrastructure and user interfaces.  This can involve working with data from a variety of sources and developing the most efficient methods to manage data flow.  The Senior Developer communicates with both internal and external clients during all phases of system development, working within agreed upon budget and timelines.  The Senior Developer is proficient with industry best practices for processes and development technologies, and serves as a resource and mentor to other developers.\u003c/p\u003e\n\u003cp\u003eWhat You'll Do:\nWork with system owners to develop requirements and transform into a usable system within the systems development life cycle (SDLC) framework\nDevelop custom databases and user interfaces using standard web and database technologies such as Microsoft SQL, Microsoft SSRS, Microsoft C#, etc.\nDevelop extract, transform, and load (ETL) processes on complex data sets\nPrepare reports, tables, charts, and graphs using Tableau and Microsoft SSRS\nDevelopment work in systems such as Medidata suite, SharePoint, and Intacct\nWork with and support other developers to create and implement best practices for processes and systems; provide leadership to other developers\nCommunicate results within the organization and to clients\nFollow applicable Standard Operating Procedures (SOPs) and maintain appropriate project documentation\nPerform, track, and manage related project work as assigned\nIdentify areas for improvement and provides recommendations to address\nAdhere to requirements of 21 CFR Part 11 where applicable\u003c/p\u003e\n\u003cp\u003eWhat You'll Bring:\nBachelor's Degree in Computer Science or related field\n5 years industry experience in related field\nExperience with Microsoft SQL Server, Microsoft SSRS, SQL, Microsoft C#, and Tableau\u003c/p\u003e\n\u003cp\u003eWhy CTI?:\nWe support career progression –  We have a structured mentoring program to provide the support you need to move forward\nWe value education and training – We provide tuition reimbursement, partner with universities and colleges to create programs in our field, and have a dedicated training department\nWe value our people - We have never had a layoff in our 20-year history, support a work-life balance, and have provided cash bonuses every year for the past decade\nOur culture is unparalleled – We've received multiple awards recognizing CTI as one of the best places to work in the greater Cincinnati area, as well as one of the top CROs in the industry\nWe think globally and act locally – We have a global philanthropic program supporting our team’s efforts to improve their local communities (click here to learn more about our “CTI Cares” program)\nWe are looking toward the future – We have had a consistent double-digit growth rate over the last decade, invest in cutting-edge technology, and pride ourselves on our average 95% annual retention rate (a recent report found that the average turnover for CROs in the US was 30%)\nOur work makes a difference – We focus our work on treatments for chronically and critically-ill patients, who are depending on us to bring these life-changing therapies to market\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://www.ctifacts.com/careers/join-the-cti-team?gnk=job\u0026amp;gni=8a7885ac767274b60176f1e375d60e49\u0026amp;gns=Industry+Website\"\u003ehttps://www.ctifacts.com/careers/join-the-cti-team?gnk=job\u0026amp;gni=8a7885ac767274b60176f1e375d60e49\u0026amp;gns=Industry+Website\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"ad662975-bab2-47a1-877f-486759533180","type":"Full Time","url":"https://jobs.github.com/positions/ad662975-bab2-47a1-877f-486759533180","created_at":"Fri Mar 12 15:41:35 UTC 2021","company":"arxes-tolina GmbH","company_url":"https://smardigo.de/","location":"Berlin","title":"Senior Java Developer (m/w/d)","description":"\u003cp\u003e\u003cstrong\u003eFür unseren Geschäftsbereich Software am Standort Siemensdamm in Berlin suchen wir Senior Java Entwickler (m/w/d)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003earxes-tolina GmbH ist ein führender Anbieter von hochwertigen und praxisbewährten Lösungen und Services in den Bereichen IT, Software und Consulting. Dabei verbinden wir in unserem Portfolio das klassische IT-Systemhausgeschäft mit unseren eigenen Softwarelösungen zur Digitalisierung von Geschäftsprozessen. arxes-tolina GmbH verfügt über fast 30 Jahre Erfahrung bei der Entwicklung von intelligenten Softwarelösungen zum Automatisieren und Optimieren von Geschäftsprozessen, die kundenindividuell gestaltet und über Schnittstellen schnell und effizient in bestehende IT-Infrastrukturen integriert werden können.\u003c/p\u003e\n\u003cp\u003eMit unserer Low-Code-Plattform smardigo setzen wir auf eine einfache und schnelle digitale Transformation von Geschäftsprozessen mittels BPMN. In Kombination mit unserer Automatisierungsplattform Camino und unserem End-to-End verschlüsselten Austauschhub e-DEN bieten wir unseren Kunden somit eine Komplettlösung zur Digitalisierung von Geschäftsprozessen.\u003c/p\u003e\n\u003cp\u003eWir bieten unseren Kunden im Rahmen unseres Consulting-Services branchenübergreifendes Wissen in verschiedensten Fachbereichen, unter anderem durch langjährige Praxiserfahrung aus zahllosen erfolgreichen Kundenprojekten, an. So begleiten wir namenhafte Unternehmen und öffentliche Auftraggeber als Digitalisierungspartner auf ihrem Weg in ein zukunftsfähiges Geschäftsmodell.\nAls arxes-tolina Team verfolgen wir das Ziel einer der TOP Digitalisierungspartner in Deutschland zu sein und gemeinsam mit der neu gewonnenen Unterstützung der netgo group werden wir zum „Digital Gamechanger“.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eProud to be part of netgo group\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAls Senior Java Entwickler erwartet dich bei uns:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAgile Software-Entwicklung mit Scrum oder Kanban\u003c/li\u003e\n\u003cli\u003eSpannende und abwechslungsreiche Projekte zur Unterstützung der digitalen Transformation\u003c/li\u003e\n\u003cli\u003eEntwicklung von innovativen Lösungen mit modernen Web Technologien und nach dem Clean-Code-Prinzipien\u003c/li\u003e\n\u003cli\u003eUnterstützung des Product Owners bei der Konzeption von Kundenanforderungen und technischen Umsetzung im Team\u003c/li\u003e\n\u003cli\u003eSelbstorganisierte Teams mit einer flachen Hierarchie\u003c/li\u003e\n\u003cli\u003eKreatives Arbeiten und das Ausprobieren neuer Technologien\u003c/li\u003e\n\u003cli\u003eFeedbackkultur auf Augenhöhe\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDas wünschen wir von dir:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu bringst mehrjährige Berufserfahrung als Softwareentwickler mit, idealerweise auch in Softwarearchitektur und -konzeption\u003c/li\u003e\n\u003cli\u003eDu fühlst dich als Fullstack-Entwickler wohl (Frontend - SPA z.B. Angular, React, VueJS, Vaadin und/oder Backend - Java, Spring, JPA(Hibernate), SQL, Buildprozesse CD/CI)\u003c/li\u003e\n\u003cli\u003eDu hast einen hohen Anspruch an Code-Qualität, Design und die Schaffung einer agilen Software-Architektur\u003c/li\u003e\n\u003cli\u003eDu arbeitest dich schnell in neue Themen und Technologien ein\u003c/li\u003e\n\u003cli\u003eDu hast Erfahrung mit agilen Softwareentwicklungsmethoden\u003c/li\u003e\n\u003cli\u003eDu bringst dich mit deiner Kommunikationsfähigkeit ins Team bzw. beim Kunden ein\u003c/li\u003e\n\u003cli\u003eDeine Deutschkenntnisse sind verhandlungssicher in Wort und Schrift\u003c/li\u003e\n\u003cli\u003ePluspunkte geben Erfahrung im Mentoring, Elastic-Stack und Docker\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003earxes-tolina bietet dir:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEinen Job in einem zukunftsweisenden und wachsenden Unternehmen\u003c/li\u003e\n\u003cli\u003eGestaltungsspielraum und hohe Einflussmöglichkeiten auf die eigene Arbeit für deine persönliche Entfaltung\u003c/li\u003e\n\u003cli\u003eEine angenehme offene und familiäre Arbeitsatmosphäre in unseren Teams sowie unternehmensübergreifend zwischen den Mitarbeiter*Innen.\u003c/li\u003e\n\u003cli\u003eEin Mentoringprogramm und ein Einarbeitungsplan für deinen gelungenen Einstieg\u003c/li\u003e\n\u003cli\u003eEine offene Kommunikationskultur, in der auch „der Elefant im Raum“ angesprochen werden kann\u003c/li\u003e\n\u003cli\u003eWir sorgen mit Weiterbildungsmöglichkeiten für deine persönliche und berufliche Entwicklung\u003c/li\u003e\n\u003cli\u003eBetriebliche Altersvorsorge für dich und deine Familie\u003c/li\u003e\n\u003cli\u003eMit einem JobRad, unserem Remotework-Konzept sowie deiner flexiblen Arbeitszeitgestaltung steht deiner Work-Life-Balance nichts mehr im Weg!\u003c/li\u003e\n\u003cli\u003eDu kommst mit dem öffentlichen Nahverkehr zur Arbeit? Dann nutze unseren BVG- Zuschuss!\u003c/li\u003e\n\u003cli\u003eEinen Dienstwagen für deine Kundentermine und Familienausflüge\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eFühlst Du dich der Herausforderung gewachsen? Dann schick uns deinen Lebenslauf!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAnsprechpartner: Felix Schwarz\nTelefonnummer: 030 264745 337\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your CV to \u003ca href=\"mailto:felix.schwarz@arxes-tolina.de\"\u003efelix.schwarz@arxes-tolina.de\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXVjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--22fd138e123dee60d94613e260f3168f63c4751b/MicrosoftTeams-image.png"},{"id":"afb5f880-8368-4d6b-9904-082b56da6772","type":"Full Time","url":"https://jobs.github.com/positions/afb5f880-8368-4d6b-9904-082b56da6772","created_at":"Fri Mar 12 14:19:00 UTC 2021","company":"Smart Pricer GmbH ","company_url":"http://www.smart-pricer.com","location":"Berlin ","title":"Backend Developer - (m/f/d)","description":"\u003cp\u003eSmart Pricer is the leading ticket pricing company in Europe. We offer pricing services in the areas of sports, entertainment and ski resorts and are proud to work with partners such as FC Bayern Munich, DFB, Hertha BSC, Sölden ski resort, Zermatt Bergbahnen and many more. Our work is characterized by entrepreneurial thinking, effective transaction management and innovative solutions. We owe our success as one of the world's leading specialists in our field not least to a distinctly team-oriented approach.\u003c/p\u003e\n\u003cp\u003eTogether we want to grow further and are therefore looking for a\u003c/p\u003e\n\u003cp\u003eBackend Developer - (m/f/d)\u003c/p\u003e\n\u003cp\u003eto support us as soon as possible.\u003c/p\u003e\n\u003cp\u003eWith us, you are part of a committed and motivated team that rethinks the way pricing is done with a lot of enthusiasm and drive from Berlin. If you want to take on responsibility from day one and drive our mission forward with your own ideas, then your application is just right with us.\u003c/p\u003e\n\u003cp\u003eYour Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWithin the first three months, you will familiarize yourself with our existing services (you have access to documentations and team members)\u003c/li\u003e\n\u003cli\u003eYou will lead and own the development of our back-end pricing services incl. the design and deployment of APIs to run our services\u003c/li\u003e\n\u003cli\u003eYour responsibilities will range - from rapidly building prototypes in product discovery phase, to delivering reliable quality products in delivery phase, to developing our tech architecture further ensuring functionality, scalability, reliability and security (a hands-on mind-set and strategic oversight are essential for this)\u003c/li\u003e\n\u003cli\u003eYou will define the technical requirements of the company in detail and set up all required processes\u003c/li\u003e\n\u003cli\u003eIn 6-9 month time you will start to build and manage a small technical team of A-players (including software engineers, data scientists)\u003c/li\u003e\n\u003cli\u003eTogether with the founders you and your team will continuously iterate our product by developing hypotheses, validating them (e.g. through user research and tests) and shipping new features\u003c/li\u003e\n\u003cli\u003eYou own the operative KPIs tech and will be the voice of tech in all strategic decisions\u003c/li\u003e\n\u003cli\u003eYou oversee the monitoring of our live pricing services\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSoftware Developer with a degree in a technical related field such as Computer Science, Bio/Informations or similar\u003c/li\u003e\n\u003cli\u003eYou have at least 3 years experience working in Software Development\u003c/li\u003e\n\u003cli\u003eYou are skilled in several backend languages (Go, Ruby) and in working with and deploying cloud services in a Unix environment\u003c/li\u003e\n\u003cli\u003eOptionally you have some frontend experience in TypeScript and CoffeeScript as well as some data analytics background in Python\u003c/li\u003e\n\u003cli\u003eYou combine a strong hands-on-attitude (and are happy to develop and maintain code yourself) with strategic thinking and an entrepreneurial mindset\u003c/li\u003e\n\u003cli\u003eYou have a high focus on customer needs and contribute your best knowledge and experience about technology, products and processes\u003c/li\u003e\n\u003cli\u003eYou are interested in pricing, data mining, ML\u003c/li\u003e\n\u003cli\u003eYou are characterized by a sovereign appearance as well as good presentation and communication skills\u003c/li\u003e\n\u003cli\u003eYou are fluent in English and German\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat We Offer:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA friendly and respectful team with a family work culture\u003c/li\u003e\n\u003cli\u003eA great workplace in Berlin Mitte with a part-time remote work option\u003c/li\u003e\n\u003cli\u003eThe chance to take over a large area of expertise very quickly and to make a steep entry into a management position\u003c/li\u003e\n\u003cli\u003eAn attractive compensation package\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003cli\u003eA secure employment relationship\u003c/li\u003e\n\u003cli\u003eMeaning - our work has direct impact on sports and entertainment pricing across all of Europe\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eWe are happy to receiving your application by e-mail, stating your desired salary and earliest possible starting date, at: \u003ca href=\"mailto:miriam.weber@smart-pricer.com\"\u003emiriam.weber@smart-pricer.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbWFjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--74a56e5e88ac7195798fd6d2d553cec130e90f9e/Smart%20Pricer%20Logo.jpg"},{"id":"50e7a6e5-cfc9-415e-a681-2eec2f631d3b","type":"Part Time","url":"https://jobs.github.com/positions/50e7a6e5-cfc9-415e-a681-2eec2f631d3b","created_at":"Fri Mar 12 13:56:42 UTC 2021","company":"Hallo Welt Systeme UG (haftungsbeschränkt)","company_url":"http://volla.online","location":"Germany","title":"Android System Developer for the Volla Phone","description":"\u003cp\u003eWe are a young German company based in Remscheid, which started with private equity and two successful crowd funding projects and offers you a perspective for the future.\u003c/p\u003e\n\u003cp\u003eWe want to make an innovative alternative to Google and Apple available for everyone, that ensures our freedom through simplicity and privacy protection. It implements a new approach of user interface and user experience.\u003c/p\u003e\n\u003cp\u003eYou would work with a small international Team and growing community from all over the world. You are free to work in your home office with an agreed availability of 1, 2 or 3 days per week for three month with a perspective to extend the contract.\u003c/p\u003e\n\u003cp\u003eYour tasks:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMaintenance and improvement of Volla OS\u003c/li\u003e\n\u003cli\u003eEnabling regular system updates and patches of AOSP upstream project\u003c/li\u003e\n\u003cli\u003eCustom patches for security and privacy protection\u003c/li\u003e\n\u003cli\u003eMaintenance and improvement of custom system app integration\u003c/li\u003e\n\u003cli\u003eIntegrating network traffic control\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYou should have the following skills:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with the development of custom ROMs based on AOSP\u003c/li\u003e\n\u003cli\u003eExperience with Android Board Support Packages\u003c/li\u003e\n\u003cli\u003eExperience with Continuous Integration, preferably GitLab\u003c/li\u003e\n\u003cli\u003eKnowledge in hardware adaptation of Android\u003c/li\u003e\n\u003cli\u003eknowledge in Android Studio and Android Tools\u003c/li\u003e\n\u003cli\u003eKnowledge in open source projects and platforms like GitHub\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eInterested? We look forward to receiving your application with CV and references!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"mailto:jobs@volla.online\"\u003ejobs@volla.online\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbVNjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--647918d0d162d445c63fdde7b3fb28a4604fcbf6/Logo%20for%20Device.png"},{"id":"84416907-e6ce-43f7-9a1d-351818c076dc","type":"Full Time","url":"https://jobs.github.com/positions/84416907-e6ce-43f7-9a1d-351818c076dc","created_at":"Fri Mar 12 13:37:22 UTC 2021","company":"ORTEC ","company_url":"https://ortec.com","location":"Zoetermeer","title":"DevOps Engineer","description":"\u003cp\u003eAs a \u003cstrong\u003eDevOps engineer\u003c/strong\u003e at ORTEC, one of your main goals is to empower our 130+ software developers around the globe with regards to our software development tools. This means maintenance on existing tools and R\u0026amp;D and implementation of new systems \u0026amp; tools supporting our product transition to the cloud (Azure)\u003c/p\u003e\n\u003cp\u003eOur team of DevOps - and System engineers is the spinning wheel in the software and product development unit. As a \u003cstrong\u003eDevOps engineer\u003c/strong\u003e you work on technical projects.\u003c/p\u003e\n\u003cp\u003eThe team maintains, improves, migrates, and supports all the development systems and tooling that are needed to keep the software and product development empowered and productive. The team is responsible for a versatile portfolio like:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eContinuous integration and Continuous deployment environment (Jenkins, Azure DevOps, Team city)\u003c/li\u003e\n\u003cli\u003eVersion control system (Perforce \u0026amp; Git)\u003c/li\u003e\n\u003cli\u003eTest case management software (Testrail)\u003c/li\u003e\n\u003cli\u003eNuGet repository management (Nexus)\u003c/li\u003e\n\u003cli\u003eIssue and project software (Jira, Azure DevOps)\u003c/li\u003e\n\u003cli\u003eVirtual Machines (vSphere and HyperV) for software \u0026amp; test engineers with the required tooling to do the job!\nAnd more…\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe team is growing towards a team of four to five DevOps - and System engineers. It is also responsible for all integrations between the systems \u0026amp; tools. Next to that, the system engineers maintain and develop all automation to deploy and update the systems \u0026amp; tools.\u003c/p\u003e\n\u003cp\u003eIt is important that you embrace the “DevOps” culture. If people have questions or want support and advice regarding (cloud) infrastructure, automation or the best tooling for the job, you are the “go to” person. We also monitor that the software is automatically build, tested and deployed in the cloud using our continuous integration and continuous delivery pipelines. You work close together with the IT department and you keep aligned with other internal stakeholders.\u003c/p\u003e\n\u003ch2\u003eWho you are\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eYou embrace the DevOps culture\u003c/li\u003e\n\u003cli\u003eAutomating is your second nature\u003c/li\u003e\n\u003cli\u003eYou have knowledge of Virtualization, PowerShell and Windows Server Platform\u003c/li\u003e\n\u003cli\u003eYou can learn quickly to understand Jira, Perforce, Git, etc.\u003c/li\u003e\n\u003cli\u003eYou have a relevant bachelor’s degree\u003c/li\u003e\n\u003cli\u003eYou like to consult others, but also to do the work yourself\u003c/li\u003e\n\u003cli\u003eYou have 2+ years of relevant working experience\u003c/li\u003e\n\u003cli\u003eWillingness to take part in on-call duties to support our customers 24/7 (approx. 8 weeks per year).You will be generously compensated\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWhat we offer\u003c/h2\u003e\n\u003cp\u003eWe are a small, relatively new growing team and with that you will find a ‘start-up’-atmosphere which gives you ample opportunity to explore, learn and grow, and make it your team.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEntrance to the most passionate powerhouse in applied mathematics\u003c/li\u003e\n\u003cli\u003eJoin our movement and improve the world\u003c/li\u003e\n\u003cli\u003eEnjoy an open, kind and fun culture\u003c/li\u003e\n\u003cli\u003eNS Business Card 100%, NS Business Card, lease opportunity or commuting allowance: it’s your choice\u003c/li\u003e\n\u003cli\u003eMobility allowance of 3% of your base salary\u003c/li\u003e\n\u003cli\u003e25 annual leave days, additional days from the age of 35\u003c/li\u003e\n\u003cli\u003eResult related remuneration\u003c/li\u003e\n\u003cli\u003eActive employee association for fun activities with colleagues and content driven Young ORTEC for you to join\u003c/li\u003e\n\u003cli\u003eWe help you to #stayhealthy, to #stayeffective and to #stayconnected: we organize online activities such as pub quizzes, online sports events, social calls with colleagues, and much more\u003c/li\u003e\n\u003cli\u003eYear-end bonus equal to a full month’s pay\u003c/li\u003e\n\u003cli\u003eWe believe in commitment: your permanent contract will be waiting for you\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWhat to expect\u003c/h2\u003e\n\u003cp\u003eWe will help you to thrive in your field of expertise. We offer development programs, tailored to your individual needs and function requirements, including opportunities to attend courses and seminars. We offer challenging, practical hands-on experience with opportunities to work abroad. We operate in a flat organizational structure that keeps communication lines short. The atmosphere is open, informal, cooperative and positive. We employ over 1000 people in the Netherlands (HQ), Belgium, Germany, France, the U.K., Romania, Italy, the U.S., Australia, Brazil, Poland, Denmark and Singapore. Visit our website \u003ca href=\"http://www.ortec.com\"\u003ewww.ortec.com\u003c/a\u003e to learn more about our solutions and clients’ experiences.\u003c/p\u003e\n\u003cp\u003ePlease do not use this vacancy as an acquisition opportunity.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eInterested?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eApply now via the \u003cstrong\u003eapplication form\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/3rEupFy\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/3rEupFy\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbCtjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9c2c222f6ca6056210264a039dc35d35a6ce8e91/ortec.jpeg"},{"id":"2a2a95ca-0c3d-4e37-8817-67dacefafa50","type":"Full Time","url":"https://jobs.github.com/positions/2a2a95ca-0c3d-4e37-8817-67dacefafa50","created_at":"Fri Mar 12 12:46:11 UTC 2021","company":"Invinity Energy Systems","company_url":"https://vonq.io/3tq0hi3","location":"Vancouver","title":"Electronics Test Engineer","description":"\u003ch2\u003eCompany Description\u003c/h2\u003e\n\u003cp\u003eThe Invinity team is growing rapidly, and we’re looking for people with a passion for renewable energy to join us at this remarkable point in our growth.\u003c/p\u003e\n\u003cp\u003eWe are an emerging global cleantech leader; well-funded with category-leading technology. Our culture is collaborative, entrepreneurial, and one in which speaking up is encouraged and ideas are chosen on merit not who they come from.\u003c/p\u003e\n\u003cp\u003ePeople love working at Invinity because we know we are empowered to make a meaningful impact. We’re small enough that every team member plays a critical role in our daily business, but large enough that the batteries we build are being deployed at significant scale in landmark clean energy projects around the world.\u003c/p\u003e\n\u003cp\u003eWhether you are a cleantech veteran or looking to make a career shift, Invinity offers you a chance to work as part of an expert team located across multiple geographies, aligned in our mission to build a sustainable energy future.\u003c/p\u003e\n\u003cp\u003eInvinity is committed to providing equal opportunities in the workplace and follows a comprehensive Equal Opportunities Policy to ensure all employees are valued and can reach their full potential.\u003c/p\u003e\n\u003ch2\u003eJob Description\u003c/h2\u003e\n\u003cp\u003eAs the world transitions to a renewable energy future, large-scale energy storage systems are required to bridge the gap between intervals of renewable energy production. Invinity Energy Systems, listed on the London Stock Exchange, is the leader in vanadium flow batteries, a proven technology addressing the global demand for energy storage.\u003c/p\u003e\n\u003cp\u003eInvinity is seeking an Electronics Test Engineer to join its product development team. This role will work closely with the electronics design team to develop and conduct comprehensive verification test plans. You will be responsible for developing and maintaining the testing infrastructure and equipment necessary to verify robust designs and design the test methods. You will work closely with other teams to establish and conduct various integration tests and provide detailed reports back to design teams.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, source, and build test electronic test equipment including complex electronic test benches.\u003c/li\u003e\n\u003cli\u003eWork with electronics design team to create test plans and conduct tests.\u003c/li\u003e\n\u003cli\u003eSupport root cause analysis and troubleshooting of field failures of electronic\ncomponents.\u003c/li\u003e\n\u003cli\u003eEngage with contract electronic designers, reviewing and auditing test plans.\u003c/li\u003e\n\u003cli\u003eSupport and conduct product certification testing, working with third-party testing labs to provide equipment.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eQualifications\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years experience testing and/or designing electronic systems and related components.\u003c/li\u003e\n\u003cli\u003eExperience working with high voltage AC and DC electronic systems and related test equipment: power supplies, oscilloscopes, dataloggers, etc.\u003c/li\u003e\n\u003cli\u003eStrong documentation skills, writing and reviewing test plans and reports.\u003c/li\u003e\n\u003cli\u003eExperience working in a structured product development environment.\u003c/li\u003e\n\u003cli\u003eAble to read and understand DFMEA and various design documentation.\u003c/li\u003e\n\u003cli\u003eExperience working with contract design and development teams. Proficiency working hands-on with electronics and printed circuit board assemblies, capable of reworking through-hole and SMD components.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDesirable\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCapable of developing interface software programming (LabVIEW, Python, other) to support use and automation of test equipment.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eAdditional Information\u003c/h2\u003e\n\u003cp\u003eIf the idea of building a world-class development team and helping the world transition to renewable energy is exciting to you. If being a part of a dynamic, global company where the team works with passion but not ego sounds appealing, Invinity may just be where you belong.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/3tq0hi3\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHljIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5705486e3a9bfa1b6ec23ea659b37d7f7346e9d6/Invinity%20Energy%20Systems.jpg"},{"id":"77402588-6286-4aa3-b8c5-988f8dcbbba3","type":"Full Time","url":"https://jobs.github.com/positions/77402588-6286-4aa3-b8c5-988f8dcbbba3","created_at":"Fri Mar 12 12:07:48 UTC 2021","company":"DONE! Berlin","company_url":"https://doneberlin.com","location":"Berlin","title":"Fullstack Developer (m/f/d) @Footprint in Berlin","description":"\u003cp\u003eWe are DONE! Berlin, an international consultancy specializing in helping fast-growing companies of all sizes to navigate the ever-changing world of work. Among other things, we help our clients attract the best talent to their companies.\u003c/p\u003e\n\u003cp\u003eOur client Footprint Technologies GmbH is a young, ambitious start-up located in Berlin. The company's mission is to develop a technology that allows online shoppers to easily and accurately measure their feet at home in order to always find the perfect fitting shoe. With this solution, online retailers will reduce their returns, costs and emissions. In product development Footprint consistently places the user and data insights at the center of all activities and decisions.\u003c/p\u003e\n\u003cp\u003eTo help Footprint achieve its mission, we are looking for a talented Fullstack developer (m/f/d). You’re a smart person with a strong drive and keen to work in a collaborative culture? Great! Because we want you to take the initiative to move Footprint forward by bringing in your own ideas.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop multi-platform web frontends for mobile and desktop\u003c/li\u003e\n\u003cli\u003eConceptualize, implement and maintain user-facing features for Footprint's products\u003c/li\u003e\n\u003cli\u003eDesign and develop backend APIs\u003c/li\u003e\n\u003cli\u003eDevelop reusable libraries\u003c/li\u003e\n\u003cli\u003eOptimize the applications for performance and responsiveness\u003c/li\u003e\n\u003cli\u003eSupport maintaining CI/CD pipelines and databases in the cloud\u003c/li\u003e\n\u003cli\u003eDevelop web frontend applications when needed\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIdeally a completed degree in Computer Science, Software Engineering or related field\u003c/li\u003e\n\u003cli\u003eAround 5 years of experience in developing web applications in cloud, ideally using node.js/ nest.js and Typescript\u003c/li\u003e\n\u003cli\u003eProven experience in developing frontend projects, ideally using React and Typescript/ JavaScript with HTML5 and CSS\u003c/li\u003e\n\u003cli\u003eGood understanding of Test-driven development (TDD), CI/CD pipelines, DevOps principles and MS-Azure\u003c/li\u003e\n\u003cli\u003eHaving fun in solving complex problems\u003c/li\u003e\n\u003cli\u003eGood level of English (C1 Level minimum)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eNice to Have\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with Kubernetes and Docker\u003c/li\u003e\n\u003cli\u003eExperience in using Grafana and Sentry (or similar)\u003c/li\u003e\n\u003cli\u003eExperience in developing with C# and Go for cloud applications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBeing transparent is the best way for Footprint to find solutions and grow together. The team pursues a culture where they frankly address anything that concerns them or affects their work. They bring in a rich combination of skillsets and individual strengths, making them a powerful team.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSteep learning curve by working independently in your own field within Footprint's fabulous development team\u003c/li\u003e\n\u003cli\u003eOpportunity to further develop your experience by certified trainings when required\u003c/li\u003e\n\u003cli\u003eMaximum freedom and trust in terms of your working time, location and holidays\u003c/li\u003e\n\u003cli\u003eGuidance and coaching whenever needed as well as support in finding the right mentors from our broad network of experts\u003c/li\u003e\n\u003cli\u003eFair and transparent compensation model\u003c/li\u003e\n\u003cli\u003eAnd yes - fresh fruits and unlimited coffee are guaranteed! So are team lunches and beers as soon as we're allowed to have them again!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eLooking forward to hearing from you!\u003c/strong\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://doneberlin.join.com/jobs/1967509-fullstack-developer-m-f-d-footprint-in-berlin?pid=357a3b4531918760973f\u0026amp;oid=7b2bd1b9-6d24-4e96-9bfe-fb7fea6a4d6e\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=fullstack%2Bdeveloper%2Bm%2Bf%2Bd%2Bfootprint%2Bin%2Bberlin\"\u003ehttps://doneberlin.join.com/jobs/1967509-fullstack-developer-m-f-d-footprint-in-berlin?pid=357a3b4531918760973f\u0026amp;oid=7b2bd1b9-6d24-4e96-9bfe-fb7fea6a4d6e\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=fullstack%2Bdeveloper%2Bm%2Bf%2Bd%2Bfootprint%2Bin%2Bberlin\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbGljIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--591982ec4af55dc7aa33632d01b31c88aa030974/done-berlin-logo-l.jpg"},{"id":"05b6e9b2-8a2c-4af8-aa18-9d5c93fe6699","type":"Full Time","url":"https://jobs.github.com/positions/05b6e9b2-8a2c-4af8-aa18-9d5c93fe6699","created_at":"Fri Mar 12 11:59:42 UTC 2021","company":"presize.ai","company_url":"https://www.presize.ai","location":"Munich, München","title":"Front End Software Engineer (m/f/d)","description":"\u003cp\u003e\u003cstrong\u003eYour responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eMission\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eEnable millions of people to get the right size when shopping online by integrating Presize with leading fashion eCommerce vendors. Work closely with major online shops to ensure the success of each new project, release groundbreaking new features, and build a world-class UX, to help many more people return much fewer packages.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIntegrate Presize with leading fashion eCommerce shops\u003c/li\u003e\n\u003cli\u003eDevelop novel features for our sizing app, integrations, customer dashboard according to the Build Measure - Learn cycle\u003c/li\u003e\n\u003cli\u003eSetup A/B tests and rapidly iterate based on data-driven insights from user analytics and business intelligence\u003c/li\u003e\n\u003cli\u003eBuild world-class, beautiful, and simple to use UIs that users will absolutely love with our product designer and UX team\u003c/li\u003e\n\u003cli\u003eCreate exciting customer demos for Pre-Sales and prototype PoCs for user tests\u003c/li\u003e\n\u003cli\u003eOptimize loading speed and performance and increase device support\u003c/li\u003e\n\u003cli\u003eDevelop automated tests to ensure world-class software quality\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour profile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGraduate in BSc/MSc in Informatics, Data Science, Business Information - Systems or similar\u003c/li\u003e\n\u003cli\u003e2 years professional experience in Software Engineering and web development\u003c/li\u003e\n\u003cli\u003eExcellent knowledge in the HTML5 stack (HTML, JavaScript ES6+, CSS3)\u003c/li\u003e\n\u003cli\u003eProven sense of great design and attention to detail\u003c/li\u003e\n\u003cli\u003eFoundational knowledge in React, LitElement (or a similar library/framework) is a big plus\u003c/li\u003e\n\u003cli\u003eKnowledge in visual prototyping tools such as Figma / Sketch or similar is a plus\u003c/li\u003e\n\u003cli\u003eExperience in Cloud Services (AWS, GCP, similar) is a plus\u003c/li\u003e\n\u003cli\u003eReliable, impact-driven, and eager to learn fast with an independent working style, and aiming to go meet and exceed expectations and go beyond\u003c/li\u003e\n\u003cli\u003eProduct, growth, and excellence-driven mindset with the desire to solve big problems in a startup environment\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://presize.join.com/jobs/1959751-front-end-software-engineer-m-f-d?pid=357a3b4531918760973f\u0026amp;oid=0fab34cd-7456-423f-a568-d9511cb9730b\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=front%2Bend%2Bsoftware%2Bengineer%2Bm%2Bf%2Bd\"\u003ehttps://presize.join.com/jobs/1959751-front-end-software-engineer-m-f-d?pid=357a3b4531918760973f\u0026amp;oid=0fab34cd-7456-423f-a568-d9511cb9730b\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=front%2Bend%2Bsoftware%2Bengineer%2Bm%2Bf%2Bd\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbGFjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2bb1aa1e7f67ae0ad1c081a37c7d55b169e85050/presize.jpg"},{"id":"8a68aad7-c6ae-4b42-a56a-f187f1850207","type":"Full Time","url":"https://jobs.github.com/positions/8a68aad7-c6ae-4b42-a56a-f187f1850207","created_at":"Fri Mar 12 11:55:39 UTC 2021","company":"ValueWorks GmbH","company_url":"https://www.valueworks.ai","location":"Remote","title":"Front-end developer","description":"\u003cp\u003eValueWorks is a management platform to help executives and managers make data-driven management decisions. We enable them to manage and measure the performance of their business by integrating the data from different information systems (JIRA, Salesforce, LinkedIn,) to build KPIs and OKRs.\u003c/p\u003e\n\u003cp\u003eWe are looking for a front-end developer to build and implement our user interface. You will work with our small team consisting of developers, founders and a UX designer. We provide an opportunity to become full-stack by teaching you python and django.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStrong knowledge of HTML, CSS \u0026amp; Javascript\u003c/li\u003e\n\u003cli\u003eVue.js and Vuex experience (alternatively React)\u003c/li\u003e\n\u003cli\u003eAbility to build responsive, cross-browser user interfaces from design prototype\u003c/li\u003e\n\u003cli\u003eAbility to create simple, intuitive web interfaces for complex features.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eNo special qualification is needed. Just experience and talent.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBootstrap experience\u003c/li\u003e\n\u003cli\u003eEagerness to become a full stack developer\u003c/li\u003e\n\u003cli\u003eExperience working with relational databases\u003c/li\u003e\n\u003cli\u003eWe are looking forward to your application.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://valueworks.join.com/jobs/1990556-front-end-developer?pid=357a3b4531918760973f\u0026amp;oid=b83c4b8b-8f91-493f-8bb7-5901344e9f8d\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=front-end%2Bdeveloper\"\u003ehttps://valueworks.join.com/jobs/1990556-front-end-developer?pid=357a3b4531918760973f\u0026amp;oid=b83c4b8b-8f91-493f-8bb7-5901344e9f8d\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=front-end%2Bdeveloper\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbEtjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7aa1d9010f1d849fde6c5634ee2a843cb50b4778/value-works-gmb-h-logo-xl.png"},{"id":"97d8aff5-1c3c-4f41-b4e3-672d3aae0c31","type":"Full Time","url":"https://jobs.github.com/positions/97d8aff5-1c3c-4f41-b4e3-672d3aae0c31","created_at":"Fri Mar 12 11:01:01 UTC 2021","company":"ORTEC - Optimize Your World","company_url":"https://vonq.io/3cfRmbS","location":"Zoetermeer","title":"Junior System Engineer IT Infrastructure","description":"\u003ch2\u003eJob description\u003c/h2\u003e\n\u003cp\u003eHave you just finished your studies or already have experience in IT and you want to play a key role in the functionality of all ORTEC IT products worldwide? Do you want to develop yourself further in the world of IT infrastructure as a (junior/medior) System Engineer IT Infrastructure? Then keep reading!\u003c/p\u003e\n\u003cp\u003eORTEC is world leader in optimizing business processes and enriching data, which enables our customers to be more efficient, profitable and competitive. With our mathematical knowledge, clever algorithms, data science models and software engineering skills, we support global companies in making smart strategic, tactical as well as real-time operational decisions.\u003c/p\u003e\n\u003cp\u003eIn this role as Junior/Medior System Engineer IT Infrastructure, you are part of the Infra Team and you manage, monitor, extend and improve our IT infrastructure globally. You participate in various projects. Key tasks consist of preparing, executing and administration of projects.\u003c/p\u003e\n\u003cp\u003eYou work together with your team on functional and technical maintenance tasks, developing, testing, accepting and implementing of changes and solving third line requests. Using your analytical skills as well as your experience and knowledge you are a knowledgeable sparring partner for the business. Together with your team members you anticipate on how the current infrastructure should develop and how to adapt new technologies beneficial to ORTEC.\u003c/p\u003e\n\u003cp\u003eThe IT department consist of about 30 people, where your team contains 6 including yourself. We have an informal, social atmosphere within the IT department; we go for lunch together, we meet online, we organize events, we know how to have fun, and we share personal stories just as well. And of course we work together a lot, as we believe we all have our strengths and combined we will come to the best solution possible.\u003c/p\u003e\n\u003cp\u003eDo you like to be part of our journey to (continuous) success? Then apply online today, or contact Falko Hage (Recruiter) at \u003ca href=\"mailto:recruitment@ortec.com\"\u003erecruitment@ortec.com\u003c/a\u003e for more information.\u003c/p\u003e\n\u003ch2\u003eWho you are\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eA bachelor’s degree in computer science or comparable level gained through experience\u003c/li\u003e\n\u003cli\u003eYou are currently living in the Netherlands and are able to fluently communicate in Dutch and English (verbally and in writing)\u003c/li\u003e\n\u003cli\u003eYou have 2+ years of experience in IT or are a recent bachelor graduate eager and able to quickly grow into this role.\u003c/li\u003e\n\u003cli\u003eExperienced in:\n\u003cul\u003e\n\u003cli\u003eMicrosoft Windows systems\u003c/li\u003e\n\u003cli\u003eVirtualization platform Hyper-V VMM (VMWare is a preference)\u003c/li\u003e\n\u003cli\u003eNetwork protocols such as TCP/IP, DNS, DHCP and VPN\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003eKnowledge of storage (Microsoft Storage Space Direct), switching/ routing technology and firewalls is a preference\u003c/li\u003e\n\u003cli\u003eAnalytical, with the ability to translate towards solutions\u003c/li\u003e\n\u003cli\u003eYou prefferably have experience in projects and are used to delivering a high standard of quality.\u003c/li\u003e\n\u003cli\u003eYou are open-minded to the ideas of others, and understand the different (cultural) perspectives and you are able to convey your ideas to others\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWhat we offer\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eEntrance to the most passionate powerhouse in applied mathematics\u003c/li\u003e\n\u003cli\u003eWe believe in commitment: your permanent contract will be waiting for you\u003c/li\u003e\n\u003cli\u003eAn open, kind and fun culture\u003c/li\u003e\n\u003cli\u003eNS Business Card, lease opportunity or commuting allowance: it’s your choice\u003c/li\u003e\n\u003cli\u003eMobility allowance of 3% of your base salary\u003c/li\u003e\n\u003cli\u003e25 annual leave days, additional days from the age of 35\u003c/li\u003e\n\u003cli\u003eResult related remuneration\u003c/li\u003e\n\u003cli\u003eYear-end bonus equal to a full month’s pay\u003c/li\u003e\n\u003cli\u003eDevelopment tailored to your needs, including opportunities to attend courses and seminars\u003c/li\u003e\n\u003cli\u003eActive employee association for fun activities with colleagues and content driven Young ORTEC for you to join\u003c/li\u003e\n\u003cli\u003eFootball table, our own bar the “ORtap”, Christmas party, annual barbecue at one of our founders’ home, and much more\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWhat to expect\u003c/h2\u003e\n\u003cp\u003eWe help you to thrive in your field of expertise. We offer development programs, tailored to your individual needs and function requirements, including opportunities to attend courses and seminars. We offer challenging practical hands-on experience with opportunities to work abroad. We operate a flat organizational structure that keeps communication lines short. The atmosphere is open, informal, cooperative and positive. We employ over 1000 people in the Netherlands (HQ), Belgium, Germany, France, the U.K., Romania, Italy, the U.S., Australia, Brazil, Poland and Denmark.\u003c/p\u003e\n\u003cp\u003eVisit our website \u003ca href=\"http://www.ortec.com\"\u003ewww.ortec.com\u003c/a\u003e to learn more about our solutions and clients' experiences.\u003c/p\u003e\n\u003ch2\u003eInterested?\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/3cfRmbS\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eAcquisition as a result of this vacancy is not appreciated.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/3cfRmbS\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaytjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d5c0c1658651d1b2cdaec63b5c848fdf67dabd65/companyLogo-ORTEC_logo_2021.jpg"},{"id":"31dd226f-7c4d-4b5a-934d-b139c66ed835","type":"Full Time","url":"https://jobs.github.com/positions/31dd226f-7c4d-4b5a-934d-b139c66ed835","created_at":"Fri Mar 12 09:33:16 UTC 2021","company":"ti\u0026m AG","company_url":"https://www.ti8m.com/","location":"Zürich","title":"Senior Software Engineer Web Front-end","description":"\u003cp\u003eti\u0026amp;m steht für technology, innovation \u0026amp; management. Wir sind Leader für Digitalisierungs-, Security-, Innovationsprojekte und -produkte in der Schweiz und streben dasselbe in weiteren Finanz- und Technologiezentren an. Dabei integrieren wir für unsere anspruchsvollen Kunden die gesamte IT-Wertschöpfungskette vertikal. In unseren Niederlassungen in Zürich, Bern, Frankfurt am Main und Singapur beschäftigen wir aktuell über 400 exzellente Ingenieure, Designer und Berater. Weitere Niederlassungen werden folgen. Die Grundlage unseres Wachstums sind unsere Stärken und unsere Werte: Mut, Ideenreichtum, Agilität und unternehmerisches Flair gepaart mit Nachhaltigkeit und Swissness.\u003c/p\u003e\n\u003cp\u003eWen wir suchen:\u003c/p\u003e\n\u003cp\u003eIm Rahmen unseres starken Wachstums suchen wir für die Beratung unserer Kunden und die Umsetzung von Projekten im Bereich Web-Applikationen interessierte Persönlichkeiten als Senior Software-Ingenieur Web-Frontend. Die anspruchsvollen Tätigkeiten setzen einen (Fach-) Hochschulabschluss in Informatik, ausgewiesene Berufserfahrung, stilsicheres Deutsch und Englisch in Wort und Schrift, Flexibilität, Einsatzbereitschaft und Interesse am Umgang mit Kunden und Mitarbeitenden voraus.\u003c/p\u003e\n\u003cp\u003eWas dich erwartet:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUnterstützung bei der Analyse, Konzeption und der Umsetzung von komplexen Projekten im Bereich Web-, CMS-, Shop- und Portallösungen mit Fokus Frontend\u003c/li\u003e\n\u003cli\u003eMitarbeit bei technischen Lösungskonzepten sowie Abwicklung von Beratungsmandaten im Web-Frontend Umfeld\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWas du mitbringen solltest:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMehrjährige Erfahrung in Konzeption, Design und Umsetzung von Frontend-Lösungen mittels modernen Web-Technologien (HTML5, CSS3, JavaScript/TypeScript)\u003c/li\u003e\n\u003cli\u003eErfahrung in der Umsetzung von grafischen Entwürfen für unterschiedliche Ausgabemedien (Desktop und mobile Endgeräte, Responsive Webdesign)\u003c/li\u003e\n\u003cli\u003eFähigkeit, Kompatibilität für die verschiedenen Web-Browser sicherzustellen\u003c/li\u003e\n\u003cli\u003eProfunde Kenntnisse in mindestens einem JavaScript-Framework wie React oder Angular\u003c/li\u003e\n\u003cli\u003eErfahrung mit Build-Tools wie Webpack oder Grunt\u003c/li\u003e\n\u003cli\u003eErfahrungen und Know-how mit CSS-Precompilern wie SASS/SCSS, Stylus oder LESS\u003c/li\u003e\n\u003cli\u003eErfahrung mit Unit- und e2e-Testing Tools wie Jest, Karma, Jasmine, Protractor oder ähnlichen Tools\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWas wir bieten:\u003c/p\u003e\n\u003cp\u003eUnsere Mitarbeitenden wählten uns zu einem der besten Arbeitgeber der Schweiz. Als Gewinner von Best of Swiss Apps und vom Digital Economy Award surfst du mit uns an der Spitze der technologischen Entwicklung. Zudem erlebst du bei uns ein interessantes und dynamisches Umfeld, abwechslungsreiche Arbeit an aufregenden Projekten mit Mut für Innovation, ein kollegiales Arbeitsklima und flexible Arbeitszeiten. Mit ti\u0026amp;m liquid working bieten wir dir ausserdem einfach anpassbare Arbeitszeitmodelle und die Möglichkeit Auszeiten zu nehmen. Die ti\u0026amp;m academy ermöglicht dir konstante Weiterbildung am Puls der Zeit.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://ti8mcareer.abacuscity.ch/de/job_1_1035/Senior-Software-Engineer-Web-Front-end\"\u003ehttps://ti8mcareer.abacuscity.ch/de/job_1_1035/Senior-Software-Engineer-Web-Front-end\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBajJjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--517035d1db291cfa40eb67f565a215a3907f9618/ti8m_logo_ict.jpg"},{"id":"ae9b5e05-e2cc-4461-a07d-69dde55566eb","type":"Full Time","url":"https://jobs.github.com/positions/ae9b5e05-e2cc-4461-a07d-69dde55566eb","created_at":"Fri Mar 12 10:34:34 UTC 2021","company":"v-Office","company_url":"https://intro.v-office.com/de/","location":"Remote","title":"Web-Developer (m,w,d)","description":"\u003cp\u003eWir, das Team von vOffice, tun alles dafür, um unseren Kunden die Arbeit zu erleichtern. Unsere Software macht die Verwaltung und Organisation von Ferienobjekten zum Kinderspiel. Von der Onlinebuchung auf unseren Websites bis zur Team-Einsatzplanung wird alles über unsere moderne Cloudsoftware abgewickelt. Als schnell wachsendes Unternehmen und Marktführer in Deutschland benötigen wir tatkräftige Unterstützung im Bereich Web-Entwicklung.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAufgaben\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eJeder unserer Kunden braucht eine tolle Webseite. Viele nutzen dafür unser in-house-Angebot, dass auf unserem custom CMS beruht. Du richtest darin neue Websites ein, d.h. Du integrierst die individuellen Anforderungen in die vorhandenen Templates. Du entwickelst die Templates weiter, damit jeder unserer Kunden das Passende findet. Und Du hilfst unseren Bestandskunden, ihre Websites zu verbessern und zu aktualisieren.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eQualifikation\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFundierte Kenntnisse in der Webseiten-Entwicklung: CSS (LESS/Post CSS), Javascript, webpack, Erfahrung mit Vue.js von Vorteil\u003c/li\u003e\n\u003cli\u003eAutonome und strukturierte Arbeitsweise\u003c/li\u003e\n\u003cli\u003eZielorientierter Teamplayer, den nichts so schnell aus der Ruhe bringt\u003c/li\u003e\n\u003cli\u003eEnglisch (verhandlungssicher)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWerde Teil eines sympathischen Teams in einem dynamischen Umfeld\u003c/li\u003e\n\u003cli\u003eViel Handlungsspielraum, kurze Abstimmungswege\u003c/li\u003e\n\u003cli\u003eEin flexibles, familienfreundliches Arbeitszeitmodell\u003c/li\u003e\n\u003cli\u003eEin modern ausgestatteter Arbeitsplatz mit Blick auf die Ostsee oder citynah in Hamburg-Altona\u003c/li\u003e\n\u003cli\u003eHome-Office möglich, egal wo Du wohnst\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eDas ist der richtige Job wenn Du Bock hast auf\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStart-up-Feeling\u003c/li\u003e\n\u003cli\u003eTeam-Work\u003c/li\u003e\n\u003cli\u003eGestalten und Gewinnen\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://v-office.join.com/jobs/1970469-web-developer-m-w-d?pid=357a3b4531918760973f\u0026amp;oid=53e226e2-b7d9-4793-8c22-7ed2d2dfa8a3\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=web-developer%2Bm%2Bw%2Bd\"\u003ehttps://v-office.join.com/jobs/1970469-web-developer-m-w-d?pid=357a3b4531918760973f\u0026amp;oid=53e226e2-b7d9-4793-8c22-7ed2d2dfa8a3\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=web-developer%2Bm%2Bw%2Bd\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3ljIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bf22073c9b977970f4037000ce0183594ac5db4b/v-office-logo-xl.jpg"},{"id":"457c1b76-447a-4b55-b8a5-cb14fe08c626","type":"Full Time","url":"https://jobs.github.com/positions/457c1b76-447a-4b55-b8a5-cb14fe08c626","created_at":"Fri Mar 12 10:24:17 UTC 2021","company":"Flexoptix GmbH","company_url":"http://www.flexoptix.net","location":"Darmstadt","title":"Mobile Software Engineer, Senior","description":"\u003cp\u003eWe’re looking to grow our product development team!\u003c/p\u003e\n\u003cp\u003eMobile Software Engineer, Senior\u003c/p\u003e\n\u003cp\u003eFor over twelve years Flexoptix has been a successful provider for transceiver solutions. With over 50 colleagues, we occupy a growing niche that we have successfully disrupted and defined through our unconventional approach.\u003c/p\u003e\n\u003cp\u003eYou will be part of our development team, not just limited to software development using the latest technologies, but also finding new challenges, as well as solutions for our company.\u003c/p\u003e\n\u003cp\u003eWe hope for your support with:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign of innovative software solutions\u003c/li\u003e\n\u003cli\u003eCoding our apps\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat you bring to the table:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePassion for software development; ideally you’d contribute to open-source projects\u003c/li\u003e\n\u003cli\u003eA remote workplace, since we're on a pandemic remote working schedule\u003c/li\u003e\n\u003cli\u003eThe ability to work at the office in Darmstadt once the pandemic isn't a challenge anymore\u003c/li\u003e\n\u003cli\u003eWillingness to shape our self-organizing team\u003c/li\u003e\n\u003cli\u003eSkills in Swift and a great interest in SwiftUI and Apple design guidelines\u003c/li\u003e\n\u003cli\u003eYou want to get into Android development and can tell us if Kotlin is worth considering\u003c/li\u003e\n\u003cli\u003eYou’re a Linux Guru and know how to use a shell\u003c/li\u003e\n\u003cli\u003eYou already have experience with one or more of the following scripting languages: Lua,\nJavaScript, Python and Bash\u003c/li\u003e\n\u003cli\u003eYou are pleased that everything is committed through git and you would like to help us with the\ndocumentation in our Atlassian products\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat you can expect from us:\nWe’re a pragmatic bunch of cowboys who think outside the box, which helps us to find creative solutions for technical problems. We offer a lot of freedom as well as opportunities to Influence our processes, though with great power comes great responsibility. This freedom also includes the choice of tools and materials, as well as ways of personal development (conferences, workshops, teachings, webinars).\u003c/p\u003e\n\u003cp\u003eApply now! We’re looking forward to meeting you in person. 😷\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease send your application to our HR Department via email: \u003ca href=\"mailto:jobs@flexoptix.net\"\u003ejobs@flexoptix.net\u003c/a\u003e.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3FjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--317537e02f818fe8798605ef6ad1666fe7eae3f1/FO_Logo_Sonderform_RGB.jpg"},{"id":"d42fd076-e1cb-482f-8329-b34ea3f1a634","type":"Full Time","url":"https://jobs.github.com/positions/d42fd076-e1cb-482f-8329-b34ea3f1a634","created_at":"Fri Mar 12 10:01:07 UTC 2021","company":"Nictiz","company_url":"https://www.nictiz.nl/","location":"Den Haag","title":"Developer ART-DECOR","description":"\u003cp\u003eIs het jouw uitdaging om als Developer (Front/Back-End) onze ART-Decor omgeving perfect op orde te krijgen en houden? Wil jij je steentje bijdragen in de standaardisatie in de zorg? Dan maken wij graag kennis met jou. Twijfel niet en solliciteer direct!\u003c/p\u003e\n\u003cp\u003eNictiz heeft voor haar locatie in Den Haag een vacature voor een\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDeveloper ART-DECOR\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTer uitbreiding van het Toolingcentrum van Nictiz zijn wij op zoek naar ART-Decor DeveloperS (Front/Back-End) die meewerken aan de (door)ontwikkeling van onze ART-DECOR omgeving.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat ga je doen als Developer ART-DECOR?\u003c/strong\u003e\nART-DECOR is een open source ontwikkelingstool, wat door Nictiz gebruikt wordt bij het opstellen, beheren en beschikbaar stellen van informatiestandaarden. ART-DECOR wordt intern en extern intensief gebruikt. Nictiz wil de verdere ontwikkeling van ART-DECOR met voorrang aanpakken.\u003c/p\u003e\n\u003cp\u003eAls Front-End Developer wordt het jouw taak om te werken aan een noodzakelijke platformverbetering, maar ook het vergroten van de gebruiksvriendelijkheid en uitbreiding van functionaliteit. Deze verbeteringen moeten goed aansluiten op de eisen en wensen van gebruikers. Ook zal je een rol spelen bij het realiseren van Nictiz specifieke wensen.\u003c/p\u003e\n\u003cp\u003eAls Back-End Developer wordt het jouw taak om te werken aan de doorontwikkeling van ons platform, waaronder API ontwikkeling.\nOnze back-end bestaat uit NoSQL database (eXist-db), XQuery, JSON/SML en OpenAPI (OAS).\nNaast het ontwikkelen, ben je ook verantwoordelijk voor het testen én documenteren van de ontwikkelde functionaliteit.\u003c/p\u003e\n\u003cp\u003eOm tot de juiste oplossingen te komen, werken wij niet alleen als team samen, maar ook met andere belanghebbende, zoals de Internationale Expertgroep.\nVoor meer informatie \u003ca href=\"https://www.nictiz.nl/standaardisatie/art-decor/\"\u003ehttps://www.nictiz.nl/standaardisatie/art-decor/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat breng je mee?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHBO opleiding op het gebied informatiekunde is een pre;\u003c/li\u003e\n\u003cli\u003eAls Back-end developer: Ervaring met XQuery, Open API, Git, REST en JSON;\u003c/li\u003e\n\u003cli\u003eAls Front-end: Ervaring met Vue.js, Git, REST en JSON;\u003c/li\u003e\n\u003cli\u003eJe bent communicatief vaardig (Nederlands en Engels) en klantgericht;\u003c/li\u003e\n\u003cli\u003eJe bent in staat zelfstandig te functioneren;\u003c/li\u003e\n\u003cli\u003eUitstekend analytisch vermogen.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDe volgende kennis is een pré, zeker geen must:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKennis van en ervaring met informatiestandaarden in de zorg;\u003c/li\u003e\n\u003cli\u003eKennis en ervaring met FHIR;\u003c/li\u003e\n\u003cli\u003eKennis en ervaring met terminologiestelsels zoals SNOMED en LOINC.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWat biedt Nictiz jou?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEen mooi, marktconform salaris;\u003c/li\u003e\n\u003cli\u003eAantrekkelijke secundaire arbeidsvoorwaarden, zoals een premievrij pensioen, eindejaarsuitkering, korting op ziektekostenverzekering;\u003c/li\u003e\n\u003cli\u003eEen jaarlijks persoonlijk opleidingsbudget van 5% van je bruto jaarsalaris;\u003c/li\u003e\n\u003cli\u003eEen jaarcontract voor 32 – 40 uur met mogelijkheid tot verlenging en aansluitend uitzicht op vast dienstverband;\u003c/li\u003e\n\u003cli\u003eEen gedreven en enthousiast team, dat samenwerking hoog in het vaandel heeft en vol ambitie zit;\u003c/li\u003e\n\u003cli\u003eEen fijne werksfeer met ruimte voor reflectie.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOver Nictiz\u003c/strong\u003e\nNictiz is de landelijke, onafhankelijke kennisorganisatie die zich inzet voor digitale informatie-uitwisseling in de zorg. Nictiz doet dit onder meer door het gebruiksgericht ontwikkelen en het beheren van informatiestandaarden in opdracht van en samen met de partijen in de zorg. Nictiz signaleert en adviseert partijen in de zorg over informatie-uitwisseling en over (toekomstige) nationale en internationale ontwikkelingen.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eWe maken graag ruimte voor jouw expertise!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMeer informatie\u003c/strong\u003e\nVoor meer informatie over de functie of de selectieprocedure kun je contact opnemen met onze recruiter, Audrey van der Linde, via 06 2120 5164 of \u003ca href=\"werving@nictiz.nl\"\u003ewerving@nictiz.nl\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSolliciteren op de functie van Developer ART-DECOR\u003c/strong\u003e\nGeen vragen meer, maar wil je direct solliciteren? Upload dan snel je Curriculum Vitae en motivatiebrief via onze \u003cstrong\u003e\u003ca href=\"https://nictiz.zohorecruit.eu/jobs/Careers/31034000000823039/Developer-ART-DECOR?source=CareerSite\u0026amp;utm_source=github\u0026amp;utm_medium=referral\u0026amp;utm_term=2021\u0026amp;utm_content=181174\u0026amp;utm_campaign=developer-art-decor\"\u003esollicitatiepagina\u003c/a\u003e\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eAcquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eTrefwoorden: Developer, Front-end Developer, Back-end Developer, IT, ICT, Informatiekunde, HBO, vacature Den Haag\u003c/em\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2FjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d3fb9696e42749259b9ac102696614d649c01926/Logo%202021.jpg"},{"id":"8a221c8f-0722-483a-9c8b-94b76769873d","type":"Full Time","url":"https://jobs.github.com/positions/8a221c8f-0722-483a-9c8b-94b76769873d","created_at":"Fri Mar 12 09:57:21 UTC 2021","company":"BLVRD","company_url":"http://www.blvrd.de/home-gh","location":"Hannover (Germany)","title":"Backend Developer (m/w/d) - Java (Spring Boot)","description":"\u003cp\u003eBLVRD ist die erste Online-Plattform für lokale Mode. Mit unserer Cross-Platform-App revolutionieren wir die Art, wie Menschen lokal Mode shoppen und arbeiten hier bereits mit großen Namen aus der Branche zusammen. Unser Ziel ist es, dem lokalen Handel wieder auf die Beine zu helfen und Paketmüll durch Online-Retouren zu reduzieren.\u003c/p\u003e\n\u003cp\u003eGemeinsam mit dem Team steuerst du die Weiterentwicklung unseres Backends hin zu einer Plug\u0026amp;Play-Lösung, um die Anbindung neuer Händler iterativ zu vereinfachen. Dabei bist du bei uns Teil eines crossfunktionalen Teams, in dem jeder liebt, was er tut und sein Bestes gibt - für das große Ganze.\u003c/p\u003e\n\u003cp\u003eDEINE AUFGABEN\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu entwickelst Services für den Import und das Mapping der Produkt- \u0026amp; Bestandsdaten lokaler\nHändler\u003c/li\u003e\n\u003cli\u003eDu entwickelst skalierbare Micro-Services, die schnell wachsende Nutzerzahlen unterstützen können\u003c/li\u003e\n\u003cli\u003eDu unterstützt bei der Konzeption und Entwicklung unserer Full-Service Lösung zur Digitalisierung\ndes Modehandels (Produkt- \u0026amp; Bestandsdatenaktualisierung)\u003c/li\u003e\n\u003cli\u003eDu unterstützt bei der Konzeption \u0026amp; Entwicklung unseres internen App-CMS\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDEINE SKILLS\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu hast mindestens 2 Jahre Erfahrung mit Java-Entwicklung (Spring Boot)\u003c/li\u003e\n\u003cli\u003eDu kennst dich mit Datenbanksystemen wie MongoDB und PostgreSQL aus\u003c/li\u003e\n\u003cli\u003eDu siehst in Problemen keine Hindernisse, sondern Chancen für dich persönlich, dein Team und\nBLVRD\u003c/li\u003e\n\u003cli\u003eDu triffst schnell, smarte Entscheidungen und wägst das Risiko intelligent ab\u003c/li\u003e\n\u003cli\u003eDu verfügst über eine ausgeprägte ‘Hands-on’ Mentalität, du liebst es, mit anzupacken und Erfolge zu\nsehen\u003c/li\u003e\n\u003cli\u003eNice-To-Have: Erfahrung mit Firebase, GraphQL und/oder Elastic Search\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBENEFITS\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDie Möglichkeit, die erste SaaS-Plattform für lokale Einkaufserlebnisse mit aufzubauen\u003c/li\u003e\n\u003cli\u003eEin junges Team mit starkem Zusammenhalt und flachen Hierarchien\u003c/li\u003e\n\u003cli\u003eStart-up-Mentalität: dynamische Atmosphäre und großartiger Teamspirit.\u003c/li\u003e\n\u003cli\u003eKreative Freiheit und den Raum, diese zu leben, ob remote oder bei uns im Office mit Blick über\nHannover.\u003c/li\u003e\n\u003cli\u003eExponentielle Lernkurve – BLVRD wächst rasant und das gleiche erwarten wir von dir. Du stehst nie\nstill, du wirst permanent gechallenged, lernst aus deinen Fehlern a la Fail Fast and Often.\u003c/li\u003e\n\u003cli\u003eEin top motiviertes Team, das dafür brennt, eine nachhaltige Alternative zum ,,Establishment“ der\nOnline-Pure-Player im Mode-Bereich zu bieten, ohne Paketmüll und Retouren.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eINTERESSE GEWECKT?\nDann steck deine Zeit nicht in ein Anschreiben, sondern schick uns deinen CV und Links zu deinen letzten Projekten an \u003ca href=\"mailto:hello@blvrd.de\"\u003ehello@blvrd.de\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eINTERESSE GEWECKT?\nDann steck deine Zeit nicht in ein Anschreiben, sondern schick uns deinen CV und Links zu deinen letzten Projekten an \u003ca href=\"mailto:hello@blvrd.de\"\u003ehello@blvrd.de\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa09jIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--80145599ed4c3ac326056a1f60c1a0c22bfcdb68/BLVRD%20Logo%20Schrift%202.png"},{"id":"6283a69f-6cee-4f59-9386-c2fd9619e918","type":"Full Time","url":"https://jobs.github.com/positions/6283a69f-6cee-4f59-9386-c2fd9619e918","created_at":"Fri Mar 12 09:21:20 UTC 2021","company":"Politie","company_url":"http://www.politie.nl","location":"Odijk","title":"Java ontwikkelaar Opsporing (FOV)","description":"\u003cp\u003e\u003cstrong\u003eJava ontwikkelaar Opsporing (FOV)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAls Java ontwikkelaar bij het domein Opsporing zit je bovenop onze meest cruciale informatievoorzieningsdiensten voor de uitvoerende politiecollega’s. Het bouwen en onderhouden van centrale politiesystemen en producten die cruciaal zijn voor het politiewerk op straat en in de opsporing: dat is wat jij doet als Java ontwikkelaar bij het Productiehuis in Odijk.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat ga je doen?\u003c/strong\u003e\nDe verregaande digitalisering van de samenleving vraagt om een kentering in het denken en werken van de politie én om optimale informatievoorziening. Waar sporen zich vroeger hoofdzakelijk beperkten tot fysieke resten zoals bloed of vingerafdrukken, heeft de hedendaagse criminaliteit vrijwel altijd ook een digitale component. En die wordt letterlijk met de dag groter en zwaarwegender. Willen we die criminaliteit terugdringen, dan is het van cruciaal belang om continu vernieuwende ICT te ontwikkelen. Als Java ontwikkelaar binnen het Opsporing domein speel jij hierin een zeer belangrijke rol. Jij ontwikkelt en beheert samen met je andere DevOps teamleden bestaande en nieuwe applicaties. Als ervaren ontwikkelaar voer jij de regie over diverse programmeeropdrachten.\u003c/p\u003e\n\u003cp\u003eJij pakt je verantwoordelijkheid bij het:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e(door)ontwikkelen van centrale politiesystemen;\u003c/li\u003e\n\u003cli\u003euitleveren van software conform kwaliteits- en performance-eisen;\u003c/li\u003e\n\u003cli\u003everzorgen van (installatie)scripts;\u003c/li\u003e\n\u003cli\u003eondersteunen van het Ops-team bij het uitvoeren van installaties;\u003c/li\u003e\n\u003cli\u003eadviseren over toe te passen methodes en technieken.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWaar ga je werken?\u003c/strong\u003e\nAls Java ontwikkelaar bij het domein Opsporing maak je deel uit van het Productiehuis. Binnen het Productiehuis zijn zeven productielijnen ingericht; elke productielijn bedient een specifiek domein. Deze vacature betreft een functie binnen de productielijn Opsporing. In deze productielijn werken meerdere DevOps teams aan Opsporing-applicaties in vijf clusters. Jij gaat werken in het Cluster Forensische Opsporing en Verhoorregistratie (FOV). De DevOps teams werken nauw samen met de Product Owner om de wensen, behoeften en problemen van de eindgebruikers te realiseren en/of op te lossen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWie ben jij?\u003c/strong\u003e\nEr wordt verwacht dat je een teamspeler bent want we werken agile/scrum. Je bent flexibel, open en eerlijk en je neemt je verantwoordelijkheid als persoon en als teamlid. Een proactieve houding en de juiste communicatieve skills zijn hierbij een vereiste. Jij bent iemand met een frisse blik, iemand die open staat voor veranderingen en de drive heeft om continu de dienstverlening te verbeteren. Je bent ondernemend, creatief en wilt met jouw ideeën graag iets bijdragen aan het politiewerk. Je staat open voor nieuwe zaken, bent van nature nieuwsgierig en leergierig. Werken in een dynamische en soms hectische omgeving past bij jou als persoon. Daarnaast ben je goed in staat om je eigen werk te organiseren en durf je kritische vragen te stellen. Je kunt over de grenzen van het eigen vakgebied heen kijken en verbindingen leggen. Je hebt een oplossend denkvermogen.\u003c/p\u003e\n\u003cp\u003eVerder beschik je over:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ehbo-diploma, bijvoorbeeld in de richting (technische) informatica of software-engineering;\u003c/li\u003e\n\u003cli\u003ewerkervaring met Agile-, CI-CD en DevOps omgevingen;\u003c/li\u003e\n\u003cli\u003eup-to-date ervaring met Java 8 of hoger;\u003c/li\u003e\n\u003cli\u003ewerkervaring met Oracle WebLogic Server 12 of JBoss EAP 7;\u003c/li\u003e\n\u003cli\u003ewerkervaring met:\u003c/li\u003e\n\u003cli\u003ein frontend én backend ontwikkelen;\u003c/li\u003e\n\u003cli\u003eJava enterprise applicaties;\u003c/li\u003e\n\u003cli\u003emicroservices bij voorkeur in een cloud omgeving;\u003c/li\u003e\n\u003cli\u003eJenkins, Maven, SonarQube, Bitbucket, Jira en Confluence;\u003c/li\u003e\n\u003cli\u003ewerkervaring met testautomatisering, bij voorkeur met Fitnesse en Cucumber;\u003c/li\u003e\n\u003cli\u003ebij voorkeur werkervaring met Springboot framework of Quarkus en secure software development, SAST, OWASP en DAST tools.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWat wij bieden\u003c/strong\u003e\nDe standplaats is Odijk. Er is ruimte voor 5 fte. Het betreft een functie voor 36 uur per week.\u003c/p\u003e\n\u003cp\u003eOmdat goede mensen belangrijk zijn binnen de politie investeren we in jouw toekomst. We bieden uitgebreide ontwikkelingsmogelijkheden en een vaste aanstelling, waarbij een proeftijd van 1 jaar van toepassing is.\u003c/p\u003e\n\u003cp\u003eVerder kun je het volgende van ons verwachten:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eeen bruto maandsalaris van minimaal € 2.866,- en maximaal € 4.624, - (schaal 10 Bbp) op basis van een 36-urige werkweek;\u003c/li\u003e\n\u003cli\u003e8% vakantie- en 8,33% eindejaarsuitkering;\u003c/li\u003e\n\u003cli\u003egoede pensioenregeling en betaald ouderschapsverlof (\u003ca href=\"https://kombijde.politie.nl/binaries/content/assets/academie/lfnp/lfnp62.pdf\"\u003emeer info over verlof, regelingen en mogelijkheden\u003c/a\u003e).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDe formele functie binnen het functiegebouw van de politie is bedrijfsvoeringspecialist B, werkterrein informatie- en communicatietechnologie.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eBel of mail met Katja Damming, ICT Recruiter, (06 - 53 29 83 17, \u003ca href=\"katja.damming@politie.nl\"\u003ekatja.damming@politie.nl\u003c/a\u003e) als je meer informatie over de functie wilt hebben.\u003c/p\u003e\n\u003cp\u003eSolliciteer uiterlijk 8 april  2021 via de \u003ca href=\"https://kombijde.politie.nl/vacatures/java-ontwikkelaar-opsporing-fov-_2653649.html?utm_source=adveronline\u0026amp;utm_medium=paid\u0026amp;utm_content=vacature-alert\u0026amp;utm_campaign=niet-initieel-java-ontwikkelaar-opsporing\u0026amp;utm_term=44266\"\u003esollicitatiebutton\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat verder belangrijk is\u003c/strong\u003e\n•\tEen veiligheidsonderzoek maakt deel uit van de selectieprocedure.\n•\tZonder IT'ers zijn we nergens. Ben jij expert in IT? Lees alles over o.a. data science, legaal hacken of cybersecurity en test je digitale skills in de Cybercrime challenge op \u003ca href=\"https://it.kombijdepolitie.nl/?_ga=2.153159032.194516751.1615447825-1788394226.1615447825\"\u003eit.kombijdepolitie.nl\u003c/a\u003e\n•\tDe politie zet in op vernieuwing en cultuurverschillen binnen teams. Divers samengestelde teams presteren beter. Daarom werken we hard aan een open en veilige cultuur waarin divers talent tot bloei komt.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBamFjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1c9e7776e9963ab48c83f7c43af9fe0e70960096/logo%202021%20blauw.jpg"},{"id":"9ae220e5-a889-493a-9523-0ecf39b89a03","type":"Full Time","url":"https://jobs.github.com/positions/9ae220e5-a889-493a-9523-0ecf39b89a03","created_at":"Fri Mar 12 09:15:59 UTC 2021","company":"Torn Banner Studios","company_url":"https://vonq.io/3ev8wVF","location":"Toronto","title":"Lead Programmer","description":"\u003ch2\u003eCompany Description\u003c/h2\u003e\n\u003cp\u003eWe're the studio behind the hit franchise Chivalry: Medieval Warfare. At Torn Banner we understand that long, hard hours are not conducive to being a happy, healthy person. Combine this idea with a flat studio structure and profit sharing and you've got ideals that promote a positive, low stress environment to help us create awesome games. As a small team of developers, each individual has a huge impact on the final product that we put out, so we put emphasis on being open with each other, giving/receiving critical feedback, and not letting an false sense of authority cloud our vision. The more eyes and input that we have from different disciplines and personality types, the better our releases will be.\u003c/p\u003e\n\u003ch2\u003eJob Description\u003c/h2\u003e\n\u003cp\u003eTorn Banner Studios is looking for a Lead Programmer to manage the programming team. The ideal candidate is passionate about providing high-level direction, supporting a team of engineers, and getting their hands dirty with day-to-day development.\u003c/p\u003e\n\u003cp\u003eYou are an accomplished engineer that enjoys collaborating closely with the engineering team to build a technically excellent game across multiple platforms.\u003c/p\u003e\n\u003ch2\u003eQualifications\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLead and manage a programming team at technical and personnel level\u003c/li\u003e\n\u003cli\u003eProvide estimate time to complete programming task/objectives and be committed to meet them\u003c/li\u003e\n\u003cli\u003eHelp in setting up best practices for coding and conduct regular code reviews\u003c/li\u003e\n\u003cli\u003eEncourage and help guide the creation of technical design documents\u003c/li\u003e\n\u003cli\u003eSetup a process to review the game on a regular interval during development cycle and identify area of improvement\u003c/li\u003e\n\u003cli\u003eCollaborate directors, designers and production to ensure efficient development practices\u003c/li\u003e\n\u003cli\u003eEnsure that solid coding practices, technical briefs and code reviews are maintained\u003c/li\u003e\n\u003cli\u003eMaintain regular internal communications and encourage a positive and ambitious team atmosphere\u003c/li\u003e\n\u003cli\u003eDemonstrate good leadership, enthusiasm and sense of commitment\u003c/li\u003e\n\u003cli\u003eTake responsibility for recruitment, on-boarding, development and professional training of the programming team\u003c/li\u003e\n\u003cli\u003ePropose solutions to improve the development of projects in the studio\u003c/li\u003e\n\u003cli\u003eMaintain a strong understanding of multiplayer FPS games\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProficiency in C++\u003c/li\u003e\n\u003cli\u003eAt least 5 years professional video game programming experience\u003c/li\u003e\n\u003cli\u003eA strong and efficient communicator with excellent management skills\u003c/li\u003e\n\u003cli\u003eA bachelor's degree in Computer Science, Software Engineering, or equivalent.\u003c/li\u003e\n\u003cli\u003ePrevious leadership/mentorship experience, or leadership interest and potential\u003c/li\u003e\n\u003cli\u003eA good knowledge of programming languages and software engineering practices\u003c/li\u003e\n\u003cli\u003eExperience developing AAA titles on multiple platforms\u003c/li\u003e\n\u003cli\u003eExperience with Unreal Engine 4 or other large engines\u003c/li\u003e\n\u003cli\u003eComfortable wandering around unexplored game design territory, and excited to help refine ideas i-into shippable features\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBonus\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePrevious experience as a Lead Programmer on a shipped game\u003c/li\u003e\n\u003cli\u003ePrevious experience in small/medium sized development studios\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eAdditional Information\u003c/h2\u003e\n\u003cp\u003e\u003cem\u003ePortfolio and résumé required for any application.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eBenefits \u0026amp; Perks\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProfit sharing\u003c/li\u003e\n\u003cli\u003e4 weeks Paid vacation\u003c/li\u003e\n\u003cli\u003eA no crunching policy\u003c/li\u003e\n\u003cli\u003eRelocation assistance\u003c/li\u003e\n\u003cli\u003eFlexible schedule\u003c/li\u003e\n\u003cli\u003eWeekly happy hour\u003c/li\u003e\n\u003cli\u003eHealthcare \u0026amp; benefits\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/3ev8wVF\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBalNjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--349a9542c9ff7207b95dfa4546cbccfd58273968/torn%20banner.jpg"},{"id":"2f4a4132-7625-4364-b22f-c5db175e8ede","type":"Full Time","url":"https://jobs.github.com/positions/2f4a4132-7625-4364-b22f-c5db175e8ede","created_at":"Fri Mar 12 08:42:30 UTC 2021","company":"Politie","company_url":"http://www.politie.nl","location":"Odijk","title":"Lead software engineer","description":"\u003cp\u003e\u003cstrong\u003elead software engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHet doel van het Programma Vernieuwend Registreren? Een landelijk platform realiseren waar al onze applicaties voor agenten op straat samenkomen. Met als resultaat: nog effectievere opsporing en handhaving. Als lead software engineer bouw je vanuit Odijk mee aan dit platform en focus je op het refactoren, innoveren en upgraden van de applicaties. Zo draag je bij aan een veiliger Nederland.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat ga je doen?\u003c/strong\u003e\nJe hebt een belangrijke rol in het tot stand brengen en up and running houden van het operationeel platform van de politie. Een flinke klus, want het platform telt ruim 50.000 gebruikers en combineert veel gegevens. Denk aan digitale informatie over aangiftes, executie en signalering, boetes, veroordelingen, straffen en daderinformatie. Mede dankzij jouw inzet kunnen agenten die gegevens snel en via hun mobiel verkrijgen. Zo verbeter je het opsporings- en handhavingsproces.\u003c/p\u003e\n\u003cp\u003eSamen met je team pas je nieuwe technieken toe en ontwikkel en beheer je applicaties. Jullie zijn ook (mede)verantwoordelijk voor het ontwikkelen, realiseren, uitdragen en bewaken van de visie op het platform. Zo vormen je collega’s en jij de technische basis waarop ook andere IT-developmentteams software kunnen bouwen. Doen er zich complexe problemen voor? Dan lossen jullie die op. Daarbij maak je onder andere gebruik van reactive programming.\u003c/p\u003e\n\u003cp\u003eDe ene dag werk je aan generieke componenten en de andere dag buig je je over een complex framework. Daarnaast geef je inhoudelijke support aan collega-developers. Je ontwikkelt de domain-specific language waarmee de featureteams Resource Description Framework-data kunnen ophalen, aanmaken én manipuleren. Verder werk je met backend-engineers aan de communicatie tussen client en backend via REST-services en WebSockets. Je zorgt er te allen tijde voor dat je code onderhoudbaar en goed getest is, zodat anderen er optimaal gebruik van kunnen maken.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWaar ga je werken?\u003c/strong\u003e\nJe werkt in het Productiehuis van de Dienst ICT. Hier ontwikkelen multidisciplinaire DevOps-teams snel en flexibel nieuwe functionaliteiten voor de operationele politiediensten. Binnen het Productiehuis maak jij deel uit van het Platformteam. Dit bestaat uit vijftien hardwerkende en gepassioneerde mensen van verschillende leeftijden. Zo is de jongste 33 en de oudste 64. Negen posities zijn extern opgevuld, maar we willen graag meer interne kandidaten verwelkomen om de kennis te borgen. Waar we heel blij van worden? Nieuwe technologieën benutten! Verder is het goed om te weten dat het weleens kan voorkomen dat je buiten kantoortijd wordt opgeroepen. Het werk van de politie gaat immers 24/7 door.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWie ben jij?\u003c/strong\u003e\nEen IT-professional met liefde voor het vak. Je bent nieuwsgierig en constant op zoek naar mogelijkheden om nieuwe technologieën in te zetten. Daarnaast houd je ervan om resultaten te boeken en stel je jezelf regelmatig de vraag: hoe kan dit nog beter? Jouw creatieve ideeën deel je graag. Bovendien ben je een echte teamspeler en pas je je gemakkelijk aan wanneer de situatie daarom vraagt. Verder heb je:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eeen hbo-diploma in de richting van ICT;\u003c/li\u003e\n\u003cli\u003eminimaal vier jaar relevante ervaring als core clientside-engineer;\u003c/li\u003e\n\u003cli\u003eminimaal twee jaar relevante ervaring met TypeScript;\u003c/li\u003e\n\u003cli\u003ekennis van Angular 2+, Node.js en RxJS;\u003c/li\u003e\n\u003cli\u003ekennis van Gang of Four (GoF) en reactive programming design patterns.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWat wij bieden\u003c/strong\u003e\nDe standplaats is Odijk. Er is ruimte voor 1 fte. Het betreft een functie voor 36 uur per week. Omdat goede mensen belangrijk zijn binnen de politie investeren we in jouw toekomst. We bieden uitgebreide ontwikkelingsmogelijkheden en een vaste aanstelling, waarbij een proeftijd van één jaar van toepassing is.\u003c/p\u003e\n\u003cp\u003eVerder kun je het volgende van ons verwachten:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eeen bruto maandsalaris van minimaal € 3.502,- en maximaal € 5.228,- (schaal 11 Bbp) op basis van een 36-urige werkweek;\u003c/li\u003e\n\u003cli\u003e8% vakantie- en 8,33% eindejaarsuitkering;\u003c/li\u003e\n\u003cli\u003egoede pensioenregeling en betaald ouderschapsverlof (\u003ca href=\"https://kombijde.politie.nl/vakgebieden/arbeidsvoorwaarden\"\u003emeer info over verlof, regelingen en mogelijkheden\u003c/a\u003e).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDe formele functie binnen het functiegebouw van de politie is \u003ca href=\"https://kombijde.politie.nl/binaries/content/assets/academie/lfnp/lfnp61.pdf\"\u003ebedrijfsvoeringspecialist C\u003c/a\u003e, werkterrein informatie- en communicatietechnologie.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eNeem contact op met Donja Huidar, Recruiter ICT als je meer informatie over de functie wilt hebben via 06 - 18 63 45 09 of \u003ca href=\"donja.huidar@politie.nl\"\u003edonja.huidar@politie.nl\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eSolliciteer uiterlijk 24 maart 2021 via de \u003ca href=\"https://kombijde.politie.nl/vacatures/lead-software-engineer_2633669.html?utm_source=adveronline\u0026amp;utm_medium=paid\u0026amp;utm_content=vacature-alert\u0026amp;utm_campaign=niet-initieel-lead-software-engineer\u0026amp;utm_term=44266\"\u003esollicitatiebutton\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat verder belangrijk is\u003c/strong\u003e\n•\tEen veiligheidsonderzoek P maakt deel uit van de selectieprocedure.\n•\tZonder IT'ers zijn we nergens. Ben jij expert in IT? Lees alles over o.a. data science, legaal hacken of cybersecurity en test je digitale skills in de Cybercrime challenge op \u003ca href=\"https://it.kombijdepolitie.nl/?_ga=2.153183736.194516751.1615447825-1788394226.1615447825\"\u003eit.kombijdepolitie.nl\u003c/a\u003e\n•\tDe politie zet in op vernieuwing en cultuurverschillen binnen teams. Divers samengestelde teams presteren beter. Daarom werken we hard aan een open en veilige cultuur waarin divers talent tot bloei komt\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTZjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9488e22cbaa07d19ea02ddc2329a8421594f96e8/logo%202021%20blauw.jpg"},{"id":"aa52a585-f919-4205-8b33-690187ef7a60","type":"Full Time","url":"https://jobs.github.com/positions/aa52a585-f919-4205-8b33-690187ef7a60","created_at":"Fri Mar 12 05:30:20 UTC 2021","company":"Koffie Labs","company_url":"http:","location":"Remote","title":"Software Engineer","description":"\u003cp\u003eThis is a unique role that offers broad exposure to software engineering and data science. We are eager to find underrepresented candidates who are early in their career and don’t want to choose between engineering or data science.\u003c/p\u003e\n\u003cp\u003eWorking with data science and engineering, you will be deeply enmeshed in the critical nuances of disambiguation, normalization, standardization and other ETL skills. You will also have the opportunity to work in all stages of our software process from researching data sources to developing data pipelines and building business intelligence visualization tools.\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign and build data pipelines\u003c/li\u003e\n\u003cli\u003eRun and iterate data science experiments in the cloud and in a production environment\u003c/li\u003e\n\u003cli\u003eSupport business intelligence and data science needs via visualization/reporting\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBackground/Experience\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUndergraduate CS degree or equivalent; 3-5 years professional experience\u003c/li\u003e\n\u003cli\u003eFluent in python; the ideal candidate will be comfortable with web programming, consuming APIs, data wrangling, SQL, etc.\u003c/li\u003e\n\u003cli\u003eExperience with python pandas, scikit-learn, numpy and NVDIA’s CUDA and visualization libraries such as seaborn, plotly, etc. strongly preferred\u003c/li\u003e\n\u003cli\u003eExperience working with large tabular (\u0026gt;100m rows) datasets a plus\u003c/li\u003e\n\u003cli\u003eFamiliarity with basic statistical concepts\u003c/li\u003e\n\u003cli\u003eCuriosity for insurance and autonomous technology applied to transportation/trucking\u003c/li\u003e\n\u003cli\u003eEntrepreneurial mindset and comfort with ambiguity\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBenefits\u003c/p\u003e\n\u003cp\u003eKoffie is an insurance company purpose built for the autonomous vehicle era. We are taking transportation insurance out of the dark ages by using modern technology to deliver instant policies based on advanced safety and autonomous technology. As an InsurTech, Koffie is free from legacy systems and inefficient processes, our AI-driven predictive models deliver a reimagined insurance experience for fleets. We believe strongly in diversity of thought which comes from different backgrounds and experiences.\u003c/p\u003e\n\u003cp\u003eOur vision is to align incentives across fleets, technology providers, brokers and the automotive industry. By catalyzing the adoption of safety technology, we positively impact road safety and facilitate a more efficient supply chain. We’re backed by top-tier VCs in the fintech and mobility sectors.\u003c/p\u003e\n\u003cp\u003eIf you're ready to work obsessively with us to make insurance better, faster, more efficient and build products for the next 100 years of mobility, we want to hear from you, regardless of where you live.\u003c/p\u003e\n\u003cp\u003eFor US employees we offer a competitive salary, stock options, unlimited vacation, 100% employer paid health, vision and dental plans, commuter benefits and discounted fitness classes, generous WFH stipend, personal learning/training (for professional and industry certification) and conference budget. For remote hires outside the US, we are unable to provide some of these benefits.\u003c/p\u003e\n\u003cp\u003eAlthough this position is WFH, we envision meeting face-to-face as a team every 6-8 weeks for several days once things return to 'normal.'\u003c/p\u003e\n\u003cp\u003eHiring process for this role is as follows: initial screen by hiring manager, coding challenge (administered by iMocha), Zoom screen, Zoom technical interview, Zoom interview with additional team members, then offer. We hope to have candidates go from submission to offer in under two weeks.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease visit \u003ca href=\"https://apply.workable.com/koffie-labs/\"\u003ehttps://apply.workable.com/koffie-labs/\u003c/a\u003e to learn more and apply!\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaXljIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ef6a67ee15183410545a3222a8f1ce009f75ffee/koffie%20logo.png"},{"id":"3c8c0c1b-d7df-4dd6-93c1-bc556d97d06b","type":"Full Time","url":"https://jobs.github.com/positions/3c8c0c1b-d7df-4dd6-93c1-bc556d97d06b","created_at":"Thu Mar 11 22:51:47 UTC 2021","company":"ONENIGMA","company_url":"http://www.onenigma.com","location":"Remote (United States)","title":"Android Software Engineer (Remote)","description":"\u003cp\u003eOnenigma is a fully remote, flexible, ultra-casual, and forward-thinking software studio that works on new concepts, projects, and products we care about with people and companies we strongly believe in. Onenigma has worked with various companies over the years like AirBnB, Cognito, Udacity, Bloom, Tranche, Peapod, as well as many more to build new concepts and ideas. We always have liked to fly under the radar by building products used by millions around the world without seeking attention, because we simply really enjoy making cool and intuitive things.\u003c/p\u003e\n\u003cp\u003eThis position focuses on both Android and occasionally web stacks. We work with leaders in the cryptocurrency, finance, and emerging technology spaces to deliver high impact products that have served as the backbone for many industries. This position will expose you to a number of different products, fields, and concepts that require adaptive thinking. This position also allows for you to work on an idea or hobbyist project alongside company projects. We are a constantly evolving company, always looking to take unorthodox approaches to new ideas and ventures and love working with people who think the same way.\u003c/p\u003e\n\u003cp\u003eYou will:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork closely with designers and engineers to be solely responsible for maintaining existing and creating new Android libraries and applications\u003c/li\u003e\n\u003cli\u003eCreate cutting-edge front end user experiences that everyone actually​ enjoys using\u003c/li\u003e\n\u003cli\u003eLearn new technologies and practices required to stay up to date with the latest developments and security requirements\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYou have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e2+ years of prior experience developing/releasing Android applications in Kotlin and Java\u003c/li\u003e\n\u003cli\u003eUnderstanding of Android framework components and their lifecycles\u003c/li\u003e\n\u003cli\u003ePrior experience working with product, design, and other developers to create strong products\u003c/li\u003e\n\u003cli\u003eExperience with test-driven development\u003c/li\u003e\n\u003cli\u003eStrong communication skills\u003c/li\u003e\n\u003cli\u003eAbility to self-manage time and development targets\u003c/li\u003e\n\u003cli\u003eOpen-mindness and adaptability to shifting to new products or\npriorities\u003c/li\u003e\n\u003cli\u003eDesire to improve on existing skills and learn new ones\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus points:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSome prior experience with Full-Stack Development\u003c/li\u003e\n\u003cli\u003eExperience with React\u003c/li\u003e\n\u003cli\u003eStrong sense of design, both big picture and nano details\u003c/li\u003e\n\u003cli\u003ePrefer simple solutions over complicated ones\u003c/li\u003e\n\u003cli\u003eHave a desire to work on products in a variety of different industries\nfrom cryptocurrency to insurance, and even identity verification\ntechnologies\u003c/li\u003e\n\u003cli\u003eEnjoys participating in occasional banter about things like life,\nhobbies, and crypto\u003c/li\u003e\n\u003cli\u003eSome history working in a fully remote environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePerks:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eClose knit, family-like work culture\u003c/li\u003e\n\u003cli\u003eFully and indefinitely remote\u003c/li\u003e\n\u003cli\u003eUnlimited vacation days\u003c/li\u003e\n\u003cli\u003eCompletely flexible working hours and work schedule\u003c/li\u003e\n\u003cli\u003eTop coverage health insurance\u003c/li\u003e\n\u003cli\u003eLife insurance\u003c/li\u003e\n\u003cli\u003eDental insurance\u003c/li\u003e\n\u003cli\u003eVision insurance\u003c/li\u003e\n\u003cli\u003eVisa sponsorship\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOnenigma is an equal opportunity employer and participates in the US Federal E-Verify program.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease email your resume to \u003ca href=\"mailto:apply@onenigma.com\"\u003eapply@onenigma.com\u003c/a\u003e!\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaXFjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ae7b41a3a946274ba472e4cc0bfaf27a0792d2c0/Animated%20Logo-Round.png"},{"id":"45404332-bfd0-46cf-b601-cbcb2eb77373","type":"Full Time","url":"https://jobs.github.com/positions/45404332-bfd0-46cf-b601-cbcb2eb77373","created_at":"Thu Mar 11 21:19:47 UTC 2021","company":"Truss","company_url":"https://jobs.lever.co/trussworks/baceb1fd-6e19-4861-9f80-273958a8f529?lever-origin=applied\u0026lever-source%5B%5D=GitHub","location":"Remote, USA","title":"Senior Application Engineer","description":"\u003cp\u003e*This position has multiple openings and we anticipate will remain open for applications until 9am Pacific time, April 30th, 2021. Please expect an update on your application in approximately two weeks from submission.\u003c/p\u003e\n\u003cp\u003eTruss is a software consultancy known for trust, pragmatism, autonomy, and expertise. We believe strong relationships with our clients, contractors and employees is fundamental to doing great work.\u003c/p\u003e\n\u003cp\u003eTruss is tackling tough technical problems for the private sector and government. We implement and advocate modern development practices to build software and streamline infrastructure. As a Truss engineer you will facilitate bringing our values to our clients and help drive toward understanding what their end users truly need.\u003c/p\u003e\n\u003cp\u003eWe are seeking empathetic, curious, and quick-learning engineers to join our team. A position with Truss will allow you to use your rich skill-set to build an energetic yet balanced environment with a team of curious, helpful people.\u003c/p\u003e\n\u003cp\u003eHere's what we hope you'll bring:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGreat communication! Including thoughtful listening skills, the ability to express complex ideas clearly and succinctly, and the ability to communicate well in writing.\u003c/li\u003e\n\u003cli\u003eAn adaptive, empathetic, collaborative and positive mindset.\u003c/li\u003e\n\u003cli\u003eExcitement to experiment with new technologies and best practices.\u003c/li\u003e\n\u003cli\u003eThe ability to think holistically about software delivery and engineering issues.\u003c/li\u003e\n\u003cli\u003eMethodical approach to solving problems and ability to express solutions to coworkers.\u003c/li\u003e\n\u003cli\u003eHave held at least one engineering/infrastructure position post-educationInitiative with a bias for action.\u003c/li\u003e\n\u003cli\u003eExperience leading and actively mentoring junior engineers.\u003c/li\u003e\n\u003cli\u003eTechnology-agnostic approach to solving key problems.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTruss encourages applicants from a wide range of experience to apply, including those with backgrounds in application, UI, backend and/or frontend engineering, as well as generalists. We would like you to have experience in at least 3-4 of the following:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThoughtful, process-oriented approach to engineering, testing and agile software development.\u003c/li\u003e\n\u003cli\u003eLeading software delivery teams through agile ceremonies.\u003c/li\u003e\n\u003cli\u003eProficiency in a commonly used programming language such as JavaScript, TypeScript, Python, Ruby, Go, Java, etc.\u003c/li\u003e\n\u003cli\u003eWeb frameworks such as React, Vue, Angular, Rails, Django, Flask, Express, etc.\u003c/li\u003e\n\u003cli\u003eModern web technologies such as HTML, CSS.\u003c/li\u003e\n\u003cli\u003eBest practices such as accessibility, progressive enhancement, etc.\u003c/li\u003e\n\u003cli\u003eCommon API design patterns like REST or GraphQL.\u003c/li\u003e\n\u003cli\u003eCommon databases (MySQL, postgreSQL) and data schema design.\u003c/li\u003e\n\u003cli\u003eConverting design wireframes or mockups into working code.\u003c/li\u003e\n\u003cli\u003eStructuring projects/applications using technology and process to enable junior engineers to be more productive.\u003c/li\u003e\n\u003cli\u003eSecurity-first software development (examples: designing identity and authorization systems).\u003c/li\u003e\n\u003cli\u003eDesigning systems for the cloud.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIf you have more experience than is reflected here, that’s great! We’ll be pleased to exercise your broader/deeper skill set. We value inclusion and welcome diverse viewpoints.\u003c/p\u003e\n\u003cp\u003eIn this position you will:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDeliver timely, high quality solutions to specific engineering problems.\u003c/li\u003e\n\u003cli\u003eCreate automated tests or be willing to learn to do so.\u003c/li\u003e\n\u003cli\u003eMentor and cross-train with other engineers via design discussions and code reviews.\u003c/li\u003e\n\u003cli\u003eHelp architect new systems and changes to existing systems to support new functionality and broaden impact to clients.\u003c/li\u003e\n\u003cli\u003eWork cross-functionally on project teams to form and drive technical decisions to completion.\u003c/li\u003e\n\u003cli\u003eEvaluate and select tools to meet project needs without creating unnecessary technical debt.\u003c/li\u003e\n\u003cli\u003eCollaborate closely across practices such as Product and Design to build solutions that keep the end-user in mind.\u003c/li\u003e\n\u003cli\u003eBuild team dynamics that empowers technical teams to set and advocate for best practices and standards.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe salary range for this role is $166,500 - $180,000.\u003c/p\u003e\n\u003cp\u003eEligibility:\nYou must be eligible to work in the US. Unfortunately, we are unable to sponsor work visas at this time.\u003c/p\u003e\n\u003cp\u003e** A note from Truss: We know you’re likely experiencing a lot of disruption as our nation (and our world) responds to COVID-19 - we’re experiencing it, too. There are two things we want you to know when it comes to hiring. First, we’re financially stable. We have a variety of well-established government contracts that we expect to continue over the next few years.  Also, we’re winning new work, and we have a robust rainy day fund. Second, during video interviews, you’ll likely see more of our human side. Family members, partners, kids and pets are home with some of us! We promise to be present and engaged, but we may be a little...harried. It’s OK if you are, too - we understand that everyone is experiencing extra stress right now. If you have any questions along the way, please let us know, and stay healthy and safe. **\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease follow this link to submit your application!\n\u003ca href=\"https://bit.ly/2OrprxA\"\u003ehttps://bit.ly/2OrprxA\u003c/a\u003e\nWe look forward to hearing from you.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaWljIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--44407e2d604109771c21c96d58d1a24d20a32aca/truss_logo_black_infra.jpg"},{"id":"cd4b1b46-e274-40bd-a37f-22b78dc14785","type":"Full Time","url":"https://jobs.github.com/positions/cd4b1b46-e274-40bd-a37f-22b78dc14785","created_at":"Thu Mar 11 21:12:51 UTC 2021","company":"Nebo","company_url":"https://www.neboagency.com/","location":"Atlanta, GA","title":"Back-End Web \u0026 Application Engineer","description":"\u003cp\u003eSimply put: Nebo’s engineering team gets things done. That usually looks like using the art of code to solve problems and build solutions for clients and coworkers alike. We don’t get hung up on what hasn’t been done — we’re all about what we can do. We’re looking for driven teammates who are ready to jump in and do the same.\u003c/p\u003e\n\u003cp\u003eWhen you close your eyes, what do you see? Rows of clean code? Pages of wireframes? CMS back-ends? If that sounds about right, you just might be the person for Nebo’s back-end engineer role.\u003c/p\u003e\n\u003cp\u003eYour brain is wired for manipulating data and you’re equipped with the skills to maintain and develop features for existing web applications and websites — and build complex web applications either from scratch or within existing frameworks.\u003c/p\u003e\n\u003cp\u003eCollaboration is key at Nebo, and you should be able to participate in project planning and tactical direction with your team as well as build internal tools to help support other Nebo departments.\u003c/p\u003e\n\u003cp\u003eWe’re looking for someone with 2-5 years of professional software experience and a computer science degree or equivalent experience.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the Position:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a Back-End Web and Application Engineer, you’d be joining our Back-End Engineering team, which performs a variety of tasks, including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eParticipating in project planning and tactical direction \u003c/li\u003e\n\u003cli\u003eWorking with and developing CMS back-ends \u003c/li\u003e\n\u003cli\u003eMaintenance and feature development for existing web applications/websites \u003c/li\u003e\n\u003cli\u003eBuilding complex web applications either from scratch or within existing frameworks \u003c/li\u003e\n\u003cli\u003eBuilding internal tools to help support other Nebo departments\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eHere are some of the technologies we use on a daily basis:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eRuby / Rails \u003c/li\u003e\n\u003cli\u003ePHP \u003c/li\u003e\n\u003cli\u003ePostgres and MySQL \u003c/li\u003e\n\u003cli\u003eGit / GitLab \u003c/li\u003e\n\u003cli\u003eNebo CMS (our in-house Content Management System built and maintained by our team!) \u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSkills Required:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e2+ years of web development experience \u003c/li\u003e\n\u003cli\u003eExperience with an object-oriented, back-end web development language (PHP, RoR, etc) \u003c/li\u003e\n\u003cli\u003eExperience with creating \u0026amp; customizing content management systems (Wordpress, Magento, etc) \u003c/li\u003e\n\u003cli\u003eExperience using version control to manage coding projects \u003c/li\u003e\n\u003cli\u003eA solid portfolio demonstrating back-end web application/website development capability \u003c/li\u003e\n\u003cli\u003eWritten and verbal communication skills\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eThe things that will set you apart (AKA Bonus Skills):\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with E-commerce platforms (Magento, osCommerce, Shopify, etc) \u003c/li\u003e\n\u003cli\u003eExperience with HTML, CSS, JavaScript \u003c/li\u003e\n\u003cli\u003eKnowledge of SEO best practices\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis is a full-time position and compensation is dependent upon experience. We're currently working remotely due to COVID-19, but going forward this position will be based in our office located in Atlanta, Georgia. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNebo's Commitment to Diversity \u0026amp; Inclusion\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs a human-centered agency, we believe in uplifting our community and advancing society through inclusive business practices. We're dedicated to providing equal opportunities and equal access to all individuals regardless of race, color, religion, ethnic or national origin, gender, genetic information, age, disability, sexual orientation, gender identity, gender expression, and veteran’s status.\u003c/p\u003e\n\u003cp\u003eThank you for your interest in Nebo!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply directly \u003ca href=\"https://neboagency.applytojob.com/apply/NOMuXx9pxT/BackEnd-Web-Application-Engineer?source=GitHub\"\u003ehere\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUNjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c674d5554e482dab31995287fe28cf2f8ba3bb89/nebo-logo.png"},{"id":"d322291e-81a5-4eac-abd7-c53e9769e172","type":"Full Time","url":"https://jobs.github.com/positions/d322291e-81a5-4eac-abd7-c53e9769e172","created_at":"Thu Mar 11 21:07:11 UTC 2021","company":"Aryaka Networks","company_url":"http://www.aryaka.com","location":"San Mateo/US Remote","title":"Full Stack Developer","description":"\u003cp\u003eWho are we – Aryaka, the Cloud-First WAN company, brings agility, simplicity and a great experience to consuming the WAN-as-a-service. An optimized global network and innovative technology stack delivers the industry’s #1 managed SD-WAN service and sets the gold standard for application performance. Aryaka’s SmartServices platform offers connectivity, application acceleration, security, cloud networking and insights, leveraging global orchestration and provisioning. The company’s customers include hundreds of regional and global enterprises including several in the Fortune 100.\u003c/p\u003e\n\u003cp\u003eYou will have -\nBachelor's degree in Computer Science or similar\n5-8 years of experience as a full stack developer\nYou will definitely possess these technical skills –\u003c/p\u003e\n\u003cp\u003eExperience developing web applications in modern frameworks (Vue/React)\nExcellent knowledge in Java (1.8)\nUnderstanding of functional programming\nWorking experience in Hibernate, Spring\nExperience in building REST based API\nWorking knowledge of modern CSS features, JavaScript (ES6) syntax and HTML\nCSS frameworks such as bootstrap\nGood understanding of SCSS\nKnowledge in version control systems (e.g., SVN, GIT)\nGood for you to have –\u003c/p\u003e\n\u003cp\u003eFamiliarity with TypeScript\nMessage queue\nGraphing libraries like D3js or similar\nHave working knowledge of network protocols.\nKnowledge in SD-WAN space\nBird’s eye view of your role –\u003c/p\u003e\n\u003cp\u003eBuild high quality web application using the modem frameworks like VUE/React.\nScale distributed applications, write code, and deliver with speediness and quality.\nOwn the front-end development and collaborate with User Experience Designers and Product Managers and build world-class UI experience.\nProduce high quality software that is unit tested, code reviewed, and checked in regularly for continuous integration\nParticipate in code and design reviews to maintain our high development standards\nDebug production issues across services and multiple levels of the stack\nCollaborate with cross-org teams across the company.\u003c/p\u003e\n\u003cp\u003eWhat will you bring –\nAbility to work in a fast-paced technology environment\nDrive to solve problems and propose recommendations\u003c/p\u003e\n\u003cp\u003eWhat are your performance objectives –\u003c/p\u003e\n\u003cp\u003eWrite well-crafted, well-tested, readable, maintainable code\nParticipate in code reviews to ensure code quality and distribute knowledge\nWork in an agile development environment, coordinating with other internal and external teams to help ensure proper workflows throughout the entire application experience\nWork closely with the UX and product team to understand the requirements\nHow will your lofty goals be translated into specific actions / short term goals –\u003c/p\u003e\n\u003cp\u003eWith the first 30 days, you will learn about Aryaka in depth and understand the technology and the codebase of the application\u003c/p\u003e\n\u003cp\u003eWithin the first 90 days, you will have started working on the product and churning out features\u003c/p\u003e\n\u003cp\u003eWhat’s in it for you? (EVP – Employee Value Proposition) –\u003c/p\u003e\n\u003cp\u003eWork for a global, fast-growing SD-WAN innovator\nBe a part of a company culture that embraces diversity and inclusivity\nAryaka was named one of the INC. magazines best places to work for 2020\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://app.jobvite.com/j?cj=o9hAefwY\u0026amp;s=GitHub_Jobs\"\u003ehttps://app.jobvite.com/j?cj=o9hAefwY\u0026amp;s=GitHub_Jobs\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eor email resume directly: \u003ca href=\"mailto:patti.lopez@aryaka.com\"\u003epatti.lopez@aryaka.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHljIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--be84511ba32d4c427aa7768ae635bfd1b38a010b/image001.png"},{"id":"98c56b9d-9e5d-4d81-976d-654fca160023","type":"Full Time","url":"https://jobs.github.com/positions/98c56b9d-9e5d-4d81-976d-654fca160023","created_at":"Thu Mar 11 20:36:04 UTC 2021","company":"Nearsure ","company_url":"https://www.nearsure.net/","location":"Latin America ","title":"Java/Scala Developer ","description":"\u003cp\u003eWho We Are\u003c/p\u003e\n\u003cp\u003eWe are a growing start-up with amazing opportunities!\u003c/p\u003e\n\u003cp\u003eNearsure was created to help US-based companies augment their software development teams efficiently. By being remote-first and connecting with developers across Latin America, we can access top tech talent while keeping a lean organizational structure.\u003c/p\u003e\n\u003cp\u003eOur reach spans thousands of IT professionals, with skills in multiple industries and technologies. We have a fully distributed team working remotely from Argentina, Bolivia, Colombia, Costa Rica, Ecuador, Mexico, Peru and Uruguay and we want to keep expanding all over Latin America!\u003c/p\u003e\n\u003cp\u003eRole Description\u003c/p\u003e\n\u003cp\u003eWe are looking for a Senior Java/Scala Developer to work from home for a challenging project in the US. You will be joining the team of a company who connects the world’s leading organizations with qualified suppliers, contractors, and vendors\u003c/p\u003e\n\u003cp\u003eThe successful candidate will collaborate in our client SaaS Analytics platform and will be responsible for developing and delivering new components and features for the platform\u003c/p\u003e\n\u003cp\u003eThis is a remote, full-time position with a 40-hours workload per week for Latin America only.\u003c/p\u003e\n\u003cp\u003eJob Responsibilities:\u003c/p\u003e\n\u003cp\u003eWork with product management and dev team to design, develop and deliver product features and enhancements\nDesign/develop customer workflows.  Ensure solution is scalable and can handle large data, complex analytics and multiple users\nAutomate testing and deployment of software so team can deliver enhancements to customers on a regular cadence\u003c/p\u003e\n\u003cp\u003eEducation/Experience:\u003c/p\u003e\n\u003cp\u003eBachelor Degree in Computer Science or equivalent\n3+ years of experience with modern languages such as Java/C#/JavaScript/Scala\nKnowledge of Scala/functional programming a significant plus\nExperience in cloud automation\nExperience in test driven development\nAbility to work effectively in a distributed, collaborative, agile environment and deliver solutions on a regular cadence\u003c/p\u003e\n\u003cp\u003eWhat We Offer\u003c/p\u003e\n\u003cp\u003eWork from home, with flexible working schedules\nCompetitive salary in USD\nPaid time off (annual leave, National holidays, sick time and parental leave)\nTake part in challenging projects for distributed companies in the US\nIntegrate a growing team with great opportunities for professional growth and a friendly, multicultural environment with a great company culture.\nA tailor-made benefits package focused on health, wellbeing, entertainment, training, and personal finances available for you to choose what you really care about\u003c/p\u003e\n\u003cp\u003eWe are a fully distributed, multicultural start-up looking for the best talent in Latin America. Don’t hesitate to apply if you feel you are a good fit for this position!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail: \u003ca href=\"mailto:dayana.ramirez@nearsure.net\"\u003edayana.ramirez@nearsure.net\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHVjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--59858438b9f123193ebea8e28e30bb2cdc00e83b/logo%20ns.jpg"},{"id":"903a33a6-1089-48c3-9618-0b1d6c2cb278","type":"Full Time","url":"https://jobs.github.com/positions/903a33a6-1089-48c3-9618-0b1d6c2cb278","created_at":"Thu Mar 11 15:26:07 UTC 2021","company":"Rewind","company_url":"https://rewind.com/","location":"Remote within Canada","title":"Senior Full Stack Software Developer (Remote within Canada)","description":"\u003cp\u003eSenior Full Stack Software Developer\u003c/p\u003e\n\u003cp\u003eAbout Rewind\u003c/p\u003e\n\u003cp\u003eRewind is a service that protects the data that is driving your business, from a simple side hustle to a successful venture. Our focus is on backing up data that lives in the cloud – in apps like Shopify, BigCommerce, and QuickBooks Online. We invite you to read our startup story to learn where we came from and where we’re going. For a more technical view, check out our Behind the App feature on the BigCommerce Developers Blog.\u003c/p\u003e\n\u003cp\u003eWe care about honesty, we believe in learning from our mistakes, and we support each other as we grow.\u003c/p\u003e\n\u003cp\u003eABOUT THE JOB\u003c/p\u003e\n\u003cp\u003eThe development team at Rewind is made up of four small teams of 2 to 3 people; these people work together, collaboratively, to build new features and functions for our amazing customers.\u003c/p\u003e\n\u003cp\u003eIn broad terms, each member of the team is responsible for the following:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCollaborating with other members of the development team to derive the best possible design to meet requirements\u003c/li\u003e\n\u003cli\u003eImplementing, testing, documenting, and maintaining back-end systems for multiple high-traffic services\u003c/li\u003e\n\u003cli\u003eProviding constructive feedback in the form of code and design reviews\u003c/li\u003e\n\u003cli\u003eLooking for ways to improve our development and deployment processes\u003c/li\u003e\n\u003cli\u003eEnsuring security and performance of our products\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDay to day, you will work alongside other members of the team to bring new features to our growing list of services. Rewind is a large system made up of several components that all interwork in harmony. Some ideas we have in the backlog that have not made their way into our services include user management, action auditing, anomaly detection, dynamic reporting, exporting, trend analysis, real-time data translation, copy…\u003c/p\u003e\n\u003cp\u003eDeveloping reliable, securable, scalable, supportable code is a must. You will help put out some fires, especially the ones you accidentally created (we are big on accountability, you break it, you fix it), including incident response and remediation, but your main focus will be the reliability and robustness in all the things you help build. Less-flammable apps; fewer smouldering embers; automated fire suppression.\u003c/p\u003e\n\u003cp\u003eHere are some real examples of the work we’ve done lately that might help you to get a better idea of what this job entails:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAdoption of Shopify’s new versioned API - this one keeps us in business!\u003c/li\u003e\n\u003cli\u003eSupport for Shopify’s new bulk APIs; this cut our operating costs (fewer servers) and increased the speed of our backups.\u003c/li\u003e\n\u003cli\u003eRewind Copy for QuickBooks; #1 feature request for QuickBooks customers, move your data from here to there and make it easy.\u003c/li\u003e\n\u003cli\u003eRewind API (version 1); services that want to power data resiliency in their apps with Rewind can now do so.\u003c/li\u003e\n\u003cli\u003eHooking Hubspot into various areas of our product to capture customer events for sales/marketing.\u003c/li\u003e\n\u003cli\u003eAddressing multiple code and database scaling challenges in the processing of daily backups for our American BigCommerce customers.\u003c/li\u003e\n\u003cli\u003eAdding support for new entry level pricing plans that required creating limitations in product functionality.\u003c/li\u003e\n\u003cli\u003eImplementing a new first time user experience features to \u003ca href=\"https://app.rewind.io\"\u003ehttps://app.rewind.io\u003c/a\u003e.\u003c/li\u003e\n\u003cli\u003eUpgrading all applicable components from Rails 5 to Rails 6.\u003c/li\u003e\n\u003cli\u003eEnhancements to our administrative interface (the one that support, sales, and marketing rely on) to bundle customers, change billing plans, and cancel subscriptions.\u003c/li\u003e\n\u003cli\u003eAggregating Webhooks with DynamoDB and SQS Delay Queues\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eABOUT YOU\u003c/p\u003e\n\u003cp\u003eYou are a perfect match for this role if you’re someone who possesses:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGreat troubleshooting and analytical skills, you’re an exceptional communicator, you have prior experience building or maintaining Ruby on Rails-based applications, and you have a curious mind for how things work and what makes them tick.\u003c/li\u003e\n\u003cli\u003eYou should enjoy making complicated situations simple and painless. You should be a stellar communicator, even when you have to communicate less-than-stellar news. You should have highly tuned senses of compassion and empathy and a drive to constantly help others.\u003c/li\u003e\n\u003cli\u003eYou must be proficient in REST and GraphQL APIs, JavaScript, HTML, CSS, SQL, Linux, and major browser development tools. You should be well-versed in AWS, source control management (preferably Git), Docker, and one of either Ruby or Python.\u003c/li\u003e\n\u003cli\u003eYou might have a CS degree. You might not. That’s not what we’re looking for. We care about what you can do and how you do it, not about how you got here. A strong track record of conscientious, thoughtful work speaks volumes.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe strongly encourage candidates of all different backgrounds and identities to apply. Each new hire is an opportunity for us to bring in a different perspective, and we are always eager to further diversify our company. Rewind is committed to building an inclusive, supportive place for you to do the best and most rewarding work of your career.\u003c/p\u003e\n\u003cp\u003eExperience comes in many forms, many skills are transferable, and passion goes a long way. If your background is close to what we’re looking for, please consider applying, even if you aren’t able to check every box above. We are dedicated to diversity and providing an inclusive workplace for all and especially encourage members of underrepresented groups to apply.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://rewind.bamboohr.com/jobs/view.php?id=22\u0026amp;source=aWQ9MTM%3D\"\u003ehttps://rewind.bamboohr.com/jobs/view.php?id=22\u0026amp;source=aWQ9MTM%3D\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaE9jIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--22d19ce2a66725ec5e968cefbb9d439d6721edfc/Rewind%20New%20Logo_Rewind%20New%20Logo.png"},{"id":"d90f6151-e609-4a00-b8c6-ddc6bd3e5892","type":"Contract","url":"https://jobs.github.com/positions/d90f6151-e609-4a00-b8c6-ddc6bd3e5892","created_at":"Thu Mar 11 16:00:43 UTC 2021","company":"ThorTech Solutions","company_url":"https://www.thortech-solutions.com/","location":"Remote","title":"Sr. DevOps Engineer","description":"\u003cp\u003e\u003cstrong\u003eSr. DevOps Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThis is a contract role expected at 40hrs/week; EST hours\u003c/li\u003e\n\u003cli\u003eThe contract is 3 months to start, however, with a successful candidate, will very likely be extended to 12\u003c/li\u003e\n\u003cli\u003e1099 and C2C\u003c/li\u003e\n\u003cli\u003eThe role is 100% remote\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout ThorTech Solutions:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThorTech Solutions is a software development and IT consultancy that specializes in coming up with creative solutions in the cloud, specifically AWS. We utilize new technology and techniques to enable our clients to do things today that they couldn’t do yesterday.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the Client:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe end client is a global enterprise\u003c/li\u003e\n\u003cli\u003eThey are looking for someone to start ASAP\u003c/li\u003e\n\u003cli\u003eWe (ThorTech) already have one of our consultants working on this contract and the client has requested a second set of hands, so you would likely work closely with our consultant\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDuties / Responsibilities:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eContinuous Release and Deployment Support Services\u003c/li\u003e\n\u003cli\u003eContinuous Monitoring Support Service\u003c/li\u003e\n\u003cli\u003eIncludes modification of application code as necessary\u003c/li\u003e\n\u003cli\u003eContinuous Feedback and Optimization Support Services\u003c/li\u003e\n\u003cli\u003eAWS Infrastructure and Security Support Services\u003c/li\u003e\n\u003cli\u003eProvide monthly status reviews depicting performance\u003c/li\u003e\n\u003cli\u003eProvide thought leadership and best practices to development teams\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years experience in a DevOps Engineer role\u003c/li\u003e\n\u003cli\u003eSignificant experience working with Java applications\u003c/li\u003e\n\u003cli\u003eExperience with Java profiling/optimization\u003c/li\u003e\n\u003cli\u003eExperience with SQL profiling (specifically PostgresSQL)\u003c/li\u003e\n\u003cli\u003eAWS infrastructure and security support services (K8s, docker, CloudFront, elastic beanstalk, etc)\u003c/li\u003e\n\u003cli\u003eDeep experience with building and maintenance of CI/CD pipelines\u003c/li\u003e\n\u003cli\u003eProduction experience with CloudFormation\u003c/li\u003e\n\u003cli\u003eProduction experience with Docker, K8s\u003c/li\u003e\n\u003cli\u003eProduction experience with monitoring tools such as Splunk and DataDog\u003c/li\u003e\n\u003cli\u003eExperience with Github Actions\u003c/li\u003e\n\u003cli\u003eExcellent communication skills\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eFor interested applicants, please forward your updated resume/CV to - \u003ca href=\"mailto:careers@thortech-solutions.com\"\u003ecareers@thortech-solutions.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaG1jIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--022bfb60a520dcdf3d6a792a3c8605ca6487c5cd/TT%20Logo%20NEW.gif"},{"id":"fec06c18-797c-4acb-a869-3aeaf5fd8ab3","type":"Full Time","url":"https://jobs.github.com/positions/fec06c18-797c-4acb-a869-3aeaf5fd8ab3","created_at":"Thu Mar 11 15:47:53 UTC 2021","company":"CEGEKA","company_url":"http://www.cegeka.com","location":"Veenendaal","title":"Software Architect","description":"\u003cp\u003eVan voor tot achter ontwikkel jij het software platform voor onze klanten. Jouw architectuur staat aan de basis van de meest optimale oplossing voor de klant. Je bent op de hoogte van de nieuwste ontwikkelingen. Vanuit jouw ervaring ontwikkel je roadmaps om migratie en/of uitrol mogelijk te maken. Je stond vooraan toen men begon met IOT, Big Data en/of Cloud apps. Het is jouw charme en tact waarmee jij de klant en je team enthousiasmeert om te gaan werken met de nieuwste veelbelovende technologieën.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJe zet de krijtlijnen uit m.b.t. de software architectuur\u003c/li\u003e\n\u003cli\u003eJe creëert optimale oplossing voor de vraag van de klant volgens standaarden en “best practices”.\u003c/li\u003e\n\u003cli\u003eJe zorgt tevens voor een volledig en accurate documentatie\u003c/li\u003e\n\u003cli\u003eJe neemt de leiding in het uitwerken van de strategische roadmap\u003c/li\u003e\n\u003cli\u003eJe bent verantwoordelijk voor het migratieplan\u003c/li\u003e\n\u003cli\u003eJe onderzoekt en adopteert snel nieuwe technologieën\u003c/li\u003e\n\u003cli\u003eJe werkt nauw samen met de sales en kan de rol van pre-sales vervullen\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWat breng jij mee?\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eMinimaal 3 jaar ervaring in een vergelijkbare rol als architect\u003c/li\u003e\n\u003cli\u003eJij bent strategisch en conceptueel sterk en kan de plannen goed vertalen naar klanten en collega’s\u003c/li\u003e\n\u003cli\u003eJij kan makkelijk schakelen op verschillende niveaus intern en extern, waaronder C-level\u003c/li\u003e\n\u003cli\u003eJe hebt ervaring in applicatie-integratie en een uitstekende kennis van verschillende soorten databases op het Microsoft platform\u003c/li\u003e\n\u003cli\u003eJe hebt ervaring met Azure (PaaS, IaaS en SaaS)\u003c/li\u003e\n\u003cli\u003eDe opgedane kennis en ervaring kun je aantoonbaar maken door middel van certificeringen, zoals bijvoorbeeld Microsoft (Azure) certificeringen\u003c/li\u003e\n\u003cli\u003eJe blijft graag op de hoogte van de laatste ontwikkelingen en trends in de IT-markt zodat het Cegeka Solution portfolio mede dankzij jouw kennis altijd up to date is\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWat hebben wij jou te bieden?\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eSamen met gemotiveerde en deskundige collega’s werken aan digitale oplossingen die jouw klanten daadwerkelijk helpen bij het bereiken van hun doelen;\u003c/li\u003e\n\u003cli\u003eEen aantrekkelijk salaris dat past bij je opleiding en werkervaring;\u003c/li\u003e\n\u003cli\u003ePrima secundaire arbeidsvoorwaarden, waaronder een leaseauto;\u003c/li\u003e\n\u003cli\u003eInteressant en leerzaam werk bij een TOP Employer die alleen genoegen neemt met de hoogste kwaliteit;\u003c/li\u003e\n\u003cli\u003ePrima on- en offline faciliteiten om te overleggen en inspiratie op te doen;\u003c/li\u003e\n\u003cli\u003eVeel gelegenheid om aan je persoonlijke ontwikkeling te werken met opleidingen, cursussen, trainingen én met werk dat jou helpt om je grenzen te verleggen\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eAspire to more: onze belofte aan jou\u003c/h2\u003e\n\u003cp\u003eJe krijgt bij Cegeka alle ruimte om jezelf als professional verder te ontwikkelen. Samen realiseren we wat je écht wil betekenen voor onze klanten en collega’s. We nodigen je graag uit om met ons mee te groeien. In een ongekende veelzijdigheid aan uitdagende, betekenisvolle IT-projecten. Zet je stempel op projecten bij aansprekende klanten waarbij we het verschil maken. Aspire to more.\u003c/p\u003e\n\u003cp\u003eWe werken hier altijd met elkaar samen. Intensief, met veel plezier en betrokkenheid. Binnen een cultuur gedreven door familiewaarden: vol vertrouwen, mensgericht, open, loyaal en respectvol. Met veel vrijheid en verantwoordelijkheid. Kom deel uitmaken van de volgende fase van een trots, succesvol, snelgroeiend, innovatief, Europees IT-bedrijf vol ambities.\u003c/p\u003e\n\u003ch2\u003eInteresse?\u003c/h2\u003e\n\u003cp\u003eSolliciteer nu via het \u003cstrong\u003esollicitatieformulier.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/3rF3GZB\"\u003eKlik hier voor het sollicitatieformulier!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/3rF3GZB\"\u003eKlik hier voor het sollicitatieformulier!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGFjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a6acb07590cb679262fc314e87bc205d1e85f53f/ce.jpeg"},{"id":"660d4512-cfdd-4c45-832d-4cd456b6ca37","type":"Full Time","url":"https://jobs.github.com/positions/660d4512-cfdd-4c45-832d-4cd456b6ca37","created_at":"Thu Mar 11 15:18:54 UTC 2021","company":"Kellen","company_url":"https://www.kellencompany.com/","location":"Atlanta, GA","title":"Full-Stack Web Developer","description":"\u003cp\u003eGeneral Purpose of the Position\u003c/p\u003e\n\u003cp\u003eKellen is seeking a full-stack web developer who is an expert on user-facing and back-end technologies and best practices, including creating WordPress themes and plugins. Using a combination of programming skills (e.g., PHP, HTML5, CSS3, and JavaScript) and aesthetics (understanding element arrangements on the screen, the color and font choices, etc.) the Web Developer creates and maintains sites for Kellen and its clients.  This individual must be able to effectively translate design prototypes into fully functioning responsive websites.\u003c/p\u003e\n\u003cp\u003eEssential Functions\u003c/p\u003e\n\u003cp\u003e-Manages the design and implementation of responsive websites from initial concept, site -architecture, and user interface to finished deliverable.\n-Codes and implements WordPress sites from Photoshop layout through html/CSS to a custom theme, functions, and plugins.\n-Design and implement new features, enhancements, and content of existing websites.\n-Create and update re-usable code libraries to streamline WordPress development cycle.\n-Facilitate client WordPress training, site documentation and maintenance.\n-Design interfaces and graphics for presentations and mobile-delivered applications.\n-Assesses existing sites/systems for code quality and interactive appeal.\n-Estimate the level of effort of development sites or for individual site features and provides proposals to clients.\n-Manages trouble tickets, such as bugs or requests for site changes.\n-Manages client invoice/billing process.\n-Manages domain registrations and invoices/billings.\n-Assist with new business and client-renewal growth efforts; develops proposals and participates in pitch meetings.\n-Maintains Kellen’s corporate website and intranet.\n-Other duties that align with the mission and vision of the company.\u003c/p\u003e\n\u003cp\u003eQualifications:\nRequired:\u003c/p\u003e\n\u003cp\u003e-2+ years of experience with PHP 7.2 or higher\n-2+ years of experience with C#/asp.net (.net 4.5+ and .net Core)\n-Familiarity with MVC development\n-Demonstrated ability with Git version control\n-Experience programming within CMS platforms (WordPress, Drupal, DNN, Kentico, etc.)\n-Experience with Responsive Design Frameworks such as Bootstrap, Foundation, etc.\n-Experience programming against web APIs\n-Javascript/JQuery/CSS/SASS\n-Excellent written and verbal communication skills\n-Ability to work with a remote team and effectively manage time\n-Must provide a portfolio of recent projects\n-Must provide code samples (C# and PHP)\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e   Preferred:\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003e-Experience with React, Angular, NodeJS or similar Javascript frameworks\n-IIS 7+ web server administration\n-LAMP web server administration\n-Experience with member management systems (Impexium, MemberClicks, iMIS)\n-Experience with non-profit associations\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDue to COVID-19, the position will be fully remote initially, but will transition to the Kellen Atlanta office once that office re-opens.  At that point, the developer will work from the office a minimum of 4 days per week, with the opportunity for one day of remote work per week.  After an initial review period, there may be opportunity to increase the number of remote work days.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWorking at Kellen\nThis role is based in Kellen’s Atlanta office. Kellen employees enjoy competitive compensation and full benefits packages including 12 U.S. holidays plus generous accrued PTO, retirement plans with company match, medical/dental/vision insurance, tuition reimbursement, flexible work schedules, and much more. The successful candidate will join a collegial, diverse and friendly atmosphere of communications, management and public affairs professionals working hard to turn our client missions into reality.\u003c/p\u003e\n\u003cp\u003eTravel Requirements\nTravel may be necessary, up to 20% of the time and may be by travel by air, car, or rail.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease email your resume and desired salary to \u003ca href=\"mailto:mschuster@kellencompany.com\"\u003emschuster@kellencompany.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaEtjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e40c665113d391e3914b08f8393bcd50b7a641b8/Kellen%20logo.png"},{"id":"9eab3335-79db-4524-b91c-a65fb48916e5","type":"Full Time","url":"https://jobs.github.com/positions/9eab3335-79db-4524-b91c-a65fb48916e5","created_at":"Thu Mar 11 14:18:48 UTC 2021","company":"FTL Labs Corp","company_url":"https://www.ftllabscorp.com/","location":"USA - Remote","title":"Engineering Software Developer","description":"\u003cp\u003eABOUT THE POSITION:\u003c/p\u003e\n\u003cp\u003eFTL Labs Corporation is seeking a full-time Engineering Software Developer with technical software development skills for desktop and Android platforms to address specific challenges relative to an exciting 12 to 18-month program with the US Navy that employs cutting-edge image acquisition, 3D modeling, and artificial intelligence to solve maintenance and readiness challenges. Remote work is an option.\u003c/p\u003e\n\u003cp\u003eRelevant skills include the following:\u003c/p\u003e\n\u003cp\u003eC#, WPF, C++, SQL, Python\nMachine learning, neural nets, AI\nPhotogrammetry, point clouds, and digitization of physical environments\u003c/p\u003e\n\u003cp\u003eMachine vision, image processing, and target recognition\n3D graphics, modeling, transforms, and visualization\nMathematical modelling and algorithms (MATLAB, R)\nDatabase and cloud architectures\nVisualization and manipulation of large data sets\u003c/p\u003e\n\u003cp\u003eDue to the nature of our work for the U.S. Government, we are required to hire U.S. Citizens. Bachelor's degree or its equivalent with a minimum of 5 years of experience.\u003c/p\u003e\n\u003cp\u003eFTL Labs continues to work from home primarily during COVID restrictions and could be acceptable generally.\u003c/p\u003e\n\u003cp\u003eFTL Labs is in the vibrant intellectual community of western Massachusetts, close to the University of Massachusetts flagship campus and Amherst College. Pay is commensurate with experience. We offer competitive compensation and benefits, including excellent health and dental coverage, short- and long-term disability, life insurance, profit-sharing, and 401k with employer contribution. During the COVID public health emergency all FTL employees are telecommuting, and we look forward to returning to our office in Amherst when we can ensure it will not endanger the health or safety of our staff.\u003c/p\u003e\n\u003cp\u003eABOUT FTL LABS:\u003c/p\u003e\n\u003cp\u003eFTL Labs Corporation is a tight-knit association of Ph.D. scientists and seasoned engineers who work to develop next-generation software and technology products to solve problems for government and industrial clients. FTL personnel have participated in Phase I, Phase II, and Phase III Small Business Innovation Research (SBIR) programs through the National Science Foundation, Department of Defense, and NASA, and we strive to transition these technologies to the market. We frequently collaborate with both academic and industry leaders, such as UMass Amherst, Northrop Grumman and Sikorsky. Our work demonstrates innovative thinking in a team setting across a wide range of fields and specialties,  including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMachine learning, neural nets, and artificial intelligence\u003c/li\u003e\n\u003cli\u003eExpertise in optics, ultrasound, image analysis, robotics, and life sciences\u003c/li\u003e\n\u003cli\u003eBig data analysis, virtual and augmented reality\u003c/li\u003e\n\u003cli\u003eCustom software solutions\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFTL Labs is an affirmative action-equal opportunity employer; veterans are encouraged to apply.\u003c/p\u003e\n\u003cp\u003eWe comply with all applicable federal, state and local laws regarding recruitment and hiring. All qualified applicants are considered for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other category protected by applicable federal, state, or local laws.\u003c/p\u003e\n\u003cp\u003eIf you are a creative self-starter, technically innovative, and have excellent writing skills, we want to hear from you!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease email \u003ca href=\"mailto:kristie@ftllabscorp.com\"\u003ekristie@ftllabscorp.com\u003c/a\u003e and \u003ca href=\"mailto:martha@ftllabscorp.com\"\u003emartha@ftllabscorp.com\u003c/a\u003e.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHlkIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c105562fb996bde4cecc1dbe7ecf35f28fd03caf/Logo.JPG"},{"id":"f3fd85f2-c142-424b-9a9f-eb7eac864279","type":"Full Time","url":"https://jobs.github.com/positions/f3fd85f2-c142-424b-9a9f-eb7eac864279","created_at":"Thu Mar 11 13:45:59 UTC 2021","company":"Farmy AG","company_url":"https://www.farmy.ch","location":"Barcelona","title":"Junior Android Developer (Kotlin, Java)","description":"\u003cp\u003eWe are happy to invite you to join our Android development team at the Farmy IT Department headquaters in Barcelona, Spain.\u003c/p\u003e\n\u003cp\u003eFarmy develops and runs a transparent and regional food retail platform which connects customers with farmers’ product supplies directly. When you place an order with Farmy, you get fresh food, which on the same day was collected at the farmyard, right to your doorstep or your favorite cafe – a thing, no conventional retail chain can give you. Our customers love eating healthy and fresh food, and with over 10,000 products on sale in our catalog, we do try to satisfy their appetite with every update.\u003c/p\u003e\n\u003cp\u003eOur company is growing rapidly, after five successful years on the Swiss market, preparing for expansion and we’re hiring.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMaintenance and development of user and enterprise Android applications\u003c/li\u003e\n\u003cli\u003eParticipation in user experience design\u003c/li\u003e\n\u003cli\u003eImplementation of tests\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWritten and spoken English\u003c/li\u003e\n\u003cli\u003eKotlin, Java and JVM knowledge\u003c/li\u003e\n\u003cli\u003eExperience with Android SDK\u003c/li\u003e\n\u003cli\u003eFamiliarity with Android app building blocks\u003c/li\u003e\n\u003cli\u003eHave published at least one original Android app\u003c/li\u003e\n\u003cli\u003eExperience working with remote data via REST and JSON.\u003c/li\u003e\n\u003cli\u003ePractical knowledge of the general mobile best practices, architecture, trends, and emerging technologies\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA great learning curve from day 1 on which will go beyond just Android\u003c/li\u003e\n\u003cli\u003eOne day a week work from home (we're 100% remote for the duration of the state of emergency)\u003c/li\u003e\n\u003cli\u003eFree gym abo\u003c/li\u003e\n\u003cli\u003eAn annual budget for books and courses\u003c/li\u003e\n\u003cli\u003eWork at a company which puts excellence and customer satisfaction at the first place\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://farmy.join.com/jobs/1949438-junior-android-developer-kotlin-java?pid=24ab8afa01f084c85dce\u0026amp;oid=3495185f-255e-4dc0-98e2-efc9f26b82bc\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=junior%2Bandroid%2Bdeveloper%2Bkotlin%2Bjava\"\u003ehttps://farmy.join.com/jobs/1949438-junior-android-developer-kotlin-java?pid=24ab8afa01f084c85dce\u0026amp;oid=3495185f-255e-4dc0-98e2-efc9f26b82bc\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=junior%2Bandroid%2Bdeveloper%2Bkotlin%2Bjava\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZzZjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d98041604c97bd121c5eec213c474328b6d7c589/farmy.png"},{"id":"58329bfb-7b67-4229-ad16-ec07379ee720","type":"Full Time","url":"https://jobs.github.com/positions/58329bfb-7b67-4229-ad16-ec07379ee720","created_at":"Thu Mar 11 11:00:22 UTC 2021","company":"Consors Finanz BNP Paribas S.A. Niederlassung Deutschland","company_url":"https://www.consorsfinanz.de","location":"München","title":"API Gateway Manager (m/f/d)","description":"\u003ch2\u003eWho we are\u003c/h2\u003e\n\u003cp\u003eConsors Finanz is part of BNP Paribas S.A. in Germany and we are around 1700 employees in five locations. BNP Paribas S.A. is a leading international bank with 200,000 employees in 73 countries.\u003c/p\u003e\n\u003cp\u003eConsors Finanz BNP Paribas stands for financial selfdetermination in every life situation.\u003c/p\u003e\n\u003cp\u003eWe are one of the leading providers of consumer financein Germany and offer financing and insurance solutions that are tailored to the needs of our customers. Whether dynamic credit lines, individual financing or flexible card products - with digital banking from Consors Finanz BNP Paribas, customers take their liquidity into their own hands. We rely on innovative technologies, the highest security standards and responsible lending.\u003c/p\u003e\n\u003cp\u003eWe assess all applicants according to their qualifications - regardless of ethnic and social origin, age, gender, sexual identity, religion, ideology or disability. We are convinced that embracingdiversity has a positive effect on society and our company.\u003c/p\u003e\n\u003ch2\u003eAPI Gateway Manager (m/f/d)\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003e#loveyourjob #munich\u003c/strong\u003e\u003c/p\u003e\n\u003ch2\u003eYou are looking for\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eThe position consist in being API manager and adminitrator of the API Gateway tool\u003c/li\u003e\n\u003cli\u003eThe main task are the followings\u003c/li\u003e\n\u003cli\u003eDefining the strategy on Open API for Consors Finanz\u003c/li\u003e\n\u003cli\u003eEnsuring implementation and execution of API Gateway tool on the complete lifecycle , from design and documentation until execution in production and monitoring\u003c/li\u003e\n\u003cli\u003eAdmnistrating Axway API GATEWAY\u003c/li\u003e\n\u003cli\u003eEnsuring compliancy with security policy\u003c/li\u003e\n\u003cli\u003eImplementating Test procedure of API and Monitoring\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eYou have\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eEngineer API security policies as well configure API Management\u003c/li\u003e\n\u003cli\u003eAPI GW Policy Development / Migration\u003c/li\u003e\n\u003cli\u003eDeploy, configure (e.g. throttling load ), tune and monitor API Gateways\u003c/li\u003e\n\u003cli\u003eExperience in design, development, and operations of REST as well SOAP services.\u003c/li\u003e\n\u003cli\u003eKnowledge of Web APIs, REST, XML, JSON, Openapi -swagger , SOA/Web services, Internet/network security standards (mutual auth. , WS Security, OAUTH, OpenID Connect, JWT, etc)\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWe offer you\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eAttractive salary package\u003c/li\u003e\n\u003cli\u003eCompany pension scheme\u003c/li\u003e\n\u003cli\u003eWork at the office, from home or wherever you have an Internet connection\u003c/li\u003e\n\u003cli\u003eDiverse range of further training courses\u003c/li\u003e\n\u003cli\u003eFree water and coffee\u003c/li\u003e\n\u003cli\u003e(Inter-)national career prospects with the BNP Paribas Group\u003c/li\u003e\n\u003cli\u003eSubsidy for public transport, car \u0026amp; bike leasing\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eYour future starts with us!\u003c/h2\u003e\n\u003cp\u003eWe are looking forward to your application via the \u003cstrong\u003eApplication form\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYour contact with us: Ralph Ullmann\u003c/p\u003e\n\u003cp\u003ePhone: 089/ 5511 333783\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.consorsfinanz.de/karriere\"\u003ehttps://www.consorsfinanz.de/karriere\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/3v4XmwN\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/3v4XmwN\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3ljIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f8779301711e45c0ce25874e23c7ad809f383132/consor.jpeg"},{"id":"dd0d94c7-9d31-476c-9fa5-add91f6d4ef1","type":"Full Time","url":"https://jobs.github.com/positions/dd0d94c7-9d31-476c-9fa5-add91f6d4ef1","created_at":"Thu Mar 11 10:52:02 UTC 2021","company":"Smart Pricer GmbH ","company_url":null,"location":"Berlin","title":"Senior Full Stack Developer - (m/f/d) ","description":"\u003cp\u003eSmart Pricer is the leading ticket pricing company in Europe. We offer pricing services in the areas of sports, entertainment and ski resorts and are proud to work with partners such as FC Bayern Munich, DFB, Hertha BSC, Sölden ski resort, Zermatt Bergbahnen and many more. Our work is characterized by entrepreneurial thinking, effective transaction management and innovative solutions. We owe our success as one of the world's leading specialists in our field not least to a distinctly team-oriented approach.\u003c/p\u003e\n\u003cp\u003eTogether we want to grow further and are therefore looking for a\u003c/p\u003e\n\u003cp\u003eSenior Full Stack Developer - (m/f/d)\u003c/p\u003e\n\u003cp\u003eto support us as soon as possible.\u003c/p\u003e\n\u003cp\u003eWith us, you are part of a committed and motivated team that rethinks the way pricing is done with a lot of enthusiasm and drive from Berlin. If you want to take on responsibility from day one and drive our mission forward with your own ideas, then your application is just right with us.\u003c/p\u003e\n\u003cp\u003eYour Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWithin the first three months, you will familiarize yourself with our existing services (you have   access to documentations and team members)\u003c/li\u003e\n\u003cli\u003eYou will lead and own the development of our back-end pricing services incl. the design and deployment of APIs to run our services\u003c/li\u003e\n\u003cli\u003eYour responsibilities will range - from rapidly building prototypes in product discovery phase, to delivering reliable quality products in delivery phase, to developing our tech architecture further ensuring functionality, scalability, reliability and security (a hands-on mind-set and strategic oversight are essential for this)\u003c/li\u003e\n\u003cli\u003eYou will define the technical requirements of the company in detail and set up all required processes\u003c/li\u003e\n\u003cli\u003eIn 6-9 month time you will start to build and manage a small technical team of A-players (including software engineers, data scientists)\u003c/li\u003e\n\u003cli\u003eTogether with the founders you and your team will continuously iterate our product by developing hypotheses, validating them (e.g. through user research and tests) and shipping new features\u003c/li\u003e\n\u003cli\u003eYou own the operative KPIs tech and will be the voice of tech in all strategic decisions\u003c/li\u003e\n\u003cli\u003eYou oversee the monitoring of our live pricing services\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSoftware Developer with a degree in a technical related field such as Computer Science, Bio/Informations or similar\u003c/li\u003e\n\u003cli\u003eYou have at least 3 years experience working in Software Development\u003c/li\u003e\n\u003cli\u003eYou are skilled in several backend languages (Go, Ruby) and in working with and deploying cloud services in a Unix environment\u003c/li\u003e\n\u003cli\u003eOptionally you have some frontend experience in TypeScript and CoffeeScript as well as some data analytics background in Python\u003c/li\u003e\n\u003cli\u003eYou combine a strong hands-on-attitude (and are happy to develop and maintain code yourself) with strategic thinking and an entrepreneurial mindset\u003c/li\u003e\n\u003cli\u003eYou have a high focus on customer needs and contribute your best knowledge and experience about technology, products and processes\u003c/li\u003e\n\u003cli\u003eYou are interested in pricing, data mining, ML\u003c/li\u003e\n\u003cli\u003eYou are characterized by a sovereign appearance as well as good presentation and communication skills\u003c/li\u003e\n\u003cli\u003eYour are fluent in English and German\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat We Offer:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA friendly and respectful team with a family work culture\u003c/li\u003e\n\u003cli\u003eA great workplace in Berlin Mitte with a part-time remote work option\u003c/li\u003e\n\u003cli\u003eThe chance to take over a large area of expertise very quickly and to make a steep entry into a management position\u003c/li\u003e\n\u003cli\u003eAn attractive compensation package\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003cli\u003eA secure employment relationship\u003c/li\u003e\n\u003cli\u003eMeaning - our work has direct impact on sports and entertainment pricing across all of Europe\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eWe are happy to receiving your application by e-mail, stating your desired salary and earliest possible starting date, at: \u003ca href=\"mailto:miriam.weber@smart-pricer.com\"\u003emiriam.weber@smart-pricer.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ2ljIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--42ba9c34dbd16b17bce10dd2e9fff25d2dd68507/Smart%20Pricer%20Logo.jpg"},{"id":"c4e8d8aa-6b6b-46e2-85f3-1aafd3307919","type":"Full Time","url":"https://jobs.github.com/positions/c4e8d8aa-6b6b-46e2-85f3-1aafd3307919","created_at":"Thu Mar 11 10:49:41 UTC 2021","company":"WEBB Traders BV","company_url":"https://webbtraders.recruitee.com","location":"Amsterdam ","title":"Junior Software Engineer ","description":"\u003cp\u003e\u003cstrong\u003eJunior Software Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCompany\u003c/strong\u003e\nWEBB Traders is a fast growing global proprietary trading company and market maker active in electronic trading on leading international financial markets, driven by data and technology. We are entrepreneurial and innovative - embracing teamwork and creativity. Our headquarters is in Amsterdam city centre and is supported by a broader European and Asian presence from where the regional and US markets are traded.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAre you the all-round software engineer who will bolster our development team in Amsterdam?\u003c/strong\u003e\nWEBB Traders is looking for all-round junior engineers to join our young and dynamic R\u0026amp;D team in Amsterdam. We are responsible for the evolution of our trading solutions, tools, data processing, workflow automation and connectivity. You will be challenged and exposed to financial markets regulations, trading data, exchange/ market connectivity, reporting, risk management and quantitative/ big data analysis.\u003c/p\u003e\n\u003cp\u003eWe focus on continuous improvement and technological innovation. As all-round engineer you will be a member of the development team and responsible for delivering software solutions to the various stakeholders in the company. The demands by laws and regulations on high efficient and flawless processes for countless daily trades are ever increasing. It is inevitable to work closely with traders, finance, operations, risk and compliance to deliver fast, accurate and complete solutions. Programming languages we use are C++, C# and Python. The data tools we currently use are MSSQL, MongoDB, GCP, QlikSense and others.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWould you like to work in an entrepreneurial organization and become an expert in creating solutions for our trading processes? Then we are looking for you!\u003c/strong\u003e\nYou are going to build and improve software solutions for trading, risk management, operations, finance, reporting and compliance. To keep up with the fast changing market developments, you will spend time researching new technologies and inventing new features to further our success as a global trading company. \u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour work will mainly consist of:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelopment and optimization of software solutions for trading and all supporting processes, using C + +, Python, SQL and GCP.\u003c/li\u003e\n\u003cli\u003eDeeply understanding and improving the numerous processes across the company.\u003c/li\u003e\n\u003cli\u003eCollaborating with your team to devise the most effective solutions.\u003c/li\u003e\n\u003cli\u003eInteracting with users to understand their objectives and improve their work through your technical ingenuity.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWe offer\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe opportunity to join a highly professional team in a very challenging market.\u003c/li\u003e\n\u003cli\u003eBe part of a fast growing and ambitious company.\u003c/li\u003e\n\u003cli\u003eMany opportunities to work on your personal development, such as projects, conferences, and study facilities.\u003c/li\u003e\n\u003cli\u003eInternal and external training and education in trading software, working agile, hardware and software management.\u003c/li\u003e\n\u003cli\u003eA competitive reward package.\u003c/li\u003e\n\u003cli\u003eHealthy lunch at the office.\u003c/li\u003e\n\u003cli\u003eFree sport facility.\u003c/li\u003e\n\u003cli\u003eTravel costs reimbursement.\u003c/li\u003e\n\u003cli\u003eFun activities with colleagues on regular basis.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWho are you?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEager, curious and fast learner.\u003c/li\u003e\n\u003cli\u003eBachelor or Master degree in computer science.\u003c/li\u003e\n\u003cli\u003e0 to 2 years experience in a software engineering role.\u003c/li\u003e\n\u003cli\u003eStrong computer science fundamentals.\u003c/li\u003e\n\u003cli\u003eUnderstanding of computer architecture, networking and databases.\u003c/li\u003e\n\u003cli\u003eExperience with modern C++, design patterns \u0026amp; idioms.\u003c/li\u003e\n\u003cli\u003eTeam player who thrives in an agile and fast-paced environment.\u003c/li\u003e\n\u003cli\u003eStrong analytical and creative problem solving skills with a ‘get it done’ mentality.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eApplication process\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eApply via \u003ca href=\"https://ltpx.nl/Kl3MgWk\"\u003ethe application form\u003c/a\u003e on our WEBB site.\u003c/li\u003e\n\u003cli\u003ePlease share with us your motivation to work with us and why you think you will fit.\u003c/li\u003e\n\u003cli\u003eHave a chat via cam with us.\u003c/li\u003e\n\u003cli\u003eDo the programming challenge to show your engineering super powers.\u003c/li\u003e\n\u003cli\u003eCome and visit our office in Amsterdam for interviews and a drink.\u003c/li\u003e\n\u003cli\u003eAccept our offer!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eAgency calls are not appreciated.\u003c/em\u003e\u003cimg src=\"https://camo.githubusercontent.com/0526deee45b4bd2c2f9ee004f93625641614d2d2/68747470733a2f2f742e6c7470782e6e6c2f747261636b2e7068703f6f7264657269643d323431353430\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://ltpx.nl/l025DGu\"\u003eClick here to apply\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ1djIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--48c83e87dd054cb1f69f8ee19d870fb4151d2747/WEBB%20Traders.jpg"},{"id":"2ba95729-a062-420d-955d-927a7e590d6d","type":"Full Time","url":"https://jobs.github.com/positions/2ba95729-a062-420d-955d-927a7e590d6d","created_at":"Thu Mar 11 02:23:45 UTC 2021","company":"lightmatter","company_url":"http://lightmatter","location":"NYC / Remote","title":"Hiring Senior \u0026 Mid Software Engineers","description":"\u003ch2\u003eWhy Are We Hiring?\u003c/h2\u003e\n\u003cp\u003eWe're continuously hiring for software engineering roles at our company, and welcome candidates with all kinds of programming experience (different languages, frameworks, platforms, etc). We've found that both candidates with traditional CS backgrounds as well as others who are self-taught or freelancers can excel at our company.\u003c/p\u003e\n\u003cp\u003eWe're not interested in hiring for any particular niche skill at the moment. Rather, we like to engage with engineers who have a well rounded and full stack background, either for web or mobile. If you feel particularly strong in one skill though, we still would like to talk.\u003c/p\u003e\n\u003ch2\u003eMore About The Role\u003c/h2\u003e\n\u003cp\u003eAs an engineer at our company, you'll work directly with our CTO and Creative Director and other engineers on a variety of software projects covering different programming languages, frameworks, and application architectures.\u003c/p\u003e\n\u003cp\u003eThe single best reason to be an engineer at our company is because of the exposure to different programming languages, technologies and client projects.\u003c/p\u003e\n\u003cp\u003eTypical client work includes building any of the following: web and mobile apps, public and private API's, static sites and CMS platforms, e-commerce sites like Shopify stores, and digital transformation projects with enterprise clients.\u003c/p\u003e\n\u003cp\u003eFor more information about how we run our Sprints and manage our SDLC, \u003ca href=\"https://lightmatter.com/playbook/\"\u003eread our company Playbook\u003c/a\u003e.\u003c/p\u003e\n\u003ch2\u003eSpecific Qualifications\u003c/h2\u003e\n\u003cp\u003eIdeally, you have experience with the following:\u003c/p\u003e\n\u003cp\u003eYou have 2+ years working as a software engineer at another agency, a product focused startup, or an enterprise company.\u003c/p\u003e\n\u003cp\u003eYou have spent some time freelancing independently, whether as a side hustle or full time. Almost everyone on our team has been an individual freelancer at one point, and understands the value of all the “work” outside of the actual deliverable for the client: excellent communication, professionalism, punctuality and follow through.\u003c/p\u003e\n\u003cp\u003eYou have 0 ego with regards to your code, can both receive and offer feedback positively, and are willing to pair and help others as develop software alongside you.\u003c/p\u003e\n\u003cp\u003eYou're a self-starter. You're not afraid to take initiative, but know when and how to check with others to ensure you're making the right decision. You can balance the technically correct and/or more elegant solution with what the client wants (which often differs) and can do this quickly.\u003c/p\u003e\n\u003cp\u003eYou're not afraid to ship code! We don't care if it's not done yet. Push it up and get feedback!\u003c/p\u003e\n\u003cp\u003eOur company does not offer equity as we’re not a venture backed startup. However, there’s the possibility in the future for a revenue share of profit split at year’s end based on tenure.\u003c/p\u003e\n\u003cp\u003eTo apply for this role, send \u003ca href=\"mailto:ben@lightmatter.com\"\u003eben@lightmatter.com\u003c/a\u003e an introductory email and attach your resume and cover letter along with your github profile if applicable.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail resume to \u003ca href=\"mailto:ben@lightmatter.com\"\u003eben@lightmatter.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ0tjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--77431ab09ee2bbe6ada338d03a54d343058f1458/lightmatter_L_blk.png"},{"id":"ae6276b5-d919-40a9-97b7-270ee8d95205","type":"Full Time","url":"https://jobs.github.com/positions/ae6276b5-d919-40a9-97b7-270ee8d95205","created_at":"Wed Mar 10 22:31:41 UTC 2021","company":"DISH","company_url":"http:","location":"Denver, CO","title":"Senior API Developer","description":"\u003cp\u003eDISH is a Fortune 250 company with more than $14 billion in annual revenue that continues to redefine the communications industry. Our legacy is innovation and a willingness to challenge the status quo, including reinventing ourselves. We disrupted the pay-TV industry in the mid-90s with the launch of the DISH satellite TV service, taking on some of the largest U.S. corporations in the process, and grew to be the fourth-largest pay-TV provider. We are doing it again with the first live, internet-delivered TV service – Sling TV – that bucks traditional pay-TV norms and gives consumers a truly new way to access and watch television.\u003c/p\u003e\n\u003cp\u003eNow we have our sights set on upending the wireless industry and unseating the entrenched incumbent carriers.\u003c/p\u003e\n\u003cp\u003eWe are driven by curiosity, pride, adventure, and a desire to win – it’s in our DNA. We’re looking for people with boundless energy, intelligence, and an overwhelming need to achieve to join our team as we embark on the next chapter of our story.\u003c/p\u003e\n\u003cp\u003eOpportunity is here. We are DISH.\u003c/p\u003e\n\u003cp\u003ePrimary responsibilities fall into the following categories:\u003c/p\u003e\n\u003cp\u003eDesign and develop API specifications using OpenAPI Specifications/YAML that is scalable and provide greater security on data.\nGood understanding of security protocols (e.g. OAuth, SAML)\nCreate build and deployment pipelines for APIs using appropriate tools to implement Continuous integration and continuous deployment.\nSupport end-end management of the APIs over its entire lifecycle\nWork with various application teams to understand their business needs and requirements for the API implementation\nEnsure API documentation is created and remains up to date\nEnsure code and design quality with appropriate logging, monitoring, tracing, and security standards in place\nHelp troubleshoot and resolve issues related to the API platform, API accessibility and API deployments\nCreate build and deployment pipelines for APIs using appropriate tools to implement Continuous integration and continuous deployment.\nA successful Senior API Developer will have:\u003c/p\u003e\n\u003cp\u003eMore than 6 years of experience in development, and implementation of enterprise-wide solutions based on Java Technologies (Java, J2EE, Webservices)\nAt least 3-5 years of hands on experience with design, development and implementation of Spring Boot, Spring Cloud, Spring Integration or Node.JS based Microservices\nExperience in Deploying Microservices (spring-boot, node's) on Docker, Kubernetes, etc.\nDemonstrated knowledge of test-driven development practices and experience with any of the version control tools such as GitLab, and Continuous Integrations with various CI/CD tools\nPerform root cause analysis for Production issues and come up with solutions that will prevent them from happening in the future\nGovernance, Event Driven Architecture, message-based architectures, and caching strategies and frameworks.\nParticipate and contribute in grooming technical user stories impacting integration Excellent analytical, oral, written communication and presentation skills with ability to interact with global delivery technical teams.\nExperience in Agile methodologies - Kanban or SCRUM\nCompensation: $86,400.00/Yr. - $120,200.00/Yr.\u003c/p\u003e\n\u003cp\u003eFrom versatile health perks to new career opportunities, check out our benefits on our careers website.\u003c/p\u003e\n\u003cp\u003eEmployment is contingent on successful completion of a pre-employment criminal background check, which may include a drug test.\u003c/p\u003e\n\u003cp\u003eDISH endeavors to make \u003ca href=\"http://careers.dish.com\"\u003ehttp://careers.dish.com\u003c/a\u003e accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact \u003ca href=\"mailto:accessibility@dish.com\"\u003eaccessibility@dish.com\u003c/a\u003e. This contact information is for accommodation requests only; you may not use this contact information to inquire about the status of applications.\u003c/p\u003e\n\u003cp\u003eWe pride ourselves on developing and promoting talent as an Equal Employment Opportunity Employer - Veteran/Disability. All qualified applicants will receive consideration for employment without regard to race, national origin, gender, age, religion, disability, veteran status, or any other category protected by law. We are a true merit-based organization and work hard so there are no artificial barriers to one's potential success. DISH is committed to a workforce where everyone's opportunities are limitless.\u003c/p\u003e\n\u003cp\u003eConsistent with this commitment, DISH will endeavor to provide reasonable accommodation to otherwise qualified job applicants and employees with known physical or mental disabilities, unless doing so poses an undue hardship on the Company, poses a direct threat of substantial harm to the employee or others, or is otherwise not required by law.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply Online at \u003ca href=\"https://jobs.dish.com/jobs/53378?lang=en-us\u0026amp;iis=\u0026amp;iisn=\u0026amp;utm_source=GitHub\u0026amp;utm_medium=jobboard\u0026amp;utm_campaign=Wireless\u0026amp;utm_content=SrAPIDev+Denver\"\u003ehttps://jobs.dish.com/jobs/53378?lang=en-us\u0026amp;iis=\u0026amp;iisn=\u0026amp;utm_source=GitHub\u0026amp;utm_medium=jobboard\u0026amp;utm_campaign=Wireless\u0026amp;utm_content=SrAPIDev+Denver\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ0NjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--13f4d37cd6d7c83bcb5f3f342fdc23e705a7a961/DISH_WORDMARK_RED_LOGO_1115818_RGB_Newsroom.png"},{"id":"c0663e20-d2b9-4518-b538-82abd9113f0e","type":"Full Time","url":"https://jobs.github.com/positions/c0663e20-d2b9-4518-b538-82abd9113f0e","created_at":"Wed Mar 10 22:29:30 UTC 2021","company":"DISH","company_url":null,"location":"Englewood, CO","title":"Business Analyst - Catalog","description":"\u003cp\u003eDISH is a Fortune 250 company with more than $14 billion in annual revenue that continues to redefine the communications industry. Our legacy is innovation and a willingness to challenge the status quo, including reinventing ourselves. We disrupted the pay-TV industry in the mid-90s with the launch of the DISH satellite TV service, taking on some of the largest U.S. corporations in the process, and grew to be the fourth-largest pay-TV provider. We are doing it again with the first live, internet-delivered TV service – Sling TV – that bucks traditional pay-TV norms and gives consumers a truly new way to access and watch television.\u003c/p\u003e\n\u003cp\u003eNow we have our sights set on upending the wireless industry and unseating the entrenched incumbent carriers.\u003c/p\u003e\n\u003cp\u003eWe are driven by curiosity, pride, adventure, and a desire to win – it’s in our DNA. We’re looking for people with boundless energy, intelligence, and an overwhelming need to achieve to join our team as we embark on the next chapter of our story.\u003c/p\u003e\n\u003cp\u003eOpportunity is here. We are DISH. #LI-HT1\u003c/p\u003e\n\u003cp\u003eThe DISH Retail Wireless organization is looking for a Business Analyst to perform configuration and support of complex wireless product offerings in an enterprise level product catalog. You must have the ability to work in a fast paced and evolving environment where initial requirements are vague and evolving.  The ability to quickly learn the Hansen Sigma Catalog product, interpret requirements, and deliver complex configurations will be critical.\nPrimary responsibilities fall into the following categories:\nCreate complex, multi-tier product, service, and resource entities following best practices and adhering to standards identified by TMForum and DISH\nProduce and present design documents and standards for catalog configuration including but not limited to, look and feel within the catalog and configuration standards\nWork closely with the Product Team to implement new products \u0026amp; processes and changes to existing products and processes\nWorks closely with the product owner to determine if incoming requests are configuration or development work\nProvide end-user support, and participate in the development and implementation of future enhancements and/or projects. Including training and mentoring\nAnalyze, test, and document modeling integration within the catalog\nDebug data configuration issues\n#LI-RM1\u003c/p\u003e\n\u003cp\u003eA successful Business Analyst will have the following:\u003c/p\u003e\n\u003cp\u003eExcellent analytical and problem-solving skills\nExperience in Product and Service catalog configuration or similar\nStrong interpersonal and communication skills\n5+ years experience\u003c/p\u003e\n\u003cp\u003ePreferred Qualifications:\u003c/p\u003e\n\u003cp\u003eWorking knowledge of protocols such as JSON/XML/XSLT/REST\nCompensation: $55,800.00/Yr. - $76,900.00/Yr.\u003c/p\u003e\n\u003cp\u003eFrom versatile health perks to new career opportunities, check out our benefits on our careers website.\u003c/p\u003e\n\u003cp\u003eEmployment is contingent on successful completion of a pre-employment criminal background check, which may include a drug test.\u003c/p\u003e\n\u003cp\u003eDISH endeavors to make \u003ca href=\"http://careers.dish.com\"\u003ehttp://careers.dish.com\u003c/a\u003e accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact \u003ca href=\"mailto:accessibility@dish.com\"\u003eaccessibility@dish.com\u003c/a\u003e. This contact information is for accommodation requests only; you may not use this contact information to inquire about the status of applications.\u003c/p\u003e\n\u003cp\u003eWe pride ourselves on developing and promoting talent as an Equal Employment Opportunity Employer - Veteran/Disability. All qualified applicants will receive consideration for employment without regard to race, national origin, gender, age, religion, disability, veteran status, or any other category protected by law. We are a true merit-based organization and work hard so there are no artificial barriers to one's potential success. DISH is committed to a workforce where everyone's opportunities are limitless.\u003c/p\u003e\n\u003cp\u003eConsistent with this commitment, DISH will endeavor to provide reasonable accommodation to otherwise qualified job applicants and employees with known physical or mental disabilities, unless doing so poses an undue hardship on the Company, poses a direct threat of substantial harm to the employee or others, or is otherwise not required by law.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply online at \u003ca href=\"https://jobs.dish.com/jobs/53673?lang=en-us\u0026amp;iis=\u0026amp;iisn=\u0026amp;utm_source=GitHub\u0026amp;utm_medium=jobboard\u0026amp;utm_campaign=Wireless\u0026amp;utm_content=BusAnalysts+Englewood\"\u003ehttps://jobs.dish.com/jobs/53673?lang=en-us\u0026amp;iis=\u0026amp;iisn=\u0026amp;utm_source=GitHub\u0026amp;utm_medium=jobboard\u0026amp;utm_campaign=Wireless\u0026amp;utm_content=BusAnalysts+Englewood\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdjZiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4136af7ac56ba56e84892003668da36b72e9fe0f/DISH_WORDMARK_RED_LOGO_1115818_RGB_Newsroom.png"},{"id":"be53172d-1dba-407e-a9aa-202d0d1fc9c6","type":"Full Time","url":"https://jobs.github.com/positions/be53172d-1dba-407e-a9aa-202d0d1fc9c6","created_at":"Wed Mar 10 22:27:11 UTC 2021","company":"DISH","company_url":null,"location":"Englewood, CO","title":"Manager of Retail Wireless Technology Fraud Platform","description":"\u003cp\u003eDISH is transforming the future of connectivity. We’re doing it by building the country’s first virtualized, standalone 5G wireless network from scratch. The foundation of a connected world, it’s a network free of the limitations of the past, and flexible enough to satisfy all the social, economic and transformative needs of the changing world. Equipped with Boost Mobile and its 9 million customers as the newest part of the DISH brand, we’re setting our sights on competing in the prepaid and postpaid retail wireless market as the nation’s fourth facilities-based mobile carrier.\u003c/p\u003e\n\u003cp\u003eWe are driven by curiosity, pride, adventure, and a desire to win – it’s in our DNA. We’re looking for people with boundless energy, intelligence, and an overwhelming need to achieve to join our team as we embark on the next chapter of our story.\u003c/p\u003e\n\u003cp\u003eOpportunity is here. We are DISH.\u003c/p\u003e\n\u003cp\u003e#LI-HT1\u003c/p\u003e\n\u003cp\u003eHigh-level job responsibilities:\u003c/p\u003e\n\u003cp\u003eThe Manager of the Retail Wireless Fraud Platform is responsible for the systems that monitor for and remediate Subscription, Device and Usage Fraud.  This role will build and manage the team that analyzes, develops and maintains the technology platform.\u003c/p\u003e\n\u003cp\u003eThe primary goal of this role is to develop and maintain the Fraud systems across the retail wireless business. The position will manage the technical team building and maintaining the software platform.\u003c/p\u003e\n\u003cp\u003eDay-to-day job responsibilities:\u003c/p\u003e\n\u003cp\u003eDevelop and maintain platform to manage and remediate Fraud risk\nIntegration of new acquisitions or expanded product offerings into the platform\nManagement of product development and feature enhancements\nAgile workflows management and delivery of software development\nCoordination with other technical teams on cloud environments, data ingestion and management as well as integration with other operating platforms\nWork cross functionally with the core systems and ecommerce teams for integration point\nTechnical evaluation of the vendor products and services\nManagement of the SDLC\nEvaluation of product enhancements cost and value\u003c/p\u003e\n\u003cp\u003eHigh-level qualifications:\u003c/p\u003e\n\u003cp\u003eBA/BS in a technical discipline (information systems, engineering, computer science); and/or equivalent experience. Possess a highly motivated can-do-attitude. Proven track record building strong relationships. Passion for building great products, continuous improvement, agile software development and technology. Proven ability to learn quickly, adapt to frequently changing circumstances and take the ball and run with it.\u003c/p\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cp\u003eExperience leading and managing high performing teams\nExperience in managing complex system requirements\nExperience with wireless fraud systems and data integrations\n5+ years experience managing direct reports\n5+ years experience in Wireless and/or Telecom Industries\u003c/p\u003e\n\u003cp\u003eCompensation: $114,885.00/Yr. - $181,390.00/Yr.\nFrom versatile health perks to new career opportunities, this role provides all the benefits you need to be\u003c/p\u003e\n\u003cp\u003esuccessful. Check them out on our careers website.\u003c/p\u003e\n\u003cp\u003eSuccessful completion of a pre-employment screen, to include a drug test, criminal background check and Motor Vehicle Record.\u003c/p\u003e\n\u003cp\u003eDISH endeavors to make \u003ca href=\"http://careers.dish.com\"\u003ehttp://careers.dish.com\u003c/a\u003e accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact \u003ca href=\"mailto:accessibility@dish.com\"\u003eaccessibility@dish.com\u003c/a\u003e. This contact information is for accommodation requests only; you may not use this contact information to inquire about the status of applications.\u003c/p\u003e\n\u003cp\u003eWe pride ourselves on developing and promoting talent as an Equal Employment Opportunity Employer - Veteran/Disability. All qualified applicants will receive consideration for employment without regard to race, national origin, gender, age, religion, disability, veteran status, or any other category protected by law. We are a true merit-based organization and work hard so there are no artificial barriers to one's potential success. DISH is committed to a workforce where everyone's opportunities are limitless.\u003c/p\u003e\n\u003cp\u003eConsistent with this commitment, DISH will endeavor to provide reasonable accommodation to otherwise qualified job applicants and employees with known physical or mental disabilities, unless doing so poses an undue hardship on the Company, poses a direct threat of substantial harm to the employee or others, or is otherwise not required by law.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply online at \u003ca href=\"https://jobs.dish.com/jobs/54083?lang=en-us\u0026amp;iis=\u0026amp;iisn=\u0026amp;utm_source=GitHub\u0026amp;utm_medium=jobboard\u0026amp;utm_campaign=Wireless\u0026amp;utm_content=ManagerofRWTFP\"\u003ehttps://jobs.dish.com/jobs/54083?lang=en-us\u0026amp;iis=\u0026amp;iisn=\u0026amp;utm_source=GitHub\u0026amp;utm_medium=jobboard\u0026amp;utm_campaign=Wireless\u0026amp;utm_content=ManagerofRWTFP\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnliIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--62a00fc800b7eb6a234933865f264aa82b97ac42/DISH_WORDMARK_RED_LOGO_1115818_RGB_Newsroom.png"},{"id":"c21b9009-c7be-4e3d-9e11-1af64bd3bde5","type":"Full Time","url":"https://jobs.github.com/positions/c21b9009-c7be-4e3d-9e11-1af64bd3bde5","created_at":"Wed Mar 10 22:24:42 UTC 2021","company":"DISH Network","company_url":"http:","location":"Englewood, CO","title":"IT Manager, Wireless Settlements Systems","description":"\u003cp\u003eDISH is a Fortune 250 company with more than $14 billion in annual revenue that continues to redefine the communications industry. Our legacy is innovation and a willingness to challenge the status quo, including reinventing ourselves. We disrupted the pay-TV industry in the mid-90s with the launch of the DISH satellite TV service, taking on some of the largest U.S. corporations in the process, and grew to be the fourth-largest pay-TV provider. We are doing it again with the first live, internet-delivered TV service – Sling TV – that bucks traditional pay-TV norms and gives consumers a truly new way to access and watch television.\u003c/p\u003e\n\u003cp\u003eNow we have our sights set on upending the wireless industry and unseating the entrenched incumbent carriers.\u003c/p\u003e\n\u003cp\u003eWe are driven by curiosity, pride, adventure, and a desire to win – it’s in our DNA. We’re looking for people with boundless energy, intelligence, and an overwhelming need to achieve to join our team as we embark on the next chapter of our story.\u003c/p\u003e\n\u003cp\u003eOpportunity is here. We are DISH. #LI-HT1\u003c/p\u003e\n\u003cp\u003eIn this IT Manager, Wireless Settlements Systems position, you will be responsible for the systems that manage the wholesale network and other third party costs of DISH’s MVNO retail wireless business. As we build out our IT Retail Wireless Division, you will also have the exciting opportunity to establish a team of technical and non-technical professionals that will analyze, develop, and maintain our financial control systems.\u003c/p\u003e\n\u003cp\u003ePrimary responsibilities of this IT Manager position will fall into the following areas:\u003c/p\u003e\n\u003cp\u003eDevelop and maintain a platform to rate MVNO Network cost\nManage vendor relationship and resources on platform builds\nManage tight deadlines on complex deliverables to meet business needs\nEscalate issues appropriately with clear and concise root cause analysis and remediation recommendations\nIntegration of new acquisitions data records and rating elements\nMigration of customer base to MNO Roaming Agreements\nIngestion of additional rate/volume cost structures\nSupport Business Operating groups\nDeep understanding of wireless cost economics and  building them into system requirements and analytics\nA successful IT Manager, Wireless Settlements Systems will have the following:\u003c/p\u003e\n\u003cp\u003e7+ years’ experience leading and managing high performing teams, with a track record of successfully recruiting and developing talent\nExperience in managing complex system requirements\nExperience with wireless billing or settlements systems and analysis\n7+ years experience in Wireless and/or Telecom Industries\nMBA a plus\nCompensation: $85,905.00/Yr. - $136,190.00/Yr.\u003c/p\u003e\n\u003cp\u003eFrom versatile health perks to new career opportunities, check out our benefits on our careers website.\u003c/p\u003e\n\u003cp\u003eEmployment is contingent on successful completion of a pre-employment criminal background check, which may include a drug test.\u003c/p\u003e\n\u003cp\u003eDISH endeavors to make \u003ca href=\"http://careers.dish.com\"\u003ehttp://careers.dish.com\u003c/a\u003e accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact \u003ca href=\"mailto:accessibility@dish.com\"\u003eaccessibility@dish.com\u003c/a\u003e. This contact information is for accommodation requests only; you may not use this contact information to inquire about the status of applications.\u003c/p\u003e\n\u003cp\u003eWe pride ourselves on developing and promoting talent as an Equal Employment Opportunity Employer - Veteran/Disability. All qualified applicants will receive consideration for employment without regard to race, national origin, gender, age, religion, disability, veteran status, or any other category protected by law. We are a true merit-based organization and work hard so there are no artificial barriers to one's potential success. DISH is committed to a workforce where everyone's opportunities are limitless.\u003c/p\u003e\n\u003cp\u003eConsistent with this commitment, DISH will endeavor to provide reasonable accommodation to otherwise qualified job applicants and employees with known physical or mental disabilities, unless doing so poses an undue hardship on the Company, poses a direct threat of substantial harm to the employee or others, or is otherwise not required by law.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply online at \u003ca href=\"https://jobs.dish.com/jobs/52769?lang=en-us\u0026amp;iis=\u0026amp;iisn=\u0026amp;utm_source=GitHub\u0026amp;utm_medium=jobboard\u0026amp;utm_campaign=Wireless\u0026amp;utm_content=ITManager+Englewood\"\u003ehttps://jobs.dish.com/jobs/52769?lang=en-us\u0026amp;iis=\u0026amp;iisn=\u0026amp;utm_source=GitHub\u0026amp;utm_medium=jobboard\u0026amp;utm_campaign=Wireless\u0026amp;utm_content=ITManager+Englewood\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnFiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--af33a2ded1f6f3227ae65e1e87d2a65e809da5e4/DISH_WORDMARK_RED_LOGO_1115818_RGB_Newsroom.png"},{"id":"92bad97d-1afa-4290-88b9-8ed807a9ff8a","type":"Full Time","url":"https://jobs.github.com/positions/92bad97d-1afa-4290-88b9-8ed807a9ff8a","created_at":"Wed Mar 10 20:52:29 UTC 2021","company":"BlueVine","company_url":"https://www.bluevine.com/careers/","location":"Redwood City, CA","title":"Senior Full Stack Engineer","description":"\u003cp\u003eBlueVine is a high-growth fintech company empowering small businesses with innovative banking. By combining industry-leading technology and security with our team's expertise and care, we've helped 200,000+ businesses, funding more than $9 billion since 2013.\u003c/p\u003e\n\u003cp\u003eSmall businesses deserve accessible and modern financial services, and traditional banks have underserved them for too long. We're hiring problem solvers and collaborators to join our meaningful mission.\u003c/p\u003e\n\u003cp\u003eHeadquartered in Redwood City, CA, we've recently raised $102.5M and are backed by top investors, including Menlo Ventures, Lightspeed Ventures, Citi Ventures, SVB Financial, Nationwide Insurance, and M12.\u003c/p\u003e\n\u003cp\u003eOur Redwood City engineering team is building BlueVine’s new banking product that is driving our next phase of growth. The market we’re going after is huge, and we’re just getting started.\u003c/p\u003e\n\u003cp\u003eWe're looking for a Senior Full Stack Engineer flexible enough to develop features from the front (beautiful UX) to the back (scalable and robust components and integrations). If you're drawn to engineering challenges and have a strong desire to make a big impact as part of a small, agile team, in an exciting space, we’d love to talk to you.\u003c/p\u003e\n\u003cp\u003eWHAT YOU'LL DO:\u003c/p\u003e\n\u003cp\u003eFully own and independently drive the engineering development of complex features\nDesign and build state-of-the-art responsive banking applications\nProvide leadership and mentorship to teammates\nWork closely with, and incorporate feedback from product managers and other stakeholders in the company\nBe part of a fast-paced and highly-flexible team with the comfort of making decisions using your best judgement\nDevelop projects through their entire life cycle\nWHAT WE LOOK FOR:\u003c/p\u003e\n\u003cp\u003e5+ years of combined back and front end experience building fast, reliable, web and/or mobile applications (preferably with Python backends)\nExperience with Web frameworks (e.g., Angular, React, or Vue) and/or mobile development (e.g., Native, Native Script, React)\nExperience with source control management systems, preferably Git\nExperience with AWS, GPC, or Azure\nB.S. in Computer Science or a related field\nNice to have:\u003c/p\u003e\n\u003cp\u003eExperience with AWS, cloud deployments, DevOps, and web security\nBENEFITS \u0026amp; PERKS:\u003c/p\u003e\n\u003cp\u003eReceive over $1,000 annually for a wellness benefit of your choice\nMonthly WFH Stipend\nGenerous PTO and holidays\nExcellent health coverage and life insurance benefits\nGenerous, paid parental leave which covers up to 15 weeks\n401K with an immediate 3% company match\nOnce we Return to Office:\u003c/p\u003e\n\u003cp\u003eCommuter benefits - CalTrain passes for SF employees and a monthly parking allowance\nWeekly catered lunches\nUnlimited snacks in fully stocked kitchens\nPet-friendly HQ\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply with the link below\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://boards.greenhouse.io/bluevine/jobs/4189284003\"\u003ehttps://boards.greenhouse.io/bluevine/jobs/4189284003\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdmliIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3a892db6f9ce1bc0837a6831eff53bc2b885efec/bluevine-leaf-rgb.png"},{"id":"242d7658-0a4a-4d12-895f-f70a6eb88e10","type":"Full Time","url":"https://jobs.github.com/positions/242d7658-0a4a-4d12-895f-f70a6eb88e10","created_at":"Wed Mar 10 20:49:25 UTC 2021","company":"BlueVine","company_url":"https://www.bluevine.com/careers/","location":"Redwood City, CA","title":"Senior Python Developer","description":"\u003cp\u003eBlueVine is a high-growth fintech company empowering small businesses with innovative banking. By combining industry-leading technology and security with our team's expertise and care, we've helped 200,000+ businesses, funding more than $9 billion since 2013.\u003c/p\u003e\n\u003cp\u003eSmall businesses deserve accessible and modern financial services, and traditional banks have underserved them for too long. We're hiring problem solvers and collaborators to join our meaningful mission.\u003c/p\u003e\n\u003cp\u003eHeadquartered in Redwood City, CA, we've recently raised $102.5M and are backed by top investors, including Menlo Ventures, Lightspeed Ventures, Citi Ventures, SVB Financial, Nationwide Insurance, and M12.\u003c/p\u003e\n\u003cp\u003eOur Redwood City engineering team is building BlueVine’s new banking product that is driving our next phase of growth. The market we’re going after is huge, and we’re just getting started.\u003c/p\u003e\n\u003cp\u003eWe're looking for a Senior Full Stack Engineer flexible enough to develop features from the front (beautiful UX) to the back (scalable and robust components and integrations). If you're drawn to engineering challenges and have a strong desire to make a big impact as part of a small, agile team, in an exciting space, we’d love to talk to you.\u003c/p\u003e\n\u003cp\u003eWHAT YOU'LL DO:\u003c/p\u003e\n\u003cp\u003eFully own and independently drive the engineering development of complex features\nDesign and build state-of-the-art responsive banking applications\nProvide leadership and mentorship to teammates\nWork closely with, and incorporate feedback from product managers and other stakeholders in the company\nBe part of a fast-paced and highly-flexible team with the comfort of making decisions using your best judgement\nDevelop projects through their entire life cycle\nWHAT WE LOOK FOR:\u003c/p\u003e\n\u003cp\u003e5+ years of combined back and front end experience building fast, reliable, web and/or mobile applications (preferably with Python backends)\nExperience with Web frameworks (e.g., Angular, React, or Vue) and/or mobile development (e.g., Native, Native Script, React)\nExperience with source control management systems, preferably Git\nExperience with AWS, GPC, or Azure\nB.S. in Computer Science or a related field\nNice to have:\u003c/p\u003e\n\u003cp\u003eExperience with AWS, cloud deployments, DevOps, and web security\nBENEFITS \u0026amp; PERKS:\u003c/p\u003e\n\u003cp\u003eReceive over $1,000 annually for a wellness benefit of your choice\nMonthly WFH Stipend\nGenerous PTO and holidays\nExcellent health coverage and life insurance benefits\nGenerous, paid parental leave which covers up to 15 weeks\n401K with an immediate 3% company match\nOnce we Return to Office:\u003c/p\u003e\n\u003cp\u003eCommuter benefits - CalTrain passes for SF employees and a monthly parking allowance\nWeekly catered lunches\nUnlimited snacks in fully stocked kitchens\nPet-friendly HQ\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply via link below;\n\u003ca href=\"https://boards.greenhouse.io/bluevine/jobs/4189284003\"\u003ehttps://boards.greenhouse.io/bluevine/jobs/4189284003\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdmFiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ff732d86bdcc83ff9e68b0dbe72163020869f06e/bluevine-leaf-rgb.png"},{"id":"85f49b29-5845-4154-bf1a-5bf842419f1e","type":"Full Time","url":"https://jobs.github.com/positions/85f49b29-5845-4154-bf1a-5bf842419f1e","created_at":"Wed Mar 10 15:56:16 UTC 2021","company":"Wolfe.com LLC","company_url":"http://wolfe.com","location":"Pittsburgh Pa","title":"Senior DevOps Engineer","description":"\u003cp\u003eWe’re looking for a strong engineer to:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOwn the AWS infrastructure of our 3 core properties, including Dockerized ECS and more standard EC2 based systems, while working with a small team\u003c/li\u003e\n\u003cli\u003eLiason with our development teams, information security personnel, and card printing facility personnel to satisfy their various requirements\u003c/li\u003e\n\u003cli\u003eUnderstand and act as a backup for the infrastructure of a small manufacturing facility\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWolfe:\nWolfe, LLC is a successful e-commerce company in Pittsburgh, PA.  We are a high-performance fintech and online e-commerce company with a specialization on the $250 billion gift card market.  We formerly owned GiftCards.com and grew the largest online gift card site in the world before selling it in 2016.  We are re-building again under the new brands PerfectGift.com, GiftCardGranny.com and GiftYa.com and improving on what we built in the past.\nAll team members embody our cherished core values of integrity, drive, teamwork and caring.  Our achievements include the first coupon website in 1995 which sold to a public company in 2000 when we were delivering 20 million-page views per month at the peak of the dot-com era.  We then built Direct Response Technologies – grew to 70 employees and sold to Digital River in 2006.  We spun off Jambo Media with our tech team and sold it to Undertone in 2012.  We next built GiftCards.com to 100 employees and in 2016 sold it to (then NASDAQ:HAWK) Blackhawk Network.\nOur in-house and contact center teams are searching for the next top performing leader to help deliver world-class service for our consumer and corporate clients. We deliver an extremely attractive client value proposition in an industry of very few competitors.\nCompany and Executive Team Recognitions:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e2011 Best places to work in Pittsburgh Finalist\u003c/li\u003e\n\u003cli\u003e2011 Ernst \u0026amp; Young Entrepreneur of the Year Award Winner\u003c/li\u003e\n\u003cli\u003e2011 CFO of the Year Finalist\u003c/li\u003e\n\u003cli\u003e2011 CIO of the Year Finalist\u003c/li\u003e\n\u003cli\u003e2013 Governors Impact Award Winner\u003c/li\u003e\n\u003cli\u003e2014 Entreprenuer.com Nationwide Entrepreneur of the Year Finalist\u003c/li\u003e\n\u003cli\u003e2015 CEO of the Year Winner Pittsburgh Technology Council\u003c/li\u003e\n\u003cli\u003e2015 Create Award Winner for Marketing\u003c/li\u003e\n\u003cli\u003e2015 Business Times Diamond Award Winner\u003c/li\u003e\n\u003cli\u003e2015 Business Ethics Award Winner\u003c/li\u003e\n\u003cli\u003e2017 Outstanding Entrepreneur Award Winner by the Pittsburgh Venture Capital Association\u003c/li\u003e\n\u003cli\u003e2019 Carnegie Science Award Recipient, Entrepreneur Category\u003c/li\u003e\n\u003cli\u003e2020 Top 10 Best Places to Work by Pittsburgh Business Times\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe Opportunity\nWolfe’s infrastructure is hosted in AWS and is made up of several Dockerized and EC2 based services. We support multiple API layers, administration and partner portals, websites, native apps, and more. Additionally, we have a PCI certified card plastics printing facility located in Green Tree, PA.\nDuties\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHandle the management and ongoing maintenance requirements of multiple AWS accounts along as part of a small team\u003c/li\u003e\n\u003cli\u003eWorking with the property developers to migrate current EC2 workloads to ECS Fargate\u003c/li\u003e\n\u003cli\u003eSetting and implementing infrastructure standards\u003c/li\u003e\n\u003cli\u003eDocumentation, CI/CD, and monitoring\u003c/li\u003e\n\u003cli\u003eOn call rotation\u003c/li\u003e\n\u003cli\u003eYou’ll also be acting as a backup for the card printing facility infrastructure. This infrastructure is a PCI Card Production compliant network, utilizing similar technologies to our AWS properties.\no\tPlease note: This position is NOT geared toward general IT/Help Desk\nRequirements\u003c/li\u003e\n\u003cli\u003e3-5 years working with AWS, AWS Solutions Architect is a plus\u003c/li\u003e\n\u003cli\u003e3 years working with Linux\u003c/li\u003e\n\u003cli\u003e1 year docker experience\nTelosGifting Technology Stack\nThis is what powers our various properties. You don’t need direct experience in everything, but you’ll be working next to all of these technologies:\u003c/li\u003e\n\u003cli\u003eAWS ECS, EC2, RDS\u003c/li\u003e\n\u003cli\u003eMySQL, Redis, Rabbit\u003c/li\u003e\n\u003cli\u003eCloudflare\u003c/li\u003e\n\u003cli\u003eSumologic\u003c/li\u003e\n\u003cli\u003ePHP, Symfony\u003c/li\u003e\n\u003cli\u003eBitbucket Pipelines\u003c/li\u003e\n\u003cli\u003eAnsible, Terraform\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIdeal Skillset\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProven ability to plan projects, work independently, and liaison with technical and non-technical personnel\u003c/li\u003e\n\u003cli\u003eExperience with containerization, application monitoring, and performance evaluation\u003c/li\u003e\n\u003cli\u003eExperience with any modern web development framework (Rail/Django/Symfony/etc) is a plus\u003c/li\u003e\n\u003cli\u003eBasic security certifications and PCI experience are a plus\nCompensation \u0026amp; Benefits/Perks\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eCompensation includes a competitive base salary, incentives, plus participation in company sale proceeds (10-15% in total go to employees on sale or profit).\nWolfe, LLC is committed to providing its employees with a benefits package providing flexibility that ensures a healthy life/work balance.  The great benefits and perks, include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMedical, Prescription, Vision and Dental\u003c/li\u003e\n\u003cli\u003eGenerous Paid Time-Off policy\u003c/li\u003e\n\u003cli\u003eProfit-sharing (Incentive Stock Plan) our employees have earned over $16m through this program since 2006\u003c/li\u003e\n\u003cli\u003e11 holidays\u003c/li\u003e\n\u003cli\u003eTuition Reimbursement\u003c/li\u003e\n\u003cli\u003eEmployee Recognition Program\u003c/li\u003e\n\u003cli\u003eCharitable Donation to a Charity of YOUR Choice yearly ($250)\u003c/li\u003e\n\u003cli\u003eRefer Friends, and if we hire them you get awarded (up to $1,000)\u003c/li\u003e\n\u003cli\u003eFamily Picnic, Holiday Party, and other employee outings\u003c/li\u003e\n\u003cli\u003eOn-site dry-cleaning pick-up service\u003c/li\u003e\n\u003cli\u003eFlex-time Scheduling and a Telecommute Policy\u003c/li\u003e\n\u003cli\u003eNo cubicles, everyone gets a desk\u003c/li\u003e\n\u003cli\u003ePrivate Health Advisory Policy for Employee and Dependents\u003c/li\u003e\n\u003cli\u003eBrown bag sessions to keep you informed on the company/industry\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIf this position excites you, we urge you to apply!\nWolfe, LLC is an Equal Opportunity Employer.\nWolfe, LLC does not sponsor individuals for the purpose of obtaining H-1 Visas.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"mailto:jobs@wolfe.com\"\u003ejobs@wolfe.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdkdiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ad77badc79a2c42a15179df02e3b0387c666128f/wolfe.png"},{"id":"fbbecb42-2cb7-434c-b80b-0a9e906d1484","type":"Full Time","url":"https://jobs.github.com/positions/fbbecb42-2cb7-434c-b80b-0a9e906d1484","created_at":"Wed Mar 10 14:21:40 UTC 2021","company":"Prisma","company_url":"http://www.prisma.io","location":"Remote","title":"VP of Engineering","description":"\u003cp\u003eAt Prisma we are building the data layer for modern applications. If you are fascinated by the software that power large technology companies such as Twitter, Airbnb and Facebook but want the challenges, freedom and ownership of a young startup, then Prisma might be the right place for you.\u003c/p\u003e\n\u003cp\u003eDuring the course of the past year our bottom-up adoption strategy has started to produce very exciting results. We have seen highly encouraging levels of developer adoption and community growth, setting us on the path to become the dominant NodeJS ORM within 12 months.\u003c/p\u003e\n\u003cp\u003eThese results and feedback from our community enable us to start the next phase of our journey - building a commercial proof and strategy for Prisma. We have tens of thousands of developers currently using Prisma, with hundreds of thousands of NPM downloads per week. Some of these are large enterprises such as Accenture, Tryg, Algolia, Rapha and Microsoft.\u003c/p\u003e\n\u003cp\u003eTo help us with the above we are looking to bolster our engineering leadership at Prisma by hiring a VP of Engineering to lead our engineering teams through this transition and beyond.\u003c/p\u003e\n\u003ch3\u003eWhat would you do at Prisma?\u003c/h3\u003e\n\u003cp\u003eThe VP of Engineering will be responsible for managing the engineering teams, with all managers and teams reporting to them.\u003c/p\u003e\n\u003cp\u003eYour responsibilities as the VP of Engineering includes:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTake key responsibility for engineering teams to incrementally build and deliver value to users and customers.\u003c/li\u003e\n\u003cli\u003eCollaborate closely with major functions (product, marketing, design, operations) in the company to ensure engineering teams are working on the right things for the right reasons.\u003c/li\u003e\n\u003cli\u003eWork with the CEO to maintain and evolve the technical vision and strategy and the team structures to support them.\u003c/li\u003e\n\u003cli\u003eCreate and exemplifies a healthy and inclusive and inclusive work environment for engineering teams to work and participate in.\u003c/li\u003e\n\u003cli\u003eActively work to identify and remove bottlenecks within the organisation within Engineering and beyond.\u003c/li\u003e\n\u003cli\u003eKey technical focus of the role is debugging organisations and processes and to find solutions to make engineering teams more productive, effective, or unblocks them.\u003c/li\u003e\n\u003cli\u003eBuild and retain a diverse engineering team.\u003c/li\u003e\n\u003cli\u003eCreate hiring plans in line with organisational needs and budgets.\u003c/li\u003e\n\u003cli\u003eFocus the engineering teams on delivering features in line with Prisma's business, product, and engineering strategy.\u003c/li\u003e\n\u003cli\u003eEstablish, maintains and advocates the engineering culture within the engineering organisation and across Prisma.\u003c/li\u003e\n\u003cli\u003eEnsures that technical and architectural decisions across the engineering organisation are done within the frameworks and by bridging the technical with the business needs of the organisation.\u003c/li\u003e\n\u003cli\u003eImplement feedback, review, and promotion processes across the engineering organisations to help all people in their teams advance in their career and in accordance with the company framework.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eWhat are the requirements?\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003e5+ Years in Senior Engineering Management positions, comfortable with working in and building a remote-first team.\u003c/li\u003e\n\u003cli\u003eDeeply passionate about investing in people and growing them to become the best versions of themselves.\u003c/li\u003e\n\u003cli\u003eSuccessful track-record of building, retaining, and scaling an engineering team in a start-up or fast growing organisation.\u003c/li\u003e\n\u003cli\u003eStrong technical experience in modern technology stacks (our language is Rust but learning on the job is perfectly fine).\u003c/li\u003e\n\u003cli\u003eExperience working in a Developer Tools company would be a benefit, but not a hard requirement.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eWhat's it like to work at Prisma?\u003c/h3\u003e\n\u003cp\u003eYou're likely to be a great fit for the team if you ...\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003e... have an ownership mindset.\u003c/strong\u003e As part of a young startup and as the VP of Engineering, you'll have an outsize impact on decisions and the way things are executed. This will include influence over the direction of the company, hiring plans, budget and more.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003e... stay nimble.\u003c/strong\u003e As a growing startup, the team and strategy evolves quickly. Be ready to re-calibrate often and stay flexible.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003e... be kind and collaborative.\u003c/strong\u003e Come in ready to share your ideas and listen to feedback.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eWhat's in it for you?\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003eOpportunity for large global impact working on one of the fastest growing open-source tools and help guide the team on it's new commercial journey.\u003c/li\u003e\n\u003cli\u003eHave the opportunity to own Engineering at Prisma and build out the team to take the department and company forward.\u003c/li\u003e\n\u003cli\u003eWork in full-distributed, remote-first organisation where work-life balance is celebrated and promoted.\u003c/li\u003e\n\u003cli\u003eWe provide a \u003cstrong\u003eCompetitive Base Salary\u003c/strong\u003e in line with industry standards for similar positions.\u003c/li\u003e\n\u003cli\u003eAs an early-stage startup we also provide competitive \u003cstrong\u003eStock-Option Grants.\u003c/strong\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003e24 Days paid vacation\u003c/strong\u003e per year.\u003c/li\u003e\n\u003cli\u003e[US] Health, Dental, Vision + 401k Matching\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eGenerous Tech Budget\u003c/strong\u003e to make sure you have all the hardware that you need.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch3\u003eRemote Work\u003c/h3\u003e\n\u003cp\u003eWe are a remote-first organisation with an office based in Berlin, Germany. Whether you would like to work remotely, or from the office in Berlin is up to you! We are open to discussing relocation assistance if you would like to join us in Berlin.\u003c/p\u003e\n\u003cp\u003eAlthough we are a fully remote and distributed team, for operational reasons we can currently only consider candidates that currently live, or intend to move to the timezone GMT -8 to GMT +3.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eNote on COVID-19:\u003c/em\u003e The above opportunity to move to Berlin is temporarily suspended until we believe that travel is safe again.\u003c/p\u003e\n\u003ch3\u003eWhat is our hiring process like?\u003c/h3\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cem\u003eIntroductory Call\u003c/em\u003e with someone from the Talent Acquisition team.\u003c/li\u003e\n\u003cli\u003e\n\u003cem\u003eFirst Interview\u003c/em\u003e with the VP of Product\u003c/li\u003e\n\u003cli\u003e\n\u003cem\u003eSecond Interview with the\u003c/em\u003e VP of Design\u003c/li\u003e\n\u003cli\u003e\n\u003cem\u003eRound of Interviews\u003c/em\u003e with some of the Engineers at Prisma that you will be working with.\u003c/li\u003e\n\u003cli\u003e\n\u003cem\u003eRound of Interviews with the\u003c/em\u003e Leadership Team\u003c/li\u003e\n\u003cli\u003e\n\u003cem\u003eFinal Interview\u003c/em\u003e with the CEO.\u003c/li\u003e\n\u003cli\u003e\u003cem\u003eOffer\u003c/em\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe above serves as a basic outline, we might choose to add or remove steps based on the information that we gather during the process.\u003c/p\u003e\n\u003cp\u003eIf you believe that this is the right position for you then please send your resume along with any supporting documentation or information to us via the link provided on this page. We typically respond within 7 business days.\u003c/p\u003e\n\n\u003cp\u003e\u003cem\u003ePrisma is an equal opportunity employer and does not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, gender identity, age, marital status, veteran status, or disability status.\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease visit the job page and apply: \u003ca href=\"https://grnh.se/7a75739f2us\"\u003ehttps://grnh.se/7a75739f2us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdTZiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d57d176d931d2b968a2328557ed8b31b4a00346c/Square%20Logo%20Small%20Prisma.png"},{"id":"35de12a3-33bb-494a-abee-e35217e246b7","type":"Full Time","url":"https://jobs.github.com/positions/35de12a3-33bb-494a-abee-e35217e246b7","created_at":"Wed Mar 10 09:56:56 UTC 2021","company":"SYNAOS GmbH","company_url":"https://synaos.com/","location":"Hannover","title":"(Senior) Backend Developer (m/f/d)","description":"\u003cp\u003eSYNAOS is a software start-up founded in 2018 in Hanover. We develop an ecosystem for the orchestration of intralogistics with a focus on autonomous, mobile robotics.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe offer\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFast growing, top financed start-up with highly motivated and extremely ambitious colleagues\u003c/li\u003e\n\u003cli\u003eChallenging tasks in developing our software platform with cutting-edge AI optimization methods and modern, scalable cloud technologies for autonomous robotics applications\u003c/li\u003e\n\u003cli\u003ePioneering work in intralogistics for the factory and logistics centre of the future\u003c/li\u003e\n\u003cli\u003eWith Volkswagen a DAX group as a first customer\u003c/li\u003e\n\u003cli\u003eCreative working environment with short decision-making processes (founders in the same office)\u003c/li\u003e\n\u003cli\u003eBright, newly designed offices in the heart of Hannover and good coffee from a sieving machine :)\u003c/li\u003e\n\u003cli\u003eChoice of hardware and operating system\u003c/li\u003e\n\u003cli\u003eUnlimited employment contracts and 30 vacation days\u003c/li\u003e\n\u003cli\u003eFlexible working hours with home office\u003c/li\u003e\n\u003cli\u003eCompetitive salaries and a development budget of 1.200 Euro per year\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour mission\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCreation of an enterprise-capable and integrated SYNAOS ecosystem based on Java to control production and logistics\u003c/li\u003e\n\u003cli\u003eIntegration of different technologies and systems in the backend environment\u003c/li\u003e\n\u003cli\u003eImplementation of agile software development (cooperation in SCRUM-teams, description of technical tasks and realization of user stories, automatic testing)\u003c/li\u003e\n\u003cli\u003eUse of technologies and tools like IntelliJ, GitLab, Jira, Java, Spring Boot, Kafka, Maven, REST, Messaging, PostgreSQL, Docker, AWS\u003c/li\u003e\n\u003cli\u003eEnthusiastic team orientation and good communication with developers, product owners and users of the software\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour Values\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStructured working (clean code)\u003c/li\u003e\n\u003cli\u003eOpen-minded for new technologies\u003c/li\u003e\n\u003cli\u003eCustomer focus\u003c/li\u003e\n\u003cli\u003eTeamwork\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you bring\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAbilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSeveral years of experience in backend development, Java Enterprise environment or several years of professional experience in another object-oriented programming language\u003c/li\u003e\n\u003cli\u003eProgramming and recording in English\u003c/li\u003e\n\u003cli\u003eExperience in developing software in a team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePersonality\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eReliability, Independence\u003c/li\u003e\n\u003cli\u003eSolution orientation\u003c/li\u003e\n\u003cli\u003e„Get things done“ attitude\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAttitude, values\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCommunication and capacity for teamwork\u003c/li\u003e\n\u003cli\u003eUnderstanding software as craftmanship\u003c/li\u003e\n\u003cli\u003eStructured working method\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eContact person:\u003c/p\u003e\n\u003cp\u003eSYNAOS GmbH\nFrank Löffler\n+49 172 7617662\n\u003ca href=\"mailto:join-us@synaos.com\"\u003ejoin-us@synaos.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/bc7582304a923aaed5f57a6382fa234856019ceb/68747470733a2f2f742e676f686972696e672e636f6d2f682f32363763393035386564666439356439356164356233626539393438376661613930306635353630613739373437386432613731633838616437346161616436\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/f64e42e383577c5f71d53130e6b2273cc493ed782dc72140377c76d89b2cd0ed\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdXFiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--945d567a97e1387089a82789249c415e8735a528/SYNAOS%20GmbH.jpg"},{"id":"03f4b538-8cd2-44f9-b07d-9bad6021eba4","type":"Full Time","url":"https://jobs.github.com/positions/03f4b538-8cd2-44f9-b07d-9bad6021eba4","created_at":"Wed Mar 10 09:44:07 UTC 2021","company":"Price Intelligence GmbH","company_url":"https://priceintelligence.net","location":"Remote","title":"Team Lead Development (M/W/D)​ E-Commerce-SaaS-Solution","description":"\u003cp\u003eReinvent Retail Business with us!\u003c/p\u003e\n\u003cp\u003eTag für Tag erfinden wir bei priceintelligence Retail Business neu, mit der Power von Künstlicher Intelligenz, Automatisierung und vor allem Daten. Um unsere Ziele zu erreichen, suchen wir Kollegen, die uns genau dabei helfen. Denkst du, dass du zu uns perfekt passt? Dann werde Teil unseres Teams...\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDas erwartet dich bei uns:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu übernimmst die fachliche und disziplinarische Führung eines 11-köpfigen Teams, bestehendaus erfahrenen Java-Entwicklern\u003c/li\u003e\n\u003cli\u003eDu steuerst die Aktivitäten rund um die Implementierung der Enterprise-SaaS-Lösungpriceintellingence und stimmst die Weiterentwicklungspläne mit unterschiedlichen Stakeholdern wie Product Owner, Kunden, Vertrieb sowie Geschäftsführung in Bezug auf die Lösungsarchitektur ab\u003c/li\u003e\n\u003cli\u003eDu verantwortest die strategische und langfristige Planung unserer Technologie-Stacks\u003c/li\u003e\n\u003cli\u003eDu gibst strategischen Input zur Produktweiterentwicklung\u003c/li\u003e\n\u003cli\u003eDu untersützt Onboarding-Projekte für Neukunden in Bezug auf die technische Integration\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDas bringst du mit:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu hast mindestens 5 Jahre Berufserfahrung als Developer\u003c/li\u003e\n\u003cli\u003eDu bringst mindestens 1 bis 2 Jahre Erfahrungen in der Leitung eines Temas mit\u003c/li\u003e\n\u003cli\u003eDu besitzt Kenntnisse in modernen SaaS-/Cloud-Architekturen und Entwicklungswerkzeuge, wie Java, Java Script, Hibernate, NoSQL, MQ\u003c/li\u003e\n\u003cli\u003eIdealerweise hast du auch schon erste Erfahrungen und Knowhow im Bereich SaaS, E-Commerce und Machine Learning / Data Science / Data Analytics\u003c/li\u003e\n\u003cli\u003eDu hast Erfahrung mit großen Datenmengen und deren Transfer\u003c/li\u003e\n\u003cli\u003eZu deinen Stärken zählt ein hohes Qualitäts- und Verantwortungsbewusstsein\u003c/li\u003e\n\u003cli\u003eDu bist offen, kommunikativ und ein echter Teamplayer\u003c/li\u003e\n\u003cli\u003eSehr gute Deutsch- und gute Englischkenntnisse runden dein Profil ab\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDas bieten wir dir:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEin erfolgreiches und hoch motiviertes internationales Team\u003c/li\u003e\n\u003cli\u003eGroßartige, zukunftsweisende Projekte bei internationalen und bekannten Kunden im Enterprise Segment\u003c/li\u003e\n\u003cli\u003eExzellente Weiterentwicklungsmöglichkeiten in einem schnell wachsenden, modernem Unternehmen mit tollen Konditionen und mit der Möglichkeit zukünftig eine tragende Rolle im Management- oder auch Gesellschafter-Team einzunehmen\u003c/li\u003e\n\u003cli\u003eZusammenarbeit mit Experten in einer flachen Hierarchie und kurze Kommunikationswege\u003c/li\u003e\n\u003cli\u003ePersönlicher Freiraum und die Möglichkeit Verantwortung zu übernehmen, deine eigenen Ideen zu teilen und umzusetzen\u003c/li\u003e\n\u003cli\u003eWork-Life-Balance, flexible Arbeitszeitmodelle und variable, Remote-Arbeitsorte\nEinfach mehr als nur ein Job!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDu verlierst nie das Detail aus dem Auge? Hast immer das Große und Ganze im Blick? Du beherrschst die Sprache der Softwareentwickler? Du bist auf der Suche nach einem jungen, agilen und dynamischen Arbeitsumfeld, das du innovativ mitgestalten möchtest? Dann bist du bei uns genau richtig! Starte durch mit priceintelligence und bewirb dich jetzt!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://priceintelligence.join.com/jobs/1964922-team-lead-development-m-w-d-e-commerce-saas-solution?pid=357a3b4531918760973f\u0026amp;oid=fe47f14d-ae44-49dd-947a-6d8bc6b023bd\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=team%2Blead%2Bdevelopment%2Bm%2Bw%2Bd%2Be-commerce-saas-solution\"\u003ehttps://priceintelligence.join.com/jobs/1964922-team-lead-development-m-w-d-e-commerce-saas-solution?pid=357a3b4531918760973f\u0026amp;oid=fe47f14d-ae44-49dd-947a-6d8bc6b023bd\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=team%2Blead%2Bdevelopment%2Bm%2Bw%2Bd%2Be-commerce-saas-solution\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdWliIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f483fa601ced49443e816247be425def85b87a5d/priceintelligence.jpg"},{"id":"5aaa160f-bdcf-44f9-b997-14c6fad9e22f","type":"Full Time","url":"https://jobs.github.com/positions/5aaa160f-bdcf-44f9-b997-14c6fad9e22f","created_at":"Tue Mar 09 23:53:49 UTC 2021","company":"City and County of San Francisco","company_url":null,"location":"San Francisco, CA, USA","title":"IS Business Analyst","description":"\u003cp\u003eWHO WE ARE\nThe Human Services Agency (HSA) is a department of the City and County of San Francisco and the central resource for public assistance in the City. Our mission is to promote well-being and self-sufficiency among individuals, families, and communities in San Francisco. HSA was formed in 2004 with the merger of two previously existing city departments, the Department of Human Services and the Department of Aging and Adult Services. The agency retains two commissions and two department heads. The agency also includes the Office of Early Care and Education. Our mission is to promote well-being and self-sufficiency among individuals, families, and communities in San Francisco.\u003c/p\u003e\n\u003cp\u003eWHAT WE DO\u003c/p\u003e\n\u003cp\u003eWe provide a safety net for individuals and families by offering income support, community-based living supports, and assistance getting food, housing, and health coverage. We offer programs and services that ensure the protection and safety of children, the elderly, and dependent adults. We help people secure employment through training, job search, and child care assistance.\u003c/p\u003e\n\u003cp\u003ePOSITION DESCRIPTION\u003c/p\u003e\n\u003cp\u003eUnder general direction, the IS Business Analyst participates in the systems development lifecycle, including project planning and management, as well as business process redesign. Specifically, the incumbent will be responsible for managing or assisting with the management of web and / or mobile development projects. The incumbent will collaborate with select programs to identify business needs and business processes that will either be introduced or modified for their assigned projects. The process for gathering and documenting requirements, translating requirements to functional requirements, and application testing are core responsibilities of the IS Business Analyst.  The individual will also be responsible for coordinating system implementations, managing user acceptance testing, system testing, end-user training, production support, and performing other related duties as assigned.\u003c/p\u003e\n\u003cp\u003eESSENTIAL DUTIES\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIdentify opportunities for improving business processes through automation; assist in the preparation of proposals to develop new systems.\u003c/li\u003e\n\u003cli\u003eAnalyze data processing needs; research and evaluate software on multiple platforms to assist users to meet their departmental goals; assist in developing the evaluation criteria for software.\u003c/li\u003e\n\u003cli\u003eDetermine operating characteristics and requirements; develop or modify and document general system design; write detailed design specifications including requirements documents, functional specifications, and test cases; conduct \"walkthroughs\" for proposed solutions to system problems.\u003c/li\u003e\n\u003cli\u003eAnalyze the feasibility of and develop requirements for new systems and enhancements to existing systems; ensure the system design fits the needs of the users.\u003c/li\u003e\n\u003cli\u003eInstall and enhance software; program, test, debug and install new/modified programs.\u003c/li\u003e\n\u003cli\u003eProvide technical support for web application and mobile application systems; consult on the analysis of an application; troubleshoot system problems; assist with the implementation of solutions.\u003c/li\u003e\n\u003cli\u003eConduct system analysis and may conduct programming activities for complex systems; document new and modified systems and programs; coordinate user training in new capabilities; may assist with the conversion of new programming from test to production.\u003c/li\u003e\n\u003cli\u003eInterface with users to determine system needs and requirements; instruct users on newly implemented systems; define system requirements; may design and code programs; review the impact of system modifications on existing systems.\u003c/li\u003e\n\u003cli\u003ePrepare, or assist client in preparing, service requests to implement system changes; determine, or assist in determining, level of effort required and the cost of implementing service requests; assist in prioritizing requests.\u003c/li\u003e\n\u003cli\u003eMay provide technical production support for application systems; assist with processing schedule, assist with creating reports.\u003c/li\u003e\n\u003cli\u003eDetermine security levels for systems to ensure data integrity.\nCreate test scenarios, test cases, UAT scripts, and other testing documentation to assist with testing. Test applications to assure functionality and effectiveness in performing to desired specifications.\u003c/li\u003e\n\u003cli\u003eAnalyze the impact of technical solutions and technical processes on business processes; document current and future processes impacted by system/solution design.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMINIMUM QUALIFICATIONS\nEDUCATION\u003c/p\u003e\n\u003cp\u003eAn associate degree in computer science or a closely related field from an accredited college or university OR its equivalent in terms of total course credits/units [i.e., at least sixty (60) semester or ninety (90) quarter credits/units with a minimum of twenty (20) semester or thirty (30) quarter credits/units in computer science or a closely-related field].\nAND\u003c/p\u003e\n\u003cp\u003eEXPERIENCE\u003c/p\u003e\n\u003cp\u003eOne (1) year in the information systems field, including technical support, content management, administration of network applications or system analysis.\u003c/p\u003e\n\u003cp\u003eSUBSTITUTION\u003c/p\u003e\n\u003cp\u003eAdditional experience as described above may be substituted for the required degree on a year-for-year basis (up to a maximum of two (2) years). One (1) year is equivalent to thirty (30) semester units / forty-five (45) quarter units with a minimum of 10 semester / 15 quarter units in computer science or a closely related field.\u003c/p\u003e\n\u003cp\u003eSPECIAL CONDITIONS:\nIn addition to the Minimum Qualifications above, applicants must have the following experience in order to qualify:\u003c/p\u003e\n\u003cp\u003eThe below minimum qualifications reflect special conditions associated with the position(s) to be filled. They may differ from the standard minimum qualifications associated with this classification.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOne (1) year of recent and verifiable experience in web applications analysis, design, and development.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAND\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOne (1) year of recent and verifiable experience in information system business process design.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eExperience under minimum qualifications and under special conditions #1 and #2 above can be gained concurrently.\u003c/p\u003e\n\u003cp\u003eDESIRABLE QUALIFICATIONS:\u003c/p\u003e\n\u003cp\u003eThe stated desirable qualifications may be used to identify job finalists at the end of the selection\nprocess when candidates are referred for hiring.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience successfully managing projects.\u003c/li\u003e\n\u003cli\u003eExperience working in a public sector, non-profit agency or organization.\u003c/li\u003e\n\u003cli\u003eWorking knowledge of Microsoft Visio Software.\u003c/li\u003e\n\u003cli\u003eWorking knowledge of Balsamiq mockup tool.\u003c/li\u003e\n\u003cli\u003eExperience with creating swim lane diagrams.\u003c/li\u003e\n\u003cli\u003eExperience with creating business and system flow diagrams.\u003c/li\u003e\n\u003cli\u003eQuality Assurance testing experience.\u003c/li\u003e\n\u003cli\u003eExperience writing diagnostic (Select) queries in Microsoft SQL or other structured query languages.\n**Applicants must meet the Minimum Qualification requirements by the final filing date unless otherwise noted. **\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eHOW TO APPLY:\nApplications for City and County of San Francisco jobs are only accepted through an online process.\nVisit:  [https://www.jobapscloud.com/SF/sup/bulpreview.asp?R1=PBT\u0026amp;R2=1052\u0026amp;R3=108424] to register an account and to view this complete job announcement for application submission requirements.\nRecruitment #PBT-1052-108424\nEOE\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease follow this link to apply: \u003ca href=\"https://www.jobapscloud.com/SF/sup/bulpreview.asp?R1=PBT\u0026amp;R2=1052\u0026amp;R3=108424\"\u003ehttps://www.jobapscloud.com/SF/sup/bulpreview.asp?R1=PBT\u0026amp;R2=1052\u0026amp;R3=108424\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"6e597f81-3cbb-46d6-b8d9-89c9b6a34f0f","type":"Full Time","url":"https://jobs.github.com/positions/6e597f81-3cbb-46d6-b8d9-89c9b6a34f0f","created_at":"Tue Mar 09 23:47:52 UTC 2021","company":"DISH","company_url":"http:","location":"Englewood, CO","title":"Senior Technical Product Owner","description":"\u003cp\u003eAt DISH, our Retail Wireless Integration teams challenge the status quo and reimagine capabilities across industries. From e-commerce platform to other BSS and OSS systems, to big data and beyond, our team play vital roles in connecting consumers with the products and platforms of tomorrow. We are looking for highly motivated and driven product owners to lead our development integration teams in delivering world class software for our 5G Network.\u003c/p\u003e\n\u003cp\u003eThis role will collaborate cross-functionally with the PMO, the architecture team, Business Analysts, and other software application SMEs and teams at Dish to deliver API integration across BSS, OSS and 3rd party vendors. The ideal candidate is experienced in implementing modern cloud-based platforms and tools, has an entrepreneurial mindset, strong communication skills, and excellent critical thinking skills. In this role:\u003c/p\u003e\n\u003cp\u003eLeading the other product owners in the team with a thorough understanding of the product and utilize high-level perspective to define goals and create a vision for development projects.\nResponsible for ensuring that the product’s vision is aligned with business goals.\nResponsible for gaining buy-in from stakeholders on all major decisions and strategy regarding product functionality and process.\nResponsible for iteration planning and subsequently working with the development team to identify and breakdown the tasks required for the iterations while providing clear instructions and deliverables.\nAbility to manage, organize, communicate and track sprint and project releases.\nResponsible for projects’ success: on time, on budget, meeting team members’ expectation, and meeting projects’ goals.\nConsider the organization impact of decisions made regarding service interface and data modeling\nProvide on-the-job training in service for the product owners of other teams.\u003c/p\u003e\n\u003cp\u003eDay-to-day job responsibilities\u003c/p\u003e\n\u003cp\u003eCoordinating with the Scrum Master to facilitate and/or participate in the necessary Scrum ceremonies, possibly including Sprint Planning, Daily Scrums, Sprint Review, Sprint Demo, and Sprint Retrospective\nAct as the liaison between engineering teams and product stakeholders\nEvangelize your product vision and roadmap across to gather feedback and drive better cross-company transparency and alignment\nDecomposing product and service features into workable user stories\nContinually prioritizing and grooming product backlogs for cross-functional, full-stack integration teams. Liaison between requests for new functionality and development team.\nCoordinating cross-team delivery, managing dependencies, and defining best practices\nSharing and evangelizing the work completed, product backlog, and Scrum team metrics.\u003c/p\u003e\n\u003cp\u003e#LI-AJ1\u003c/p\u003e\n\u003cp\u003eSpecific qualifications:\u003c/p\u003e\n\u003cp\u003e10+ years of enterprise product ownership experience\n8+ years of enterprise experience in determining and documenting requirements\n5+ years of enterprise software/API integration experience\nTechnical knowledge of data models and data management\nGood knowledge of OpenAPI specifications\nAbility of performing troubleshooting assistance\nMust have experience working with offshore teams\nWireless retail experience a big plus\nAWS or other Cloud experience a plus\nApigee experience a plus\nJava, SpringBoot, Node.js development experience a plus\nFrom versatile health perks to new career opportunities, check out our benefits on our careers website.\u003c/p\u003e\n\u003cp\u003eEmployment is contingent on successful completion of a pre-employment criminal background check, which may include a drug test.\u003c/p\u003e\n\u003cp\u003eDISH endeavors to make \u003ca href=\"http://careers.dish.com\"\u003ehttp://careers.dish.com\u003c/a\u003e accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact \u003ca href=\"mailto:accessibility@dish.com\"\u003eaccessibility@dish.com\u003c/a\u003e. This contact information is for accommodation requests only; you may not use this contact information to inquire about the status of applications.\u003c/p\u003e\n\u003cp\u003eWe pride ourselves on developing and promoting talent as an Equal Employment Opportunity Employer - Veteran/Disability. All qualified applicants will receive consideration for employment without regard to race, national origin, gender, age, religion, disability, veteran status, or any other category protected by law. We are a true merit-based organization and work hard so there are no artificial barriers to one's potential success. DISH is committed to a workforce where everyone's opportunities are limitless.\u003c/p\u003e\n\u003cp\u003eConsistent with this commitment, DISH will endeavor to provide reasonable accommodation to otherwise qualified job applicants and employees with known physical or mental disabilities, unless doing so poses an undue hardship on the Company, poses a direct threat of substantial harm to the employee or others, or is otherwise not required by law.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply online at \u003ca href=\"https://jobs.dish.com/jobs/54080?lang=en-us\u0026amp;iis=\u0026amp;iisn=\u0026amp;utm_source=GitHub\u0026amp;utm_medium=jobboard\u0026amp;utm_campaign=Wireless\u0026amp;utm_content=STPO+Englewood\"\u003ehttps://jobs.dish.com/jobs/54080?lang=en-us\u0026amp;iis=\u0026amp;iisn=\u0026amp;utm_source=GitHub\u0026amp;utm_medium=jobboard\u0026amp;utm_campaign=Wireless\u0026amp;utm_content=STPO+Englewood\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdU9iIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--66ae4c0a6fb1058015a93d4bb035ec9802bf4c4c/DISH_WORDMARK_RED_LOGO_1115818_RGB_Newsroom.png"},{"id":"95ad4dcc-2d1c-481e-b6f2-930d5eda70f4","type":"Full Time","url":"https://jobs.github.com/positions/95ad4dcc-2d1c-481e-b6f2-930d5eda70f4","created_at":"Tue Mar 09 23:45:39 UTC 2021","company":"DISH","company_url":"http:","location":"Englewood, CO","title":"Software Developer in Test (SDET)","description":"\u003cp\u003eAt DISH, our technology teams challenge the status quo and reimagine capabilities across industries. From product development to software design to big data and beyond, our people play vital roles in connecting consumers with the products and platforms of tomorrow.\u003c/p\u003e\n\u003cp\u003e#LI-HT1\u003c/p\u003e\n\u003cp\u003eHigh-level job responsibilities:\u003c/p\u003e\n\u003cp\u003eDISH Wireless is looking for a Software Developer Engineer in Test to support its products and services through agile software development in DGC, CO. In this role:\u003c/p\u003e\n\u003cp\u003eDeveloping innovative approaches, techniques, and solutions in the areas of Automation, Performance Engineering, Continuous Testing, Continuous Delivery, Service Virtualization, Shift Left, BDD, TDD, etc.\nAnalyzing how systems are being tested manually and identifying opportunities to reduce that time and effort through Automation\u003c/p\u003e\n\u003cp\u003eDay-to-day job responsibilities\u003c/p\u003e\n\u003cp\u003eDesigning and creating robust automated test scripts and software to address business and technical use cases.\nMaintaining, supporting and extending our existing automation framework and automation suite, and development of greenfield testing frameworks.\nCollaborating with Software Engineering Leaders, Project Managers, Product Managers, and others to ensure smooth integration of Quality Engineering solutions into the SDLC (Agile preferred)\nResearching and staying up to date on the latest tools, technologies, trends, and approaches within the QE space and incorporating the ones that make sense.\nParticipating in troubleshooting and triaging of issues with different teams to drive towards root cause identification and resolution\nParticipating in design and code reviews, refactor code as needed to meet evolving design standards, participate in or lead engineering process improvements.\nHigh-level qualifications:\u003c/p\u003e\n\u003cp\u003eA strong passion for quality, high level of attention to detail, and the proven ability to solve complex technical challenges\nExtensive experience applying Quality Engineering techniques across the SDLC to improve the quality of systems and enable the ability to deliver quality at speed.\nA Bachelor’s degree in Computer Science, Information Technology, or equivalent\nWireless communications industry experience (T-mobile, Verizon, AT\u0026amp;T, Cricket etc.) ideal but not required\u003c/p\u003e\n\u003cp\u003eSpecific qualifications:\u003c/p\u003e\n\u003cp\u003eA minimum of 4 years of diverse experience designing, developing, and implementing Test Automation solutions across a variety of platforms and applications.\nExperience with CI/CD pipeline engineering and maintenance using tools like: Gitlab CI, Jenkins, Cirlce CI, Travis CI, etc.\nExperience testing REST APIs\nExperience testing an exterprise product catalog is a plus\nExperience with XML and JSON\nAWS experience\nKnowledge of Agile progress and best practices (Kanban, Scrum)\nCompensation: $85,905.00/Yr. - $136,190.00/Yr.\u003c/p\u003e\n\u003cp\u003eFrom versatile health perks to new career opportunities, check out our benefits on our careers website.\u003c/p\u003e\n\u003cp\u003eEmployment is contingent on successful completion of a pre-employment criminal background check, which may include a drug test.\u003c/p\u003e\n\u003cp\u003eDISH endeavors to make \u003ca href=\"http://careers.dish.com\"\u003ehttp://careers.dish.com\u003c/a\u003e accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact \u003ca href=\"mailto:accessibility@dish.com\"\u003eaccessibility@dish.com\u003c/a\u003e. This contact information is for accommodation requests only; you may not use this contact information to inquire about the status of applications.\u003c/p\u003e\n\u003cp\u003eWe pride ourselves on developing and promoting talent as an Equal Employment Opportunity Employer - Veteran/Disability. All qualified applicants will receive consideration for employment without regard to race, national origin, gender, age, religion, disability, veteran status, or any other category protected by law. We are a true merit-based organization and work hard so there are no artificial barriers to one's potential success. DISH is committed to a workforce where everyone's opportunities are limitless.\u003c/p\u003e\n\u003cp\u003eConsistent with this commitment, DISH will endeavor to provide reasonable accommodation to otherwise qualified job applicants and employees with known physical or mental disabilities, unless doing so poses an undue hardship on the Company, poses a direct threat of substantial harm to the employee or others, or is otherwise not required by law.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply online at \u003ca href=\"https://jobs.dish.com/jobs/54059?lang=en-us\u0026amp;iis=\u0026amp;iisn=\u0026amp;utm_source=GitHub\u0026amp;utm_medium=jobboard\u0026amp;utm_campaign=Wireless\u0026amp;utm_content=SD+Test\"\u003ehttps://jobs.dish.com/jobs/54059?lang=en-us\u0026amp;iis=\u0026amp;iisn=\u0026amp;utm_source=GitHub\u0026amp;utm_medium=jobboard\u0026amp;utm_campaign=Wireless\u0026amp;utm_content=SD+Test\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUdiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4b176a61bbeaf1b81cedaed55ac3eff5abc3138e/DISH_WORDMARK_RED_LOGO_1115818_RGB_Newsroom.png"},{"id":"ab56aad0-a749-4eb4-850c-0c05c54dbe8f","type":"Full Time","url":"https://jobs.github.com/positions/ab56aad0-a749-4eb4-850c-0c05c54dbe8f","created_at":"Tue Mar 09 23:42:32 UTC 2021","company":"DISH","company_url":"http:","location":"Englewood, CO","title":"Data Analyst - Retail Wireless","description":"\u003cp\u003eDISH is a Fortune 250 company with more than $14 billion in annual revenue that continues to redefine the communications industry. Our legacy is innovation and a willingness to challenge the status quo, including reinventing ourselves. We disrupted the pay-TV industry in the mid-90s with the launch of the DISH satellite TV service, taking on some of the largest U.S. corporations in the process, and grew to be the fourth-largest pay-TV provider. We are doing it again with the first live, internet-delivered TV service – Sling TV – that bucks traditional pay-TV norms and gives consumers a truly new way to access and watch television.\u003c/p\u003e\n\u003cp\u003eNow we have our sights set on upending the wireless industry and unseating the entrenched incumbent carriers. We are driven by curiosity, pride, adventure, and a desire to win – it’s in our DNA. We’re looking for people with boundless energy, intelligence, and an overwhelming need to achieve to join our team as we embark on the next chapter of our story.\u003c/p\u003e\n\u003cp\u003eOpportunity is here.\u003c/p\u003e\n\u003cp\u003eWe are DISH.\u003c/p\u003e\n\u003cp\u003eThe DISH Wireless organization is looking for a Senior IT Data Analyst/ETL Developer to deliver large, complex data migration projects.  The candidate must have the ability to work in a fast paced and evolving environment where initial requirements are vague and evolving.  The ability to quickly understand the project goals and impacted systems and to independently seek out subject matter experts to define requirements and devise solutions will be critical.\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cp\u003eWork with various business and technical people to understand the systems, data sources, business goals, technical goals, timelines, and financial impacts of multiple data conversion projects.\nPerform deep analysis of the data in source and target systems in order to document detailed data mapping requirements.  This will involve analyzing data quality, data availability, and defining data transformations.\nUtilize ETL tools such as Informatica or other similar tools to perform data analysis and to code complex data migrations.  Focus on creating re-usable components to be leveraged on future conversions.\nDevelop detailed metrics related to all data migrations to report conversion progress and error rates.\nWork well in a team environment where knowledge and re-usable components are proactively shared.\nUtilize procedural programming language or scripting language skills to code the required data transformations.\n#LI-AJ1\u003c/p\u003e\n\u003cp\u003eRequired Skills\u003c/p\u003e\n\u003cp\u003eStrong SQL skills are critical.\nExtensive experience working with relational database systems such as Oracle and SQL Server.\nExperience using an ETL tool such as Informatica or similar.\nExperience with a procedural programming language or scripting language.\nMust be very proficient with Microsoft excel.\nStrong organizational skills and the ability to communicate effectively (both in writing and verbally) to interact effectively with IT, business, and leadership is required. Strong collaboration and facilitation skills are extremely helpful.\nBachelor Degree in Computer Science, Information Systems Management, Engineering, or BS in related technical field, or equivalent amount of education and experience.\nAbility to parse files in various formats.\u003c/p\u003e\n\u003cp\u003ePreferred Skills\u003c/p\u003e\n\u003cp\u003eExperience working in the Wireless industry\nExperience with Informatica\nExperience with Cloud based systems such as Salesforce.com\n3-5 years of experience performing large scale data migrations\u003c/p\u003e\n\u003cp\u003eCompensation: $85,905.00/Yr. - $136,190.00/Yr.\u003c/p\u003e\n\u003cp\u003eFrom versatile health perks to new career opportunities, this role provides all the benefits you need to be\u003c/p\u003e\n\u003cp\u003esuccessful. Check them out on our careers website.\u003c/p\u003e\n\u003cp\u003eSuccessful completion of a pre-employment screen, to include a drug test, criminal background check and Motor Vehicle Record.\u003c/p\u003e\n\u003cp\u003eDISH endeavors to make \u003ca href=\"http://careers.dish.com\"\u003ehttp://careers.dish.com\u003c/a\u003e accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact \u003ca href=\"mailto:accessibility@dish.com\"\u003eaccessibility@dish.com\u003c/a\u003e. This contact information is for accommodation requests only; you may not use this contact information to inquire about the status of applications.\u003c/p\u003e\n\u003cp\u003eWe pride ourselves on developing and promoting talent as an Equal Employment Opportunity Employer - Veteran/Disability. All qualified applicants will receive consideration for employment without regard to race, national origin, gender, age, religion, disability, veteran status, or any other category protected by law. We are a true merit-based organization and work hard so there are no artificial barriers to one's potential success. DISH is committed to a workforce where everyone's opportunities are limitless.\u003c/p\u003e\n\u003cp\u003eConsistent with this commitment, DISH will endeavor to provide reasonable accommodation to otherwise qualified job applicants and employees with known physical or mental disabilities, unless doing so poses an undue hardship on the Company, poses a direct threat of substantial harm to the employee or others, or is otherwise not required by law.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply online - \u003ca href=\"https://jobs.dish.com/jobs/53961?lang=en-us\u0026amp;iis=\u0026amp;iisn=\u0026amp;utm_source=GitHub\u0026amp;utm_medium=jobboard\u0026amp;utm_campaign=Wireless\u0026amp;utm_content=DA-Retail\"\u003ehttps://jobs.dish.com/jobs/53961?lang=en-us\u0026amp;iis=\u0026amp;iisn=\u0026amp;utm_source=GitHub\u0026amp;utm_medium=jobboard\u0026amp;utm_campaign=Wireless\u0026amp;utm_content=DA-Retail\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdCtiIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fd41dda8e0c17055d38085e22ff6263b14ec7989/DISH_WORDMARK_RED_LOGO_1115818_RGB_Newsroom.png"}]