[{"id":"dc150b02-4978-47da-998d-caf0bc6ed6e9","type":"Full Time","url":"https://jobs.github.com/positions/dc150b02-4978-47da-998d-caf0bc6ed6e9","created_at":"Tue Mar 16 20:06:19 UTC 2021","company":"Fred Hutchinson Cancer Research Center","company_url":"https://careers-fhcrc.icims.com/jobs/18649/scientific-computing-manager/job","location":"Seattle, WA","title":"Scientific Computing Manager","description":"\u003cp\u003eCures Start Here. At Fred Hutchinson Cancer Research Center, home to three Nobel laureates, interdisciplinary teams of world-renowned scientists seek new and innovative ways to prevent, diagnose and treat cancer, HIV/AIDS and other life-threatening diseases. Fred Hutch’s pioneering work in bone marrow transplantation led to the development of immunotherapy, which harnesses the power of the immune system to treat cancer. An independent, nonprofit research institute based in Seattle, Fred Hutch houses the nation’s first cancer prevention research program, as well as the clinical coordinating center of the Women’s Health Initiative and the international headquarters of the HIV Vaccine Trials Network. Careers Start Here.\u003c/p\u003e\n\u003cp\u003eAt Fred Hutch, we believe that the innovation, collaboration, and rigor that result from diversity and inclusion are critical to our mission of eliminating cancer and related diseases. We seek employees who bring different and innovative ways of seeing the world and solving problems. Fred Hutch is in pursuit of becoming an antiracist organization. We are committed to ensuring that all candidates hired share our commitment to diversity, antiracism, and inclusion.\u003c/p\u003e\n\u003cp\u003eThe Scientific Computing team is a department within Information Technology with a vision to enable researchers to leverage all possible data in the effort to eliminate disease by driving the development of high performance computing infrastructure and solutions, data storage and management solutions, and data science capabilities through strategic partnering and robust engineering, thereby establishing Fred Hutch as a recognized center of excellence in biomedical data science. Your work will assist hundreds of investigators and their research staff in finding cures and eliminating related diseases. The Scientific Computing team, within the Information Technology department, is looking for an engineering manager who is a hands-on team leader with a strong technology background. As a group, we treat each other with respect, work collaboratively, maintain open communication, focus on our supporting our research community, and challenge ourselves and each other to grow, try new things and take risks. If this sounds like your kind of culture and team, we cordially invite you to apply for this exciting role.\u003c/p\u003e\n\u003cp\u003eResponsibilities\nThe Scientific Computing Manager will direct and oversee all facets of scientific computing including managing a highly capable engineer team, engineering functions such as design, development, installation, and maintenance of hardware and software, and customer service and support, for the organization. The manager will partner with faculty and stakeholders in the scientific community to test and integrate new analysis pipelines, determine innovative technologies and software to support their research, evangelize new and current solutions, and foster technology and data storage best practices. The manager will participate in strategic planning and align projects and resources for implementation in partnership with the Project Management Office and Business Operations, and other departments.\u003c/p\u003e\n\u003cp\u003eJob duties:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eManage the day-to-day operations of the team, ensuring that engineers have what they need to run a world-class HPC and storage environment\u003c/li\u003e\n\u003cli\u003eProvide leadership, coaching, and ongoing career growth and development for talent management\u003c/li\u003e\n\u003cli\u003ePartner with the Project Management Office to manage a portfolio of infrastructure projects, balance operational and project commitments, ensure resource availability and allocation to meet operational and project commitments\u003c/li\u003e\n\u003cli\u003eDrive innovation and continuous improvement processes\u003c/li\u003e\n\u003cli\u003eOptimize processes and manage technical debt to reduce the team's operational burden\u003c/li\u003e\n\u003cli\u003eSupport of faculty needs and requirements by way of partnership, evangelism, and as a trusted advisor\u003c/li\u003e\n\u003cli\u003eLead and co-chairing the Scientific Computing oversight committee\u003c/li\u003e\n\u003cli\u003eDrive documentation efforts to improve the experience of computational researchers of Fred Hutch\u003c/li\u003e\n\u003cli\u003eEnsure the success of all Scientific Computing initiatives\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMinimum qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years experience in a technical leadership position and/or managing a technical team\u003c/li\u003e\n\u003cli\u003e10+ years systems engineering experience (hardware, software, and best practices) managing Linux systems, storage, and cloud infrastructure\u003c/li\u003e\n\u003cli\u003eStrong understanding and demonstrated leadership of technology operations and operational excellence best practices including tickets and ticket management systems, systems monitoring, infrastructure management, KPIs and metrics\u003c/li\u003e\n\u003cli\u003eExpert troubleshooting and complex problem-solving skills such as Linux performance troubleshooting\u003c/li\u003e\n\u003cli\u003eStrong communication, facilitation, and presentation skills at all levels and audiences\u003c/li\u003e\n\u003cli\u003eExperience with gathering and documenting analytic/reporting requirements\u003c/li\u003e\n\u003cli\u003eHands-on experience or knowledge of AWS, GCP, or Azure services preferred\n-Work experience in research, grant-funded, or academic settings (including grant writing) preferred\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eFamiliarity of or experience with any or all of the following is a plus:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHPC workload managers and schedulers (e.g., Slurm, Moab, Torque, SGE)\u003c/li\u003e\n\u003cli\u003eStorage systems and management: NAS, NFS, SMB, POSIX, NTFS, ZFS, and Object Storage (S3)\u003c/li\u003e\n\u003cli\u003eVirtualization/Containerization: VMware, KVM, EC2, Docker, Singularity, LXC, Kubernetes\u003c/li\u003e\n\u003cli\u003eWorkflow engines: Cromwell, Nextflow, Luigi, Airflow, CWL/WDL\u003c/li\u003e\n\u003cli\u003eScripting experience: Bash, Python, or R\u003c/li\u003e\n\u003cli\u003eSource code management: Git, GitHub, GitLab, CI/CD\u003c/li\u003e\n\u003cli\u003eConfiguration management, infrastructure as code: Chef, Ansible and Terraform\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eA statement describing your commitment and contributions toward greater diversity, equity, inclusion, and anti-racism in your career or that will be made through work at Fred Hutch is requested of all finalists.\u003c/p\u003e\n\u003cp\u003eOur Commitment to Diversity\nWe are proud to be an Equal Employment Opportunity (EEO) and Vietnam Era Veterans Readjustment Assistance Act (VEVRAA) Employer. We are committed to cultivating a workplace in which diverse perspectives and experiences are welcomed and respected. We do not discriminate on the basis of race, color, religion, creed, ancestry, national origin, sex, age, disability (physical or mental), marital or veteran status, genetic information, sexual orientation, gender identity, political ideology, or membership in any other legally protected class. We are an Affirmative Action employer. We encourage individuals with diverse backgrounds to apply and desire priority referrals of protected veterans. If due to a disability you need assistance/and or a reasonable accommodation during the application or recruiting process, please send a request to our Employee Services Center at \u003ca href=\"mailto:hrops@fredhutch.org\"\u003ehrops@fredhutch.org\u003c/a\u003e or by calling 206-667-4700.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply via our careers page: \u003ca href=\"https://careers-fhcrc.icims.com/jobs/18649/scientific-computing-manager/job\"\u003ehttps://careers-fhcrc.icims.com/jobs/18649/scientific-computing-manager/job\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGVjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fa9ef09c7ea34026f94d30def810bdbbbe58ebf0/FH.png"},{"id":"04600bca-8db4-4bf8-910d-4730e4e13ac6","type":"Full Time","url":"https://jobs.github.com/positions/04600bca-8db4-4bf8-910d-4730e4e13ac6","created_at":"Tue Mar 16 17:27:10 UTC 2021","company":"BoldBrush, Inc.","company_url":"https://www.boldbrush.com","location":"Texas","title":"Development Team Manager","description":"\u003cp\u003e\u003cstrong\u003eBoldBrush is searching for a technically minded, driven, resourceful, detail-oriented manager who can lead our small development team and become our resident expert in improving our development process.  This role is critical in supporting our business strategy by improving our team’s velocity and ability to deliver the innovative products and features on our roadmap.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhy BoldBrush?\u003c/strong\u003e\nAt BoldBrush, we believe that art can transform lives and make the world a better place.  That’s why for over 15 years we’ve made it our mission to bring inspiration and innovation to the world’s artists.  We make innovative  technology that is simple to use, beautiful and empowers our customers  to live their artistic dreams.   And we back our technology with the industry’s top rated live support.  Our people are creative, passionate about art and driven to make every interaction remarkable.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat Working at BoldBrush is Like\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe focus only on serving artists and our focus gives us a huge advantage because we know our market like nobody else.\u003c/p\u003e\n\u003cp\u003eLots of opportunities to learn and grow because we tackle challenging problems, reach for big goals, and move fast.\u003c/p\u003e\n\u003cp\u003eAn amazing and supportive team who will challenge you to do your very best and be there to support you.\u003c/p\u003e\n\u003cp\u003eA remarkable set of customers that you can feel good about serving who are dedicated to making the world a better place through their art.\u003c/p\u003e\n\u003cp\u003eA stable and profitable company with two decades of leadership in the visual art space.\u003c/p\u003e\n\u003cp\u003eA remote, work environment where you can work from anywhere (which is super important these days).\u003c/p\u003e\n\u003cp\u003eExtremely low turnover rate.  Nearly everyone we’ve ever hired still works at BoldBrush.\u003c/p\u003e\n\u003cp\u003eAn incredibly consistent culture based on our 4 distinguishing beliefs: Build Trust, Obsess over customers, Learn and Improve Daily, and Deliver results and innovation.\u003c/p\u003e\n\u003cp\u003eA comfortable, relaxed dress code - you must wear something.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT YOU’LL DO\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJOB MISSION:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTo double or greatly increaste the productivity/velocity of our current development team over 1 year, to get our three top strategic projects out the door in year one, and to build out our processes to allow continuous improvement and reliable reporting and forecasting.  You’ll report directly to the CEO, Clint Watson and will often join the leadership team in planning.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eINITIAL OBJECTIVES:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eGet our three biggest strategic projects built and launched by the end of first year - Print on Demand, Membership Manager, New Control Panel.\u003c/p\u003e\n\u003cp\u003eIncrease our Dev team’s output/velocity by end of first year - Improve workflow management, accountability, processes \u0026amp; distractions to double or greatly improve current team’s output.\u003c/p\u003e\n\u003cp\u003eBuild a reliable process that measures team productivity, accurately manages the workflow, and predicts lead times to management.\u003c/p\u003e\n\u003cp\u003eBuild solid devops monitoring / emergency response process \u003c/p\u003e\n\u003cp\u003eRepresent development department on leadership team\u003c/p\u003e\n\u003cp\u003eBuild solid recruitment, training and mentoring program\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eONGOING ROLES AND RESPONSIBILITIES OF DEV TEAM MANAGER\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLead, Manage, and be Accountable for Dev Team Performance. \u003c/p\u003e\n\u003cp\u003eRecruitment, training, mentoring of dev team\u003c/p\u003e\n\u003cp\u003eCustomer satisfaction with product\u003c/p\u003e\n\u003cp\u003eVelocity - Protect, Maintain and Increase\u003c/p\u003e\n\u003cp\u003eProduct quality\u003c/p\u003e\n\u003cp\u003eBuilding the product (building right thing, right way, on time, on budget)\u003c/p\u003e\n\u003cp\u003eOperations and uptime protection. Sla on uptime\u003c/p\u003e\n\u003cp\u003eProduction strategy and implementation\u003c/p\u003e\n\u003cp\u003eCapacity and throughput forecasting and reporting and improvement\u003c/p\u003e\n\u003cp\u003eProcess development and improvement\u003c/p\u003e\n\u003cp\u003eStriking the right balance of resources:  UI/UX, Front End, Back End, DevOps\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT WE ARE LOOKING FOR:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAbility to build trust and work with a customer focus.\u003c/p\u003e\n\u003cp\u003eAbility and willingness to learn and improve.\u003c/p\u003e\n\u003cp\u003eCreative, data-driven, detail-oriented, independent, self-motivated, and self-starting contributor.\u003c/p\u003e\n\u003cp\u003eOutstanding written and verbal communication skills.\u003c/p\u003e\n\u003cp\u003eExperience in leading and growing development teams\u003c/p\u003e\n\u003cp\u003eAn understanding of work-in-process theories and a history of managing and increasing throughput\u003c/p\u003e\n\u003cp\u003eProficient across a diverse set of technologies or an expert in at least one technology\u003c/p\u003e\n\u003cp\u003eProficient understanding of code versioning tools\u003c/p\u003e\n\u003cp\u003eStrategic thought leader that holds marketing and business goals at the center of product execution\u003c/p\u003e\n\u003cp\u003eAbility to code in at least one language and ability to smell BS in technology/coding discussions\u003c/p\u003e\n\u003cp\u003eAbility to oversee the design of complex components and system\u003c/p\u003e\n\u003cp\u003eAbility to coordinate schedules and deliverables in a dynamic and fast-paced environment\u003c/p\u003e\n\u003cp\u003eA deep seated drive to deliver\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLET'S TALK:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIf leading the development team for a creative, artistic and growing company sounds appealing to you, then let’s have a conversation. (Confidential, of course).\u003c/p\u003e\n\u003cp\u003eTo start a confidential conversation:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\n\u003cp\u003eTake our culture index survey at: \n\u003ca href=\"https://portal.cultureindex.com/public/survey/general/63lex6s42M\"\u003ehttps://portal.cultureindex.com/public/survey/general/63lex6s42M\u003c/a\u003e\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePrepare a cover letter outlining why you think you’d be a great fit for this position and provide it, and your resume at the following URL: \u003c/p\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003e\u003ca href=\"https://jobs.recooty.com/boldbrush/development-team-manager/apply\"\u003ehttps://jobs.recooty.com/boldbrush/development-team-manager/apply\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.recooty.com/boldbrush/development-team-manager/apply\"\u003ehttps://jobs.recooty.com/boldbrush/development-team-manager/apply\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdFdjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f2105198fd91cb78cb417f0b8ef7616c0d28a86f/bug_512px.jpg"},{"id":"d2805568-a0d3-4dfe-8679-12e0b2dcb7c5","type":"Full Time","url":"https://jobs.github.com/positions/d2805568-a0d3-4dfe-8679-12e0b2dcb7c5","created_at":"Tue Mar 16 16:50:06 UTC 2021","company":"Otter.ai","company_url":"http://Otter.ai","location":"Los Altos, CA","title":"Senior DevOps Engineer","description":"\u003cp\u003e\u003cstrong\u003eAbout Otter.ai\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eJoin us at Otter.ai in transforming the way remote teams work and communicate.  Our AI-powered collaborative note-taking app works across Zoom, Google Meet, and Microsoft Teams to help teams record, transcribe, search and share meeting notes.  In addition, we are making virtual meetings accessible to all employees - allowing team members with disabilities to participate in a world that is now dominated by virtual meetings.\u003c/p\u003e\n\u003cp\u003eWith over 10M users experiencing Otter.ai, we are making an impact at scale and we are growing fast.  Our team is made up of top talent from companies like Google, Facebook, Yahoo!, Microsoft, Pinterest, Spotify, and Plaid.  We are backed by leading investors that include David Cheriton (Google’s first investor), Tim Draper (Draper Associates), Spectrum Equity, Horizons Ventures, GGV Capital, and Duke University.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you will work on:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAutomate the deployment process, continuous integration, and testing\u003c/li\u003e\n\u003cli\u003eMaintain and manage data infrastructure such as MySQL, Elasticsearch, Redis, Kafka\u003c/li\u003e\n\u003cli\u003eDesign and implement monitoring systems such as Prometheus and Grafana\u003c/li\u003e\n\u003cli\u003eOptimize Linux systems for performance, reliability, and security\u003c/li\u003e\n\u003cli\u003ePerform security checks and vulnerability scans and apply security practice\u003c/li\u003e\n\u003cli\u003eConfiguration management \u003c/li\u003e\n\u003cli\u003eBuild occasional product features as appropriate\u003c/li\u003e\n\u003cli\u003eDig into logs and monitoring data to find the root of a problem\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWho you are:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of relevant technical experience, including significant experience with site reliability, DevOps, or server infrastructure engineering.\u003c/li\u003e\n\u003cli\u003eBachelor's in CS or EE (MS preferred)\u003c/li\u003e\n\u003cli\u003eFamiliar with AWS\u003c/li\u003e\n\u003cli\u003eFamiliar with Python and Django\u003c/li\u003e\n\u003cli\u003eFamiliar with MySQL, Redis, Elastic Search, Kafka\u003c/li\u003e\n\u003cli\u003eExperience architecting, developing, and troubleshooting large scale systems\u003c/li\u003e\n\u003cli\u003eExperience with data structures and Linux systems internals (e.g., filesystems, system calls) and administration\u003c/li\u003e\n\u003cli\u003eKnowledge in containers and orchestration using Kubernetes\u003c/li\u003e\n\u003cli\u003eExperience with CI using platforms such as Jenkins\u003c/li\u003e\n\u003cli\u003eFamiliar with monitoring systems such as Prometheus, Grafana\u003c/li\u003e\n\u003cli\u003eExperience with Salt and Ansible\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eEmployee Benefits:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStock. Be a [literal] stakeholder in our company’s future.\u003c/li\u003e\n\u003cli\u003eFood. Enjoy catered meals and boundless snacks.\u003c/li\u003e\n\u003cli\u003eFun. We host team lunches weekly and team events bi-quarterly.\u003c/li\u003e\n\u003cli\u003ePeople. Work with talented, collaborative, and friendly people who love what they do.\u003c/li\u003e\n\u003cli\u003eHealth and Saving. Receive the benefits of comprehensive health, dental, vision and disability insurance.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e \u003c/p\u003e\n\u003cp\u003e \u003c/p\u003e\n\u003cp\u003e\u003cem\u003eOtter.ai is an equal opportunity employer. We proudly celebrate diversity and are dedicated to inclusivity.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003ePlease note: Otter.ai does not accept unsolicited resumes from 3rd party recruitment agencies without a written agreement in place for permanent placements. Any resume or other candidate information submitted outside of established candidate submission guidelines (including through our website or via email to any Otter.ai employee) and without a written agreement otherwise will be deemed to be our sole property, and no fee will be paid should we hire the candidate.\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/de500ab63us\"\u003ehttps://grnh.se/de500ab63us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdEtjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1acac1d87b69b7bcc07326a870f5333854712225/Otter_logo_blue.png"},{"id":"b135933d-b40e-434c-8455-bf542107415b","type":"Full Time","url":"https://jobs.github.com/positions/b135933d-b40e-434c-8455-bf542107415b","created_at":"Tue Mar 16 16:45:43 UTC 2021","company":"Otter.Ai","company_url":"http://Otter.Ai","location":"Los Altos, CA","title":"Senior Backend Engineer","description":"\u003cp\u003e\u003cstrong\u003eAbout Otter.ai:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eJoin us at Otter.ai in transforming the way remote teams work and communicate. Our AI-powered collaborative note-taking app works across Zoom, Google Meet, and Microsoft Teams to help teams record, transcribe, search and share meeting notes.  In addition, we are making virtual meetings accessible to all employees - allowing team members with disabilities to participate in a world that is now dominated by virtual meetings.i\u003c/p\u003e\n\u003cp\u003eWith over 10M users experiencing Otter.ai, we are making an impact at scale and we are growing fast.  Our team is made up of top talent from companies like Google, Facebook, Yahoo!, Microsoft, Pinterest, Spotify, and Plaid.  We are backed by leading investors that include David Cheriton (Google’s first investor), Tim Draper (Draper Associates), Spectrum Equity, Horizons Ventures, GGV Capital, and Duke University.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout this role:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are seeking an experienced \u003cstrong\u003eSenior Backend Engineer\u003c/strong\u003e to help lead the development, deployment and management of our web services and related infrastructure to join our engineering team. Members of the engineering team work collaboratively as a group and with colleagues in technology, who are devising new speech recognition solutions, and product management to deploy systems and infrastructure to serve the needs of end-user professionals and enterprise clients across a number of verticals.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNeed to Have:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBS/MS in Computer Science (or EE) from a top school, or have substantial production server experience (or equivalent)\u003c/li\u003e\n\u003cli\u003eAt least 4+ years of experience in developing/architecting large scale systems \u003c/li\u003e\n\u003cli\u003eHands-on coding and development in Python and C++\u003c/li\u003e\n\u003cli\u003eStrong proficiency in building business logic with Web Framework such as Django and MySQL\u003c/li\u003e\n\u003cli\u003eExperience with platforms such as Nginx, Kafka, MySQL, Cassandra, Redis, and big data platforms\u003c/li\u003e\n\u003cli\u003eStrong ability to write and debug code that is reusable, testable and efficient\u003c/li\u003e\n\u003cli\u003eAbility to communicate effectively with peers in design, product management, technology, and engineering to respond to requirements and diagnose problems\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eNice to Have:\u003c/strong\u003e \u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePhD in Distributed Systems or related fields (including architecture/infrastructure-related) \u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eEmployee Benefits:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStock. Be a [literal] stakeholder in our company’s future.\u003c/li\u003e\n\u003cli\u003eFood. Enjoy catered meals and boundless snacks.\u003c/li\u003e\n\u003cli\u003eFun. We host team lunches weekly and team events bi-quarterly.\u003c/li\u003e\n\u003cli\u003ePeople. Work with talented, collaborative, and friendly people who love what they do.\u003c/li\u003e\n\u003cli\u003eHealth and Saving. Receive the benefits of comprehensive health, dental, vision and disability insurance.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eOtter.ai is an equal opportunity employer. We proudly celebrate diversity and are dedicated to inclusivity.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003ePlease note: Otter.ai does not accept unsolicited resumes from 3rd party recruitment agencies without a written agreement in place for permanent placements. Any resume or other candidate information submitted outside of established candidate submission guidelines (including through our website or via email to any Otter.ai employee) and without a written agreement otherwise will be deemed to be our sole property, and no fee will be paid should we hire the candidate.\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/0b79ab323us\"\u003ehttps://grnh.se/0b79ab323us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdENjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--69e15ca8a712c524fcc5c904c2b9ec1cf40b8e8b/Otter_logo_blue.png"},{"id":"4ca744df-5a54-4dc7-9f54-8dc571dbfbdb","type":"Full Time","url":"https://jobs.github.com/positions/4ca744df-5a54-4dc7-9f54-8dc571dbfbdb","created_at":"Tue Mar 16 03:08:28 UTC 2021","company":"You Need A Budget (YNAB)","company_url":"https://www.youneedabudget.com/","location":"Remote","title":"Humbly Confident Senior iOS Developer ","description":"\u003cp\u003e\u003cstrong\u003eAbout Us and Why We’re Hiring\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe build “You Need a Budget,” the best budgeting software and education resources around. (Those in the know call us YNAB, which is pronounced “why-nab.”) For more than a decade, people have been buying YNAB and then telling their friends what a difference it has made in their lives. \u003ca href=\"https://www.google.com/search?q=ynab\"\u003eGoogle us\u003c/a\u003e, or read some of our \u003ca href=\"https://apps.apple.com/us/app/ynab-you-need-a-budget/id1010865877\"\u003ereviews on the app store\u003c/a\u003e, and you’ll see what we mean. We love building something that has a huge positive impact on people’s lives.\u003c/p\u003e\n\u003cp\u003eYNAB is growing, and so is our product team. We’re a software ecosystem that includes apps for web, iPhone, iPad, Apple Watch, and Android phones. We have some big plans for our iOS app, and that’s where you come in!\u003c/p\u003e\n\u003cp\u003eWe have one overarching requirement when it comes to joining our team: our \u003ca href=\"https://docs.google.com/document/d/16hufsixsrv1j2jZkWUgQmeKpNfQRsacnnK2xTVwO0ew/edit\"\u003eCultural Manifesto\u003c/a\u003e has to really click with you. If you’re nodding emphatically while reading this, you’ll probably fit right in!\u003c/p\u003e\n\u003cp\u003eOf course, we have some firm requirements too. You must have at least five years of professional software development experience, and a minimum of four years spent writing iOS apps.\u003c/p\u003e\n\u003cp\u003eBut first, let’s talk about life at YNAB, and then we’ll go into detail about what we’re looking for.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWho You’d Be Working With\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur developer team is about 25 people strong, and we frequently operate in cross-functional teams, so you’ll get to work with awesome people from all different roles in the company.\u003c/p\u003e\n\u003cp\u003eRegardless of their varied interests, all of our developers have one thing in common: They are a joy to work with. You won’t find heated arguments and raised voices here. We save our competitive spirit for YNAB’s external competitors (or the occasional lively board game session), but internally we build up our teammates and celebrate their successes. We all love to program and solve problems in creative ways, and we regularly take time to geek out and show each other something cool we built or found to make our lives easier.\u003c/p\u003e\n\u003cp\u003eAnd of course, as a developer, you’ll work closely with our amazing designers. They have the awards (including at least one actual Emmy®) to prove they’re good at designing stuff. More importantly, they welcome feedback and suggestions during the development process and are happy to tweak an interaction if you tell them it will save you significant development effort.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow You’ll Work at YNAB\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe strive hard to make working at YNAB a unique and fantastic experience (we’ve even been named \u003ca href=\"https://fortune.com/best-small-workplaces/you-need-a-budget/\"\u003eFortune’s #1 Best Small Company to Work For\u003c/a\u003e). We have a team full of truly exceptional people—the kind you’ll be excited to work with. Here’s how we operate:\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibility and Empowerment\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe appreciate, respect, and trust the expertise and judgment of our developers. We empower them to do what they think is right.\u003c/p\u003e\n\u003cp\u003eWe also work collaboratively. We continuously seek the right amount of structure and unity necessary to maximize productivity. Where it makes sense, we designate someone to make a call.\u003c/p\u003e\n\u003cp\u003eEven though our developers are right a lot, it's okay to make mistakes here. Exploration and calculated risks are vital to velocity and growth. We freely admit when we're wrong. If something doesn't go as expected, we learn, bounce back, and make corrections.\u003c/p\u003e\n\u003cp\u003eYou won't be alone; others will be there to help, review, reassure, and back you up. We own our processes and collective outcomes as a team.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLive Where You Want\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re a distributed team, so you can live and work wherever you want, as long as it’s somewhere between the Pacific Time Zone (UTC-8) and the Central European Time Zone (UTC+1). Proximity doesn’t influence productivity. Just make sure you have a reliable internet connection.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNo Crazy Hours\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe want everyone to have a full life outside of YNAB. We seldom work more than 40 hours per week. There have been rare occasions where things got a little crazy, and people logged some extra hours. But then they took additional time off to balance it all out. We work hard and smart, but we’re in this for the long haul; there’s no need to go crazy on the hours.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTake Vacation (Seriously)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe want you to take vacation. In fact, we have a minimum vacation policy of three weeks per year. Five weeks feels about right (plus two extra weeks for Holiday break). It’s important to get plenty of downtime and get out and do something. We’ll look forward to seeing pictures of your adventures in our #office_wall Slack channel.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe YNAB Retreat\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhen the pandemic isn’t keeping us from traveling, we get the teams together once a year to catch up on spreadsheets and powerpoints in a Best Western conference room. Just kidding. So far, we’ve done \u003ca href=\"https://www.youtube.com/watch?v=8Fs1TN-jrDI\u0026amp;t\"\u003eCosta Rica\u003c/a\u003e, a \u003ca href=\"https://www.youneedabudget.com/if-you-feel-guilty-spending-money-youre-doing-it-wrong/\"\u003egigantic cabin\u003c/a\u003e in the mountains, a beach house in the Outer Banks, a ranch in Montana, and most recently, \u003ca href=\"https://www.youtube.com/watch?v=js5pNTDKiZE\u0026amp;feature=youtu.be\"\u003eLaguna Beach\u003c/a\u003e. We do really fun things at these retreats, but the highlight is inevitably just being together and having a blast.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eUp Your Game\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re serious about helping you improve your craft. We budget for it (hey-o!). Think conferences, Lynda/Skillshare subscriptions, books, and dedicated time away from work to learn something new. We love to see our people grow.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eInternational is Absolutely Okay\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIf you are Stateside, we’ll set you up as a W2 employee. If you’re international, you’ll be set up as a contractor. We are already spread across the world: Switzerland, Scotland, Mexico, Brazil, Argentina, Germany, Canada, and all over the United States.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe offer excellent health, dental, and vision insurance for our US employees, where we cover 100% of the premium for you and your family. (No need to check your vision, you read that right, 100%. Although if you did need to check your vision, we’ve got you covered!)\u003c/p\u003e\n\u003cp\u003eWe also have a Traditional and Roth 401k option. YNAB matches your contributions, up to six percent of your paycheck. Matches vest immediately. (Are you a personal finance junkie like our founder Jesse? He set up YNAB’s 401k to have the lowest fee structure possible, where all plan costs are paid by YNAB, not your retirement nest egg. The investment funds available are fantastic, passively-managed, ultra low-cost index funds. You’re not a PF junkie? Trust us, it’s awesome.)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCompetitive Compensation\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe use a leading compensation data provider to set competitive and well-defined pay ranges for all of our positions. Your pay is the same no matter where you live, and our goal is to pay at or above the market rate in the United States. We consider raises every year and have a bonus plan based on profitability, which you’re in on from day one. YNAB wins, you win. That kind of thing.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOther Tidbits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOnce you start, we DEMAND (in a friendly, ALL CAPS IS YELLING way) that you fill out your “Bucket List” spreadsheet with 50 items. (That’s harder than it sounds!)\u003c/li\u003e\n\u003cli\u003eThe bucket list really helps in deciding what we should give you for your birthday and the holidays.\u003c/li\u003e\n\u003cli\u003eWe’re all adults. There’s no need to punch a clock or ask for permission to take off early one afternoon to go see the doctor. We look at what you accomplish, not how long you sit (have you tried standing?) in front of a computer.\u003c/li\u003e\n\u003cli\u003eWe want you firing on all cylinders so we’ll set you up with a top-of-the-line computer and phone and will replace them regularly.\u003c/li\u003e\n\u003cli\u003eDid we mention we make a huge, positive difference in people’s lives?\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIf this sounds like your ideal environment, read on because now we want to talk about you. You will play a big part in building something easy and joyful to use that helps millions of people discover budgeting as an essential financial and life-planning tool. \u003cem\u003eYou will change lives.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYou, Our New Senior iOS Developer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYou're a software developer with over five years of professional, full-time experience. You spent at least four of those years working with iOS. You know how to write easy-to-maintain software while still keeping an eye on the roadmap.\u003c/p\u003e\n\u003cp\u003eYou'll help us write and maintain features in our iOS/iPadOS/watchOS app.\u003c/p\u003e\n\u003cp\u003eWe have a native Swift/Objective-C implementation for the app infrastructure and user interface code. We are migrating our codebase over time from Objective-C to Swift, with all new development in Swift.\u003c/p\u003e\n\u003cp\u003eWe use a shared library written in TypeScript for things common across platforms, such as interfacing with our Rails/Postgres server and much of our business logic. We use SQLite for local storage.\u003c/p\u003e\n\u003cp\u003eAs an iOS developer here, you don’t have to be an expert in TypeScript or SQL, but being curious about how things work on that layer will help.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYou’re our person if:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are an excellent, senior developer that can adapt to new languages quickly.\u003c/li\u003e\n\u003cli\u003eYou write code that is easy for other programmers and your future self to understand and use.\u003c/li\u003e\n\u003cli\u003eYou have deep experience with Swift and are comfortable with Objective-C.\u003c/li\u003e\n\u003cli\u003eYou have played an essential role in building, shipping, and supporting at least one significant iOS app.\u003c/li\u003e\n\u003cli\u003eYou have excellent debugging skills. You know how to find problems and how to build apps so that problems are discoverable in the first place.\u003c/li\u003e\n\u003cli\u003eYou have an understanding of algorithms and data structures beyond arrays and “for loops.” That doesn’t mean you have to be a computer science PhD or even that you have to know “Big O” notation, but you should know when to use a Dictionary/Map, and why finding an element in a sorted array is faster than finding an element in an unsorted array.\u003c/li\u003e\n\u003cli\u003eYou aren’t (necessarily) a security specialist, but you know enough to be protective of customer data and privacy.\u003c/li\u003e\n\u003cli\u003eYou already use and love YNAB. (Not a requirement, but we’ll give you bonus points for this one.)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDiversity\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYNAB is an equal opportunity employer. We believe a diversity of backgrounds, beliefs, abilities, and experiences is critical to our success. We are passionate about creating a welcoming, supportive, and collaborative environment for all employees. All are encouraged to apply as we continue to grow a smart, experienced, and diverse team that loves working together to build something that matters.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow to Apply\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eApply by 11:59PM on March 28th, 2021.\u003c/strong\u003e Firm. It’s a real deadline.\u003c/p\u003e\n\u003cp\u003eWrite a cover letter and attach it as a PDF. In your cover letter:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eIntroduce yourself, tell us why this position is of interest to you, and why you would be a great fit. This portion of the cover letter should be less than a page and a half.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eOn a separate page of your cover letter, please answer the following questions. Each response should be about a paragraph in length:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWhat criteria do you look for when searching for your next company or position?\u003c/li\u003e\n\u003cli\u003eWhat are your favorite and least favorite parts of your current job?\u003c/li\u003e\n\u003cli\u003eTell us about a time when you had to learn something new to excel at your job.\u003c/li\u003e\n\u003cli\u003ePlease tell us about apps or anything you’ve built that makes you look good, and describe your role in those projects. (Include links if applicable.)\u003c/li\u003e\n\u003cli\u003eBriefly (no more than a few sentences) describe a proud “debugging” moment you had, where you found and fixed a bug.\u003c/li\u003e\n\u003cli\u003eIf you were interviewing a prospective developer for this position, what would be a good interview question to ask to find out if a candidate really knew their stuff?\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eComplete this short coding test in your language of choice and include a link to your results in your cover letter. This shouldn’t take more than 30 minutes or so: \u003ca href=\"https://www.interviewzen.com/apply/PVNGB2\"\u003ehttps://www.interviewzen.com/apply/PVNGB2\u003c/a\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSwift isn’t directly supported yet in that simple Interview Zen code editor, but you can choose plain “Text” as the language and write in Swift anyway if you like.\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIf you have a prepared resume, attach it in PDF form. If you don’t have a resume because you aren’t even sure you’re looking to change jobs, that’s fine! In that case, please just include an informal list of your work and education history or a link to your LinkedIn profile.\nPlease send all attachments as PDFs.\u003c/p\u003e\n\u003cp\u003eP.S.  If this position isn’t right for you at this time, but you know someone else who might be interested, we’d really appreciate it if you passed this along!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://ynab.recruiterbox.com/jobs/fk0u7tc\"\u003ehttps://ynab.recruiterbox.com/jobs/fk0u7tc\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcjZjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ab6573768561d1943a43b1ec5775a465ccb31ca1/YNAB_wordmark_blue-LG.png"},{"id":"96200331-22ec-4f7c-9ef5-ebcae89e03af","type":"Full Time","url":"https://jobs.github.com/positions/96200331-22ec-4f7c-9ef5-ebcae89e03af","created_at":"Tue Mar 16 01:25:21 UTC 2021","company":"SweetRush","company_url":"https://www.sweetrush.com/","location":"Remote","title":"Senior Creative Front End Web Developer","description":"\u003cp\u003e\u003cstrong\u003eSweetRush has an exciting opportunity for an experienced creative front-end developer (full stack is also acceptable) with an eye for graphic and UX design!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eABOUT THE ROLE:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThis is an important role on the Engineering and Development department’s Course Development team, and you will be reporting directly to the Course Development team lead.\u003c/p\u003e\n\u003cp\u003eHistorically, the developers most successful in this role contribute to multiple projects at the same time; show a willingness to improve existing techniques, frameworks, and templates; and come up with innovations of their own. You will succeed if you truly enjoy active collaboration with your colleagues and don’t mind stepping in when your help is required.\u003c/p\u003e\n\u003cp\u003eThis is a remote position and a great opportunity to work from home. Candidates from all geographic locations are welcome to apply; however, our development team is mostly based in North and Latin America, and you should be willing to work during our business hours.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eREQUIRED SKILLS:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFront end\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e7+ years as a front-end or full stack developer in a creative environment\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExpert-level JavaScript skills—Vanilla JS expertise is as important as the knowledge of frameworks and libraries\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHigh level of competency in HTML5 and CSS3\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFamiliarity with one or more frameworks, preferably React and Node.js\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWhile React is the most commonly used framework at the moment, your proven ability to quickly harness unfamiliar technology is more important than an intimate knowledge of any of the given frameworks.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eMost importantly - you can look at just about any cool effect, interaction, animation, parallax, website on the web, and say - Even if I can’t do this now, I want to try!\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eUnderstanding of responsive design and mobile-first principles\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eSoft skills and generic productivity tools\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAbility to clearly communicate in English\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eEnglish verbal communication skills are an absolute must because the position requires frequent interaction with peers and clients.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with version control systems such as Git or Subversion\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience working in a team development environment or demonstrating a capacity to do so\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eEnjoy learning and experimenting, open to new ideas\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYOU WILL IMPRESS EVERYONE IF YOU:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHave built a learning simulation\u003c/li\u003e\n\u003cli\u003eHave experience with mobile app development and distribution\u003c/li\u003e\n\u003cli\u003eHave experience with graphic and UX design\u003c/li\u003e\n\u003cli\u003eKnow anything about Adapt Framework\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYOU MAY BE EXPECTED TO:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eComplete a test assignment\u003c/li\u003e\n\u003cli\u003eBe interviewed by a number of highly judgmental yet supremely talented future colleagues\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eTHE ESSENCE OF THE JOB\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOK, now that you’ve made it through all the obligatory language, you may be wondering what this position is really all about. Therefore, please read the rest of this job description carefully!\u003c/p\u003e\n\u003cp\u003eIt all boils down to your ability to make a simple claim: I can do it!\u003c/p\u003e\n\u003cp\u003eIf we show you an interactive website with intricate animations, a complicated menu system, and multiple interdependencies, you should state: I can do it!\u003c/p\u003e\n\u003cp\u003eIf we need to harness a complex web-based gaming engine and use it for the first time to build a learning simulation, you should confidently assert: I can do it!\u003c/p\u003e\n\u003cp\u003eIf we need to produce a large volume of digital training materials in a record short period of time, you should answer: I can do it!\u003c/p\u003e\n\u003cp\u003eAnd if we need an adventurous engineer to lead the team in the creation of a system that is completely different from everything we have done before, we’re most definitely looking for the loud I can do it!\u003c/p\u003e\n\u003cp\u003eAnd even more importantly, you must want to do it.\u003c/p\u003e\n\u003cp\u003eSweetRush is a team of winners. These are not empty words. Just check out our impressive industry trophy shelf, which includes this recent success: \u003ca href=\"https://www.sweetrush.com/sweetrush-wins-16-awards-brandon-hall-awards-2020\"\u003ehttps://www.sweetrush.com/sweetrush-wins-16-awards-brandon-hall-awards-2020\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eAs a winner, you will always want the ball. Want to do better. Want to be more creative and efficient. Join us, and let's see if we can win even more by working together!\u003c/p\u003e\n\u003cp\u003eThis is a work-from-home opportunity! We are 100% virtual, and all communications occur over digital channels (Skype/Web Share/email), apart from infrequent on-site meetings. Occasional travel may be required.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIF THE ABOVE DESCRIBES YOUR INTERESTS AND EXPERIENCE, PLEASE SUBMIT A CURRENT RESUME AND YOUR SALARY REQUIREMENTS. WE LOOK FORWARD TO MEETING YOU!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003ePlease note: We're all about remote work and have collaborators based all around the world; however, SweetRush is a US-based company, and English is our primary language. If you'd like to be considered for this opportunity, please submit your resume in English.\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease submit your application through the following link:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.sweetrush.com/join-us/\"\u003ehttps://www.sweetrush.com/join-us/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcm1jIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9ca1b3c2e98a6d61379628a0b2309d50c4c16ff6/SR%20logo.png"},{"id":"d3fcb173-7088-4110-8abd-df8bc76610c9","type":"Full Time","url":"https://jobs.github.com/positions/d3fcb173-7088-4110-8abd-df8bc76610c9","created_at":"Mon Mar 15 22:25:12 UTC 2021","company":"Gamdom.com","company_url":"http:","location":"Canada","title":"Senior Backend Engineer (Node.js)","description":"\u003cp\u003eWe are looking for some creative, proactive professionals. Gamdom consists of a team of great young professionals, we are continuously looking to improve and to innovate. Are you a Backend, or Full stack developer with experience with node? Or do you know someone who is currently looking for their dream job? Any valuable information to help us find IT-professionals will be rewarded!\u003c/p\u003e\n\u003cp\u003eWhat We’d Like to See\u003c/p\u003e\n\u003cp\u003e✔️ Experience with TypeScript and Node.js/SQL a must.\n✔️ Being able to communicate in English.\n✔️ Flexibility is second nature for you.\n✔️ Ability to write clean code that avoids bugs. Quality matters to us!\n✔️ Being able to see the larger picture. Don't just add code until the feature works - understand how your changes influence the overall architecture and respect the intents of your team members!\u003c/p\u003e\n\u003cp\u003eWhat We’re Offering\u003c/p\u003e\n\u003cp\u003e➕ A chance to work on one of the most popular gaming themed gambling websites\n➕ Be part of a young, motivated, and fun team of young professionals\n➕ A competitive salary\n➕ An opportunity to work on different features\n➕ Work remotely from home, you will be able to choose your own worktimes and days\n➕ Weekly stand-ups and individual meetings to help you grow and keep you motivated\n➕ Exciting technologies to work with: TypeScript, React, Mobx, PostgreSQL, NodeJS, Socket.io, Redis.\u003c/p\u003e\n\u003cp\u003eInterested? Apply now!\u003c/p\u003e\n\u003cp\u003ePlease send your application to \u003ca href=\"mailto:Jobs@gamdom.com\"\u003eJobs@gamdom.com\u003c/a\u003e or directly at this job offer! In your application, just write a few sentences about yourself, your motivation, and why you would be a good fit for Gamdom.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:Felix@gamdom.com\"\u003eFelix@gamdom.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcStjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f1e50b660e33b469d44f3e0056bfb0dbc3ec1826/photo5945096832545830307.jpg"},{"id":"8f170592-0038-4ed2-9503-f54539a47f47","type":"Full Time","url":"https://jobs.github.com/positions/8f170592-0038-4ed2-9503-f54539a47f47","created_at":"Mon Mar 15 22:02:53 UTC 2021","company":"Clearbanc","company_url":"https://clearbanc.com/","location":"Remote","title":"Senior Full-Stack Engineer","description":"\u003cp\u003e\u003cstrong\u003eWhat your day-to-day will look like:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou’ll have strategic impact over a combination of a large team, a very deep technical problem, and/or a long time horizon\u003c/li\u003e\n\u003cli\u003eYou’ll be a subject matter expert in Clearbanc’s technology stack and an owner of significant components of our code base\u003c/li\u003e\n\u003cli\u003eYou’ll provide considerable guidance across the team, setting short to medium term strategic direction plans\u003c/li\u003e\n\u003cli\u003eYou’ll influence prioritization and resourcing with the management team and cross-functional partners to tackle engineering goals\u003c/li\u003e\n\u003cli\u003eContribute to core technological projects as well as experimental work\u003c/li\u003e\n\u003cli\u003eWork in an agile environment with 2 week sprints\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYou will thrive if you:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHave a strong technical background and enjoy researching new technologies to stay up-to-date in the tech industry\u003c/li\u003e\n\u003cli\u003eHave experience solving open-ended problems - this role will encounter a lot of these\u003c/li\u003e\n\u003cli\u003eHave a track record of creating improvements in business-critical systems around stability, performance, and scalability\u003c/li\u003e\n\u003cli\u003eCan work in a hands-on environment, while also taking a step back to act as a team leader\u003c/li\u003e\n\u003cli\u003eAre comfortable with the ambiguity of an early-stage company. This includes being able to transform product sketches into working technology, as well as working in an environment with a fast paced delivery schedule\u003c/li\u003e\n\u003cli\u003eAre Interested in Clearbanc’s core domain - helping entrepreneurs succeed by building valuable financial and software tools\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eTechnical Requirements:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA Bachelor's or Master’s degree in computer science, software engineering or similar field\u003c/li\u003e\n\u003cli\u003e8+ years of experience building web applications with technologies like (but not limited to): TypeScript, Vue and Node\u003c/li\u003e\n\u003cli\u003eProven track record of scaling web applications on top of large, distributed systems with technologies like (but not limited to): RabbitMQ, Kubernetes, Kafka, PostgreSQL\u003c/li\u003e\n\u003cli\u003eThe technologies of the web (HTTP, JSON APIs, REST, HTML)\u003c/li\u003e\n\u003cli\u003eSQL database programming and performance\u003c/li\u003e\n\u003cli\u003e*NIX environments, and Operating system details (including processes, threads and file systems)\u003c/li\u003e\n\u003cli\u003eData structures and algorithms\u003c/li\u003e\n\u003cli\u003eEnterprise systems and asynchronous architectures\u003c/li\u003e\n\u003cli\u003eWriting maintainable systems\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eClearbanc is an equal opportunity employer. We celebrate our inclusive work environment and welcome members of all backgrounds and perspectives to apply. At Clearbanc, we’re committed to developing and upholding an inclusive, transparent, and comfortable environment for all. We create a space where every voice, perspective, and idea is heard and acknowledged. We embrace differences, and know that our diverse team is our strength and what drives our innovation.\u003c/p\u003e\n\u003cp\u003eClearbanc is committed to developing a barrier-free recruitment process and work environment. If you require any accommodation, please let us know and we’ll work with you to meet your accessibility needs.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply here! \u003cstrong\u003e\u003ca href=\"https://grnh.se/8ffbf7193us\"\u003ehttps://grnh.se/8ffbf7193us\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcXVjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3b7d0534a1761e89add3c0c578418a4cc6b45de2/clearbanc.jpg"},{"id":"e1b99fbb-5687-46a5-86e8-3dedd0bf20fb","type":"Full Time","url":"https://jobs.github.com/positions/e1b99fbb-5687-46a5-86e8-3dedd0bf20fb","created_at":"Mon Mar 15 21:02:28 UTC 2021","company":"TED Conferences","company_url":"http://ted.com","location":"Remote","title":"Software Engineer - React Native","description":"\u003cp\u003e\u003cstrong\u003ePOSITION OVERVIEW\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTED creates, produces and distributes audio and video media (most famously TED Talks) to millions of people around the world. As a Software Engineer working with React Native, you will be responsible for the development of mobile apps which deliver TED content to millions of people around the world. You will collaborate with a team of top-tier developers, designers and product owners to take new features and products from conception to production.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eQUALIFICATIONS / SKILLS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e4+ years of professional experience in software development.\u003c/li\u003e\n\u003cli\u003eExpert-level knowledge of:\nJavaScript in frontend environments\nReact Native\nTypeScript\nReact best practices and patterns (hooks, functional components, state management, etc)\u003c/li\u003e\n\u003cli\u003eStrong knowledge of:\nHTML, CSS and other web front-end technologies.\u003c/li\u003e\n\u003cli\u003eIntegrating with remote services asynchronously via REST, GraphQL, etc.\u003c/li\u003e\n\u003cli\u003eCollaborating with teams via GitHub using pull requests and version control best-practices.\u003c/li\u003e\n\u003cli\u003ePreferred experience with:\nNative iOS and/or Android development and tool chains\nFirebase\nVideo streaming technologies\nReact in the browser\n-Absolutely must be a self-starter whose default mode is action and persistence.\u003c/li\u003e\n\u003cli\u003eProactive, positive communication and a team-first attitude are paramount.\u003c/li\u003e\n\u003cli\u003eMust be a ferocious debugger who is unfazed by complex toolchains, immature SDKs and emerging technologies.\u003c/li\u003e\n\u003cli\u003eValues cross-functional collaboration\u003c/li\u003e\n\u003cli\u003eValues a diverse workplace\u003c/li\u003e\n\u003cli\u003eFamiliarity with git and version control best practices\u003c/li\u003e\n\u003cli\u003eFamiliarity with Unix command line and best practices\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRESPONSIBILITIES\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop high-performing apps that stream TED’s media to millions of people\u003c/li\u003e\n\u003cli\u003eDevelop conference technology apps that facilitate first-class conference experiences both in-person and remotely\u003c/li\u003e\n\u003cli\u003eExperiment with new technologies and share discoveries with the team\u003c/li\u003e\n\u003cli\u003eFoster growth and support other engineers through constructive, collaborative code reviews\u003c/li\u003e\n\u003cli\u003eClearly communicate technical constraints and opportunities with stakeholders\u003c/li\u003e\n\u003cli\u003eWillingness to contribute however possible to ensure overall effectiveness of position\u003c/li\u003e\n\u003cli\u003eOther duties and special projects as may be assigned from time to time\u003c/li\u003e\n\u003cli\u003eTravel: Upon request / as needed\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFull health benefits (medical, dental, vision) 100% paid by TED for employees\u003c/li\u003e\n\u003cli\u003ePaid family leave\u003c/li\u003e\n\u003cli\u003eWork-life balance encouraged (TED closes for a 2-week summer break and 1-week winter break plus you're eligible for additional paid time off)\u003c/li\u003e\n\u003cli\u003eFree OneMedical and SpringHealth membership for you and your dependents to address physical and mental well-being\u003c/li\u003e\n\u003cli\u003e401k with match\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://tedconferencesllc.applytojob.com/apply/sN9G1uTqYX/Software-Engineer-React-Native\"\u003ehttps://tedconferencesllc.applytojob.com/apply/sN9G1uTqYX/Software-Engineer-React-Native\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWljIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d8ca02cf387708b76c65ad372bc79523ecad20a1/logo.png"},{"id":"18ff1ba5-a5cf-4927-becc-f41f61939832","type":"Full Time","url":"https://jobs.github.com/positions/18ff1ba5-a5cf-4927-becc-f41f61939832","created_at":"Mon Mar 15 21:00:49 UTC 2021","company":"ChainSafe Systems ","company_url":"http:","location":"Remote and/or Toronto","title":"Rust, Golang, Typescript, Solidity Devs","description":"\u003cp\u003eChainSafe Systems is currently seeking \u003cstrong\u003eRust, Golang, Typescript, and Solidity Developers\u003c/strong\u003e to join our Engineering team.\u003c/p\u003e\n\u003cp\u003eChainSafe Systems is a blockchain R\u0026amp;D firm on a mission to realize the potential of Web3 infrastructure through sustainable, open-source development. Our vision is to create a world with organizations that empower people to build and innovate through blockchain agnostic tools and other distributed technologies.\u003c/p\u003e\n\u003cp\u003eWe are global leaders in the industry, unique in our work across multiple blockchain ecosystems, and currently are pioneering Ethereum, Ethereum Classic, Cosmos, Polkadot and Filecoin technology. We are actively pursuing the development of our own product suite, having recently released \u003ca href=\"https://files.chainsafe.io/\"\u003eFiles\u003c/a\u003e, which allows users to upload and store files on IPFS and Filecoin with the goal of furthering development to provide a decentralized alternative to cloud storage.\u003c/p\u003e\n\u003cp\u003eChainSafe is a unique company in a unique space, growing quickly and building a global reputation in this nascent space. Beyond offering experience across every major blockchain space to our team, we provide an open, inclusive, and supportive environment where we help folks reach their full potential as a human and as a professional.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHere’s what you might want to know before reading on:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eOur stack is progressive and open-source and includes Go, Rust, and TypeScript.\u003c/li\u003e\n\u003cli\u003eWe spearhead ecosystem projects like Lodestar, Web3.js, Forest, Gossamer and Ethermint.\u003c/li\u003e\n\u003cli\u003eWe are global, remote-friendly, and open to contractors (who can commit to a minimum of 35 hours a week). For those local to Toronto, our casual, open-concept office in Chinatown has meeting rooms, lounge areas, and space to pull up a chair.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eCulture fit and alignment to our core values are extremely important to us. We are fueled by an immense intellectual curiosity of what technology can do and the impact it can have. You will thrive here if you are intensely driven by tackling technical challenges that no one else has solved yet and are inspired by the possibility of building the next generation of web infrastructure and decentralized systems.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhy join us\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFounded by Developers for Developers, we foster an Agile environment where tasks are assigned based not just on what you know but what you want to learn. We offer fast opportunities for personal growth, mentorship, professional development funding, tons of autonomy and responsibility, a results-driven environment, close collaboration with an international team, exposure to a wide array of ecosystems and trailblazing technologies, and flexible work hours.\u003c/p\u003e\n\u003cp\u003eAt ChainSafe, we are a compassionate group of builders and makers, working to bring our ideas to life. You’ll be part of a team that believes in the vital importance of community and contributing to advance humanity with open-source and decentralized technology.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://chainsafe.io/corevalues\"\u003eWe care deeply about our values and look for these in every team member:\u003c/a\u003e\u003c/strong\u003e A dedication to self-improvement and professional development; a commitment to community and collaboration; a drive for accountability, diligence, and autonomy; and above fostering a place of acceptance, friendliness, and compassion.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTell us who you are and learn more about us\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIf you are ready to join us, assemble your highlights (GitHub, portfolio, LinkedIn) and show us your best work. Get ready to have incredible conversations with passionate developers like yourself. For our team’s project highlights, explore our \u003ca href=\"https://discord.com/invite/xSAwrnCWcg\"\u003eDiscord\u003c/a\u003e, \u003ca href=\"https://github.com/chainsafe\"\u003eGitHub\u003c/a\u003e, and \u003ca href=\"https://chainsafe.io/projects\"\u003ewebsite\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe welcome your fresh perspectives and ideas\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt ChainSafe, diversity and inclusion is more than a statement; equality and accessibility are guiding principles embedded in who we are - and why we do what we do. Our leadership is committed to continuously improving their own level of education to make the fairest and inclusive hiring and performance decisions from an informed perspective. We recognize the benefits of a diverse team and aspire to embed respect for all people into our culture, values, and day-to-day practices.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSound like a good fit for you? Please apply at \u003ca href=\"mailto:careers@chainsafe.io\"\u003ecareers@chainsafe.io\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"mailto:careers@chainsafe.io\"\u003ecareers@chainsafe.io\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWFjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f322d792bfbec63e02cbdb5d4c97c5beac5c3cdb/ChainSafe_Logo.png"},{"id":"c59fc233-c026-4243-90df-f846aad5802f","type":"Full Time","url":"https://jobs.github.com/positions/c59fc233-c026-4243-90df-f846aad5802f","created_at":"Mon Mar 15 20:59:25 UTC 2021","company":"TED Conferences","company_url":"http://ted.com","location":"Remote","title":"Senior Software Engineer - JavaScript","description":"\u003cp\u003e\u003cstrong\u003ePOSITION OVERVIEW\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTED creates, produces and distributes audio and video media (most famously TED Talks) to millions of people around the world. As a Senior Software Engineer, you will be responsible for the development of backend systems which deliver TED content to millions of people worldwide. You will collaborate with developers and product owners to take new features and products from conception to production.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eQUALIFICATIONS / SKILLS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of professional experience in software development.\u003c/li\u003e\n\u003cli\u003eExpert-level knowledge of:\nJavaScript /TypeScript in NodeJS\nMySQL and RDS technologies\nDistributed system design and architecture\nAWS infrastructure\u003c/li\u003e\n\u003cli\u003eProficiency with:\nGraphQL API design and development\nHTML, CSS and other web front-end technologies.\nGit and version control best practices\nUnix command line\nDocker\u003c/li\u003e\n\u003cli\u003eIt’s a plus to have experience with:\nEmail delivery systems and deliverability\nJob queues and worker processes\nReact\nNext.js\nApollo Server\nRuby on Rails\u003c/li\u003e\n\u003cli\u003eAn insatiable curiosity for technology and software development.\u003c/li\u003e\n\u003cli\u003eAbsolutely must be a self-starter whose default mode is action and persistence.\u003c/li\u003e\n\u003cli\u003eProactive, positive communication and a team-first attitude are paramount.\u003c/li\u003e\n\u003cli\u003eMust be a ferocious debugger who is unfazed by complex toolchains, immature SDKs and emerging technologies.\u003c/li\u003e\n\u003cli\u003eValues cross-functional collaboration\u003c/li\u003e\n\u003cli\u003eValues a diverse workplace\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRESPONSIBILITIES\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop web services that drive user engagement across TED’s ecosystem.\u003c/li\u003e\n\u003cli\u003eArchitect software using well-established design patterns and best practices.\u003c/li\u003e\n\u003cli\u003eExperiment with new technologies and share discoveries with the team\u003c/li\u003e\n\u003cli\u003eFoster growth and support other engineers through constructive, collaborative code reviews\u003c/li\u003e\n\u003cli\u003eClearly communicate technical constraints and opportunities with stakeholders\u003c/li\u003e\n\u003cli\u003eWillingness to contribute however possible to ensure overall effectiveness of position\u003c/li\u003e\n\u003cli\u003eOther duties and special projects as may be assigned from time to time\u003c/li\u003e\n\u003cli\u003eTravel: Upon request / as needed\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFull health benefits (medical, dental, vision) 100% paid by TED for employees\u003c/li\u003e\n\u003cli\u003ePaid family leave\u003c/li\u003e\n\u003cli\u003eWork-life balance encouraged (TED closes for a 2-week summer break and 1-week winter break plus you're eligible for additional paid time off)\u003c/li\u003e\n\u003cli\u003eFree OneMedical and SpringHealth membership for you and your dependents to address physical and mental well-being\u003c/li\u003e\n\u003cli\u003e401k with match\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://tedconferencesllc.applytojob.com/apply/w8GLBhtxG5/Senior-Software-Engineer-JavaScript\"\u003ehttps://tedconferencesllc.applytojob.com/apply/w8GLBhtxG5/Senior-Software-Engineer-JavaScript\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVNjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0a6ea360411699cfe597085b3f260bccaa402e98/logo.png"},{"id":"44e9f9b8-61bb-4db7-b551-7fa8a5e56a1a","type":"Full Time","url":"https://jobs.github.com/positions/44e9f9b8-61bb-4db7-b551-7fa8a5e56a1a","created_at":"Mon Mar 15 20:56:56 UTC 2021","company":"TED Conferences","company_url":"http://ted.com","location":"Remote","title":"Senior Software Engineer - Mobile","description":"\u003cp\u003e\u003cstrong\u003ePOSITION OVERVIEW\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTED creates, produces and distributes audio and video media (most famously TED Talks) to millions of people around the world. As a Senior Software Engineer, you will be responsible for the development of mobile apps and their accompanying backend systems which deliver TED content to a diverse landscape of people using myriad devices. You will work directly with designers, developers and product owners to take new features and products from conception to production.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eQUALIFICATIONS / SKILLS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e4+ years of professional experience in software development.\u003c/li\u003e\n\u003cli\u003eExpert-level knowledge of Javascript in both frontend and backend applications.\u003c/li\u003e\n\u003cli\u003eStrong knowledge of HTML, CSS and other web front-end technologies.\u003c/li\u003e\n\u003cli\u003eExperience with React, Ruby on Rails, MySQL, git, version control best practices, and the Unix command line.\u003c/li\u003e\n\u003cli\u003eIt’s a plus to have experience with React Native, native iOS and Android development, AWS and/or Firebase, and video streaming technologies\u003c/li\u003e\n\u003cli\u003eAn insatiable curiosity for technology, software and IoT.\u003c/li\u003e\n\u003cli\u003eMust be a self-starter who will stop at nothing to clear blockers and ship products.\u003c/li\u003e\n\u003cli\u003eMust be a ferocious debugger who is unfazed by complex toolchains, immature SDKs and emerging technologies.\u003c/li\u003e\n\u003cli\u003eValues cross-functional collaboration\u003c/li\u003e\n\u003cli\u003eValues a diverse workplace\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRESPONSIBILITIES\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop the apps that stream TED’s media to millions of users\u003c/li\u003e\n\u003cli\u003eDevelop conference technology apps that facilitate first-class conference experiences both in-person and remotely\u003c/li\u003e\n\u003cli\u003eDevelop and maintain the backend systems that support the apps, with an eye towards performance and scale.\u003c/li\u003e\n\u003cli\u003eExperiment with new technologies and share discoveries with the team\u003c/li\u003e\n\u003cli\u003eFoster growth and support other engineers through constructive, collaborative code reviews\u003c/li\u003e\n\u003cli\u003eClearly communicate technical constraints and opportunities with stakeholders\u003c/li\u003e\n\u003cli\u003eWillingness to contribute however possible to ensure overall effectiveness of position\u003c/li\u003e\n\u003cli\u003eOther duties and special projects as may be assigned from time to time\u003c/li\u003e\n\u003cli\u003eTravel: Upon request / as needed\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFull health benefits (medical, dental, vision) 100% paid by TED for employees\u003c/li\u003e\n\u003cli\u003ePaid family leave\u003c/li\u003e\n\u003cli\u003eWork-life balance encouraged (TED closes for a 2-week summer break and 1-week winter break plus you're eligible for additional paid time off)\u003c/li\u003e\n\u003cli\u003eFree OneMedical and SpringHealth membership for you and your dependents to address physical and mental well-being\u003c/li\u003e\n\u003cli\u003e401k with match\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://tedconferencesllc.applytojob.com/apply/OBE9Tvozdc/Senior-Software-Engineer-Mobile\"\u003ehttps://tedconferencesllc.applytojob.com/apply/OBE9Tvozdc/Senior-Software-Engineer-Mobile\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcUtjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fe5d88b7c955266687c596b859d60c5872682ff5/logo.png"},{"id":"0087d98f-54fa-4783-a565-f24d2bda46f8","type":"Full Time","url":"https://jobs.github.com/positions/0087d98f-54fa-4783-a565-f24d2bda46f8","created_at":"Mon Mar 15 20:53:57 UTC 2021","company":"TED Conferences","company_url":"http://ted.com","location":"Remote","title":"Backend Engineer","description":"\u003cp\u003e\u003cstrong\u003ePOSITION OVERVIEW\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTED stages conferences and produces video media that it brings to millions of people around the world, through web media and other platforms. As a Back-End Engineer, you will be responsible for the backend systems that power our  user-facing experiences that power a lasting archive of ideas. You will work directly with experience designers and product owners to take new features from conception to production.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eQUALIFICATIONS / SKILLS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years Ruby on Rails experience, including gem development or rails engines\u003c/li\u003e\n\u003cli\u003e8+ years overall professional experience in software development\u003c/li\u003e\n\u003cli\u003eExperienced in relational and document-based databases\u003c/li\u003e\n\u003cli\u003eStrong focus on code-quality, documentation, test-driven development, performance, scalability, monitoring, and readability\u003c/li\u003e\n\u003cli\u003eAble to debug and test problems through complex interconnected HTTP based services.\u003c/li\u003e\n\u003cli\u003eExperienced with Devops technologies including Docker/AWS\u003c/li\u003e\n\u003cli\u003eCurious and knowledgeable about web technologies and frameworks.\u003c/li\u003e\n\u003cli\u003eAble to refactor legacy projects in addition to greenfield development\u003c/li\u003e\n\u003cli\u003eStrong ownership of work with the ability to drive projects from inception through to completion, balancing doing it right and doing it fast\u003c/li\u003e\n\u003cli\u003eValues cross-functional collaboration and a diverse workplace\u003c/li\u003e\n\u003cli\u003eFamiliarity with git, version control, and Unix/Linux command line best practices\u003c/li\u003e\n\u003cli\u003eExperienced in building APIs for internal and public consumption, JSON:API or GraphQL a plus.\u003c/li\u003e\n\u003cli\u003eSome experience with Javascript backend technology: Express/Node a plus\u003c/li\u003e\n\u003cli\u003eSome experience in Javascript, CSS, HTML, and related Web APIs a plus\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRESPONSIBILITIES\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAnalyze user requirements and design solutions for new features\u003c/li\u003e\n\u003cli\u003eDesign tools and libraries that will be used by other back-end engineers and company-wide\u003c/li\u003e\n\u003cli\u003eManage and monitor back-end testing, performance, and code quality\u003c/li\u003e\n\u003cli\u003eInfluence and guide the direction of our products and back-end technology\u003c/li\u003e\n\u003cli\u003eExperiment with new technologies and share discoveries with the team\u003c/li\u003e\n\u003cli\u003eFoster growth and support other back-end engineers through constructive, collaborative code reviews\u003c/li\u003e\n\u003cli\u003eClearly communicate technical constraints and opportunities with stakeholders\u003c/li\u003e\n\u003cli\u003eWillingness to contribute however possible to ensure overall effectiveness of position\u003c/li\u003e\n\u003cli\u003eOther duties and special projects as may be assigned from time to time\u003c/li\u003e\n\u003cli\u003eTravel: Upon request / as needed\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFull health benefits (medical, dental, vision) 100% paid by TED for employees\u003c/li\u003e\n\u003cli\u003ePaid family leave\u003c/li\u003e\n\u003cli\u003eWork-life balance encouraged (TED closes for a 2-week summer break and 1-week winter break plus you're eligible for additional paid time off)\u003c/li\u003e\n\u003cli\u003eFree OneMedical and SpringHealth membership for you and your dependents to address physical and mental well-being\u003c/li\u003e\n\u003cli\u003e401k with match\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://tedconferencesllc.applytojob.com/apply/2P4djygxG9/Backend-Engineer\"\u003ehttps://tedconferencesllc.applytojob.com/apply/2P4djygxG9/Backend-Engineer\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcUNjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0780a286056eee07db5fb1ed6ae460f6a49f3986/logo.png"},{"id":"c2982280-da18-4748-9673-8a8c03d51aa6","type":"Full Time","url":"https://jobs.github.com/positions/c2982280-da18-4748-9673-8a8c03d51aa6","created_at":"Mon Mar 15 20:51:41 UTC 2021","company":"TED Conferences","company_url":"http://ted.com","location":"Remote","title":"Product Manager","description":"\u003cp\u003e\u003cstrong\u003eABOUT THE ROLE\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re looking for a Product Manager to play a key role on the Digital Products team at TED, focused specifically on building out, and iterating upon, TED’s conference technology.\u003c/p\u003e\n\u003cp\u003eTED conferences are global events that showcase research and ideas from all disciplines. Conference programs are designed for attendees and speakers from vastly different fields to connect and draw inspiration from unlikely places. You’ll be involved in building the tools that help create the magic of TED.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRESPONSIBILITIES\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCollaborate with other product managers, designers, and engineers to scope and implement solutions for TED’s in-person and virtual conference communities\u003c/li\u003e\n\u003cli\u003eDefine product vision through problem/opportunity definition, business goals, market and user research, and stakeholder management\u003c/li\u003e\n\u003cli\u003ePartner with TED’s internal stakeholders and subject-matter experts to set priorities, orchestrate product development schedule/roadmap, and manage and communicate prioritization\u003c/li\u003e\n\u003cli\u003eCoordinate all aspects of product delivery, including: release planning, change/dependency management, user acceptance testing, go-to-market/rollout operations, and product marketing\u003c/li\u003e\n\u003cli\u003eCommunicate updates and outcomes regularly to senior leadership across the organization\u003c/li\u003e\n\u003cli\u003eContribute to the broader culture and progress of the Digital Products team, and TED overall (e.g., through Employee Resource Groups, Hack Weeks, and team summits)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSKILLS / EXPERIENCE\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e2-5 years of product management experience\u003c/li\u003e\n\u003cli\u003eProficient with the product development lifecycle and tools of the trade (discovery, user research, requirements gathering, prioritization, usability testing, data analysis, QA, etc.)\u003c/li\u003e\n\u003cli\u003eCan generally understand impact vs. effort required for projects and are capable of discussing requirements and tradeoffs with engineers\u003c/li\u003e\n\u003cli\u003eHave partnered with designers to develop exceptional user experiences that have had successful business outcomes\u003c/li\u003e\n\u003cli\u003eLove tackling complex problems in ambiguous environments and have the grit and creativity to get to a great solution\u003c/li\u003e\n\u003cli\u003eComfortable assuming multiple roles, keeping pace with shifting priorities, and maintaining your own work queue\u003c/li\u003e\n\u003cli\u003eDetail-oriented, adaptable, and curious, with an ability to gather information by clearly articulating questions and escalating for help, when needed\u003c/li\u003e\n\u003cli\u003ePreferred: Experience with SaaS products, data integration, and/or service design\u003c/li\u003e\n\u003cli\u003eYour current location is flexible, but you’ll need to work U.S. east coast hours. Once it is safe, you can be based out of, or at least need to periodically travel to, TED’s Manhattan office.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHY WORK FOR US\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTED is a global community, welcoming people from every discipline and culture who seek a deeper understanding of the world. We believe passionately in the power of ideas to change attitudes, lives and, ultimately, the world. TED began in 1984 as a conference where Technology, Entertainment and Design converged, and today covers almost all topics — from science to business to global issues — in more than 100 languages. Everything we do is driven by this goal: How can we best spread great ideas?\u003c/p\u003e\n\u003cp\u003eIn addition to driving forward TED’s mission and joining our dynamic Digital Products team, we’re proud to provide strong employee benefits, including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFull health benefits (medical, dental, vision) 100% paid by TED for employees\u003c/li\u003e\n\u003cli\u003eWork-life balance encouraged (TED closes for a 2-week summer break and 1-week winter break plus you're eligible for additional paid time off)\u003c/li\u003e\n\u003cli\u003eFree OneMedical and SpringHealth membership for you and your dependents to address physical and mental well-being\u003c/li\u003e\n\u003cli\u003ePaid family leave\u003c/li\u003e\n\u003cli\u003e401(k) with match\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://tedconferencesllc.applytojob.com/apply/QDthIaKN2U/Product-Manager\"\u003ehttps://tedconferencesllc.applytojob.com/apply/QDthIaKN2U/Product-Manager\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcDZjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a46180f510ed485d575bd82f1340ac6b2176bccd/logo.png"},{"id":"6515f4c1-bd15-4c67-8dde-2283d992141e","type":"Full Time","url":"https://jobs.github.com/positions/6515f4c1-bd15-4c67-8dde-2283d992141e","created_at":"Mon Mar 15 20:48:37 UTC 2021","company":"TED Conferences","company_url":"http://http","location":"Remote","title":"Product Designer","description":"\u003cp\u003e\u003cem\u003eABOUT THE ROLE\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eWe’re looking for a Product Designer to play a key role on the Digital Products team at TED. You’ll work on complex design projects that touch millions of users – from conference technology, web and mobile experiences, and supporting our many community and social impact initiatives.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePlease include a portfolio with your application (with password, if necessary).\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eRESPONSIBILITIES\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDefine the end-to-end user experience on various products serving a variety of user needs, increasing engagement, strengthening community, and driving the impact of ideas\u003c/li\u003e\n\u003cli\u003eDrive projects forward from whiteboard sketching to high-fidelity final treatments\u003c/li\u003e\n\u003cli\u003ePlan and execute user research, deploying all the tools in your arsenal to understand user pain points, motivations, habits, and workflows\u003c/li\u003e\n\u003cli\u003eRapidly produce multiple concepts and prototypes, recognizing that there is rarely “one right answer” and there is value in exploring trade-offs\u003c/li\u003e\n\u003cli\u003eCollaborate with other Product Designers as well as Product Managers, Engineers, and other stakeholders, both informally and through participation in structured reviews and Design Sprints\u003c/li\u003e\n\u003cli\u003eDefine critical user journeys and promote a culture of product design excellence not only inside the Digital Products team, but also across TED more broadly\u003c/li\u003e\n\u003cli\u003eChampion user experience and advocate for design and user research best practice across the organisation, helping to build our design team culture, processes, and systems\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eSKILLS / EXPERIENCE\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e2-5 years of experience in product design\u003c/li\u003e\n\u003cli\u003eFluency in a broad range of software design disciplines, including interaction design, information architecture, and visual design; familiarity with motion design and native app design\u003c/li\u003e\n\u003cli\u003eExperience leading complex design efforts from ideation through prototyping, refinement, iteration, user testing, launch, post-launch maintenance, and turndowns when necessary\u003c/li\u003e\n\u003cli\u003eTrack record of successful collaboration with Product Managers, Engineers, and stakeholders (preferably with both in-person and distributed teams)\u003c/li\u003e\n\u003cli\u003eTrack record of leveraging design systems, design tools (e.g., Figma, Miro, usertesting.com), and user research to accelerate iteration and development\u003c/li\u003e\n\u003cli\u003eStrong communication, curiosity, collaboration, and perspective-taking skills – eager to understand the goals, values, and constraints of others, whether they are TED staff, partners, users, or beyond\u003c/li\u003e\n\u003cli\u003eMission-driven and keen to support and grow our global community, welcoming people from every discipline and culture who seek a deeper understanding of the world\u003c/li\u003e\n\u003cli\u003eDesire to work in a fast-paced environment where we navigate the complexities of both scale (especially on ted.com) and crafted experience (especially for our conferences)\u003c/li\u003e\n\u003cli\u003eYour current location is flexible, but you’ll need to work U.S. east coast hours. Once it is safe, this position can be based in TED’s Manhattan office, though we will also consider candidates who would indefinitely work remotely.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eWHY WORK FOR US\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eTED is a global community, welcoming people from every discipline and culture who seek a deeper understanding of the world. We believe passionately in the power of ideas to change attitudes, lives and, ultimately, the world. TED began in 1984 as a conference where Technology, Entertainment and Design converged, and today covers almost all topics — from science to business to global issues — in more than 100 languages. Everything we do is driven by this goal: How can we best spread great ideas?\u003c/p\u003e\n\u003cp\u003eIn addition to driving forward TED’s mission and joining our dynamic Digital Products team, we’re proud to provide strong employee benefits, including:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFull health benefits (medical, dental, vision) 100% paid by TED for employees\u003c/li\u003e\n\u003cli\u003eWork-life balance encouraged (TED closes for a 2-week summer break and 1-week winter break plus you're eligible for additional paid time off)\u003c/li\u003e\n\u003cli\u003eFree OneMedical and SpringHealth membership for you and your dependents to address physical and mental well-being\u003c/li\u003e\n\u003cli\u003ePaid family leave\u003c/li\u003e\n\u003cli\u003e401(k) with match\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://tedconferencesllc.applytojob.com/apply/cMUIhecUwQ/Product-Designer\"\u003ehttps://tedconferencesllc.applytojob.com/apply/cMUIhecUwQ/Product-Designer\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcHljIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ab3a1d8f9ef5c33d2d080a6182c4a46143e098e8/logo.png"},{"id":"7f4cae42-e5fd-4a43-8834-5c6da3b7b964","type":"Full Time","url":"https://jobs.github.com/positions/7f4cae42-e5fd-4a43-8834-5c6da3b7b964","created_at":"Mon Mar 15 19:00:42 UTC 2021","company":"Tower","company_url":"https://www.git-tower.com","location":"Remote","title":"Content Marketing Developer","description":"\u003cp\u003eWe're looking for a \u003cstrong\u003eContent Marketing Developer\u003c/strong\u003e to join our team. You’ll have the chance to work in many different areas, on websites that are viewed by hundreds of thousands of developers and designers every month.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eLearning Content:\u003c/strong\u003e We love to learn new things. That's why we love to help our users and community learn new things, too. Our \u003ca href=\"https://www.git-tower.com/learn/\"\u003elearning content\u003c/a\u003e on Git and lots of other development topics is read by over half a million people every month. This allows you to learn lots of new things - and teach them to our community at the same time! The content you produce can take many forms (blog + guest posts, tutorials, videos, webinars…) and be about any topic that’s interesting for our community.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eGrowth Marketing:\u003c/strong\u003e Besides creating new content, we also work hard to make our existing content more successful: email automations, SEO, A/B tests, performance improvements, professional popup campaigns, and countless little improvements help us optimize our projects and content all the time.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eTech \u0026amp; Tools:\u003c/strong\u003e We’re using a broad, modern collection of tools for our marketing: you’ll find Google Analytics, ActiveCampaign, Ahrefs, OptinMonster, and many more in your tool belt.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003e\u003cstrong\u003eWebsite Development:\u003c/strong\u003e We have a multitude of cool web projects that evolve quickly: the \u003ca href=\"https://www.git-tower.com/\"\u003eTower website\u003c/a\u003e and \u003ca href=\"https://www.git-tower.com/blog\"\u003eblog\u003c/a\u003e, our \u003ca href=\"https://www.git-tower.com/learn\"\u003elearning platform\u003c/a\u003e, the \u003ca href=\"https://www.git-tower.com/help\"\u003eTower online help\u003c/a\u003e, and \u003ca href=\"https://www.git-tower.com/blog/history-of-macos/\"\u003emany\u003c/a\u003e \u003ca href=\"https://www.git-tower.com/blog/tech-animals/\"\u003especial\u003c/a\u003e \u003ca href=\"https://www.git-tower.com/blog/developer-manifesto/\"\u003eprojects\u003c/a\u003e. You'll work with static-site generators and lots of modern Sass / CSS, Javascript, and Ruby.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch1\u003e\u003cstrong\u003eSkills \u0026amp; Requirements\u003c/strong\u003e\u003c/h1\u003e\n\u003cul\u003e\n\u003cli\u003e3+ years experience in web development\u003c/li\u003e\n\u003cli\u003eFluent in English\u003c/li\u003e\n\u003cli\u003eAdvanced knowledge of Git and version control\u003c/li\u003e\n\u003cli\u003eExperience with HTML5, CSS / Sass, JavaScript\u003c/li\u003e\n\u003cli\u003eExperience with at least one programming language (PHP, Ruby, Go, JavaScript, Swift…)\u003c/li\u003e\n\u003cli\u003eYou are a good and mindful communicator\u003c/li\u003e\n\u003cli\u003eYou are open to learn our toolchain (e.g. GitHub, Heroku, Zendesk, ActiveCampaign, Postmark and their APIs)\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch1\u003e\u003cstrong\u003eYou\u003c/strong\u003e\u003c/h1\u003e\n\u003cul\u003e\n\u003cli\u003every reliable \u0026amp; thorough: you accept responsibility for your own work and its quality\u003c/li\u003e\n\u003cli\u003ehungry to be part of a team that creates things that matter\u003c/li\u003e\n\u003cli\u003eself-motivated and capable of working remotely\u003c/li\u003e\n\u003cli\u003eopen to discussions and a mindful communicator\u003c/li\u003e\n\u003cli\u003ewilling to be part of a team \u0026amp; yet able to work independently\u003c/li\u003e\n\u003cli\u003epaying attention to detail\u003c/li\u003e\n\u003cli\u003eopen-minded and respectful – regarding people, technologies and projects\u003c/li\u003e\n\u003cli\u003ehappy to become part of a small, international team of friendly \u0026amp; skilled professionals\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch1\u003e\u003cstrong\u003eAbout us\u003c/strong\u003e\u003c/h1\u003e\n\u003cp\u003eLearn more \u003ca href=\"https://www.git-tower.com/company/jobs/\"\u003eabout us\u003c/a\u003e and \u003ca href=\"https://www.git-tower.com/blog/how-we-work/\"\u003ehow we work\u003c/a\u003e. We'are looking forward to hearing from you!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply via \u003ca href=\"https://www.git-tower.com/company/jobs\"\u003ehttps://www.git-tower.com/company/jobs\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcG1jIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b0349c87f00cba7490638e045dc431aaf612ea28/tower-dock-icon_transparent@2x.png"},{"id":"9226d83b-e35c-4dc8-abf3-44bdd1934904","type":"Full Time","url":"https://jobs.github.com/positions/9226d83b-e35c-4dc8-abf3-44bdd1934904","created_at":"Mon Mar 15 18:50:55 UTC 2021","company":"Senorics GmbH","company_url":"http://www.senorics.com","location":"Dresden ","title":"(Senior) Software Engineer","description":"\u003cp\u003eSenorics is a start-up from Dresden, Germany, founded in 2017. Our vision is to make NIR spectroscopy an integral part of daily life, accessible for everyone. This is only possible with our team, consisting of a steadily growing number of people, all experts in their field.\u003c/p\u003e\n\u003cp\u003eIn order to help our customers worldwide to use our sensor devices to their full potential, we are hiring experienced software developers for different fields. You get the opportunity to become a part of our highly motivated and experienced startup-team. We provide a vibrant atmosphere and the perfect conditions to develop yourself and your career.\u003c/p\u003e\n\u003cp\u003eThe Tasks\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDeveloping AWS based backends for our end-customer software applications\u003c/li\u003e\n\u003cli\u003eDeveloping SpringBoot based middleware for internal data processing\u003c/li\u003e\n\u003cli\u003eDeveloping cross-platform frontends for our end-customers for mobile and desktop applications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYour Profile\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eB.Sc. in Computer Science, Natural Science, Engineering or equivalent experience\u003c/li\u003e\n\u003cli\u003eAt least 3+ years of experience in software engineering\u003c/li\u003e\n\u003cli\u003eHands-on experience with Java Script, respectively AWS\u003c/li\u003e\n\u003cli\u003eExperience in agile practices and software development tools\u003c/li\u003e\n\u003cli\u003eFluent English, working knowledge of software development practices and technologies\u003c/li\u003e\n\u003cli\u003eStrong verbal and written communications skills\u003c/li\u003e\n\u003cli\u003eTeam player\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat We Offer: Exciting insights into our technology, flat hierarchies, self-reliant work with flexible working hours and mobile working, steep learning curves as well as fun and start-up atmosphere.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease view and apply via jobs.senorics.com\u003c/p\u003e\n\u003cp\u003eSend us your CV and give us your motivation, thanks!\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcFdjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--41d0aadaf0492d8904c99220dd5c9b0026dfb8a5/senorics_long_RGB.jpg"},{"id":"6d3ce9dc-864f-4a00-8a08-d1dee72d6ece","type":"Full Time","url":"https://jobs.github.com/positions/6d3ce9dc-864f-4a00-8a08-d1dee72d6ece","created_at":"Mon Mar 15 17:29:00 UTC 2021","company":"Marketcircle","company_url":"https://www.marketcircle.com/","location":"US - Remote","title":"Senior Software Developer (Apple Platforms)","description":"\u003cp\u003eWant to work remotely? Want to make an impact by working for a small company that values autonomy and working collaboratively in a team to solve challenging problems? Love learning new technology? Then you'll fit right into the Marketcircle Team!\u003c/p\u003e\n\u003cp\u003eWe are looking for someone who excels at software design, execution, coaching others for the development of our Daylite apps. As part of this role you will be a key individual contributor to building Daylite for macOS and iOS.\u003c/p\u003e\n\u003cp\u003eTo ensure success as a Senior Software Developer for Apple Platforms, you should have an extensive track record of shipping apps for macOS and/or iOS and have experience working with AppKit and UIKit, Objective-C and Swift. Bonus points for experience with SwiftUI.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eSoftware design and development of new functionality in Daylite for macOS and iOS\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eMaintaining and improving the software quality of Daylite\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWriting and maintaining reliable Objective-C and Swift code\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eSupporting and coaching up developers\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eHave 8+ years of development experience\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExtensive experience building macOS and/or iOS apps\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBachelor’s degree in Computer Science, Computer Engineering or related field\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eProficiency with code versioning tools: Git, GitHub\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eFamiliarity with MVC, declarative programming, relational databases, REST APIs, and testing tools\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAre comfortable working remotely (100% remote work environment, but located within Canada or US) as well as being comfortable working both independently and collaboratively\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.lever.co/marketcircle/3e5f06e0-2cb3-4bf9-829b-b08b4da032ee\"\u003ehttps://jobs.lever.co/marketcircle/3e5f06e0-2cb3-4bf9-829b-b08b4da032ee\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcE9jIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c0e1437a7f2d48f861df7a78ce98f9a85d3e1e2e/MarketcircleLogotypeBlack.png"},{"id":"6df201fb-57e7-4a53-9a35-6878ac8d5522","type":"Full Time","url":"https://jobs.github.com/positions/6df201fb-57e7-4a53-9a35-6878ac8d5522","created_at":"Mon Mar 15 17:26:37 UTC 2021","company":"Per Angusta","company_url":"http://http","location":"Villeurbanne, France - Remote possible","title":" Senior Ruby on Rails Developer","description":"\u003cp\u003eAbout Per Angusta\u003c/p\u003e\n\u003cp\u003eWe are developing two SaaS solutions, one dedicated to Procurement Performance Management and the other intended to support procurement strategies for large and international companies. The solution already has 11,000 users in more than 100 countries.\u003c/p\u003e\n\u003cp\u003eOur team is composed of 22 people based in France, USA, UK, and Germany. Working remotely is not a problem at Per Angusta.\u003c/p\u003e\n\u003cp\u003eOur company is constantly taking on new challenges and our latest fund-raising efforts have allowed us to accelerate our international growth, achieve our ambitious objectives, and maintain the satisfaction of our users.\u003c/p\u003e\n\u003cp\u003eWe plan to double our workforce this year! We need builders and seniors’ profiles.\u003c/p\u003e\n\u003cp\u003eJob Description\u003c/p\u003e\n\u003cp\u003eOur technical team\nWe are an enthusiastic team with 10 passionate engineers, composed of one Product Owner, one Front-end / UX, six full- stack developers, and two back-end developers. We plan to double that number.\u003c/p\u003e\n\u003cp\u003eOur technical challenges are:\u003c/p\u003e\n\u003cp\u003eWe are currently undergoing in a certification process which has an impact on technical requirements, such as structure and security protocols. \u2028\nInternational growth impacts our daily work and sales approach as we work to accommodate global needs and standards.\u2028\nWe have a fast-growing team with the need to constantly develop and upgrade our skills, and be flexible to meet new and varying challenges. \u2028\nFind more information on our approaches, methods and technical stack : \u003ca href=\"https://www.per-angusta.com/en/our-engineering-team/\"\u003ehttps://www.per-angusta.com/en/our-engineering-team/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eYour mission\u003c/p\u003e\n\u003cp\u003eThe Lead ROR Developer reports directly to the CTO and has a high level of autonomy. You are the driving force behind developments and technical choices.\u003c/p\u003e\n\u003cp\u003eYou share skills and knowledge with other developers, lead them to engage in thoughtful action, and review their code using best practices and pedagogy. You continue to develop our best practices, documentation, tools, and provide an encouraging environment to support our juniors to progress and become our future seniors.\u003c/p\u003e\n\u003cp\u003eYou should be able to find vulnerabilities in code you don’t own and able to make effective decisions about managing technical debt when relevant.\u003c/p\u003e\n\u003cp\u003eA Lead ROR Developer makes sure the test suite is green and its coverage is maintained, all while deploying daily in all environments from staging to production.\u003c/p\u003e\n\u003cp\u003eYou are responsible for individual efficiency. You should feel comfortable with fast developments, such as proofs of concept, but also support the development of final products to quickly create value and support the efforts of sales\u003c/p\u003e\n\u003cp\u003eYou will work hand in hand with our PO to develop new features, new projects and enforce our project management tools and methods.\u003c/p\u003e\n\u003cp\u003ePreferred Experience\u003c/p\u003e\n\u003cp\u003eYour skills\nLead ROR Developers will share our four4 values:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe bold in technical solutions and innovation., \u2028\u003c/li\u003e\n\u003cli\u003eBe passionate about our company and the work we do., \u2028\u003c/li\u003e\n\u003cli\u003eBe an authentic contributor. \u2028\u003c/li\u003e\n\u003cli\u003eBe a team player.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe don’t focus on educational background., We are seeking enthusiastic people with technical savvy and a creative approach solving problems.\u003c/p\u003e\n\u003cp\u003eThis position requires strong experience in Ruby on Rails development with specific application in a SaaS software company.\u003c/p\u003e\n\u003cp\u003eThe following describes a lead ROR Developer:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePrograming a high quality of code is important to you. \u2028\u003c/li\u003e\n\u003cli\u003eYou are involved in the Ruby on Rails community. \u2028\u003c/li\u003e\n\u003cli\u003eYou like sharing knowledge and are actively working to expand your knowledge every day. \u2028\u003c/li\u003e\n\u003cli\u003eYou enjoy writing public blog posts with the support of the tech team to demonstrate your commitment, expertise, and to share your experiences. \u2028\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSome of our developers also teach in schools or speak at conferences to share what they have learned. We encourage all team members to do the same.\u003c/p\u003e\n\u003cp\u003e*Life is made of opportunity *\nDo you feel like your profile doesn’t match this description, but you suspect we could make things great together? Send us an application anyway!\u003c/p\u003e\n\u003cp\u003eOur interview process\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFirst Call with talent acquisition to precise your wishes, RH stuff and have a short team presentation\u003c/li\u003e\n\u003cli\u003eFirst interview with member of the technical team to learn about the team and discover if we align in our expectations of work and company culture.\u003c/li\u003e\n\u003cli\u003eSecond interview with our Head of Technology to discuss technical constraints in further detail, the vision of our company, and your role on the team.\u003c/li\u003e\n\u003cli\u003eFinally, you’ll have the opportunity to speak with our CEO, Pierre Lapree, and talk about Per Angusta’s global strategy.\nThis process can potentially be done quickly, within 1-2 weeks, depending on availability. We are efficient when possible, but we don't rush. Every proposal is thoughtful!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAdditional Information\nContract Type: Full-Time\nStart Date: 02 May 2021\nLocation: Villeurbanne, France (69100)\nExperience: \u0026gt; 5 years\nPossible full remote\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eJust send an email to \u003ca href=\"mailto:charlotte.bennetot@per-angusta.com\"\u003echarlotte.bennetot@per-angusta.com\u003c/a\u003e!\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEdjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6f5cf4029518004fd0f38b0682c70a95b285ab5c/Per%20Angusta%20logo.jpg"},{"id":"2bbd8791-4e73-42b8-a311-ae726c942c75","type":"Full Time","url":"https://jobs.github.com/positions/2bbd8791-4e73-42b8-a311-ae726c942c75","created_at":"Mon Mar 15 17:25:59 UTC 2021","company":"Marketcircle","company_url":"https://www.marketcircle.com/","location":"US- Remote","title":"Sr. Backend Developer","description":"\u003cp\u003eWant to work remotely? Want to make an impact by working for a small company that values autonomy and working collaboratively in a team to solve challenging problems? Love learning new technology? Then you'll fit right into the Marketcircle Team!\u003c/p\u003e\n\u003cp\u003eMarketcircle is looking for some Sr. Backend Software Developers. Join as a key member of our team responsible for building and supporting the services and infrastructure for the Daylite CRM Platform.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eQualified candidates:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eHave 8+ years of experience\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHold a B.Sc Computer Science or B.Eng Software, or equivalent work experience.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperienced using Postgres, Rails (Ruby), Django (Python), Kubernetes, nginx, Redis, Kafka,\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHashiCorp Suite, Graylog, Sinatra, Prometheus, istio, grafana, CalDAV \u0026amp; CardDav, AWS, and Elasticsearch\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAre comfortable working remotely (100% remote work environment) as well as being comfortable working both independently and collaboratively.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBonus points for:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with infrastructure management tools (like Puppet, Ansible or Chef)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with cloud infrastructure providers (like AWS, Google Cloud, Microsoft Azure or DigitalOcean)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eKnowing your way around the network stack, from HTTP to TCP to IP and have a solid understanding\nof security (TLS/ IPSec/Firewalls)\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eThings you might be working on:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eRESTful interfaces to persist data for our client apps\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAuthentication and payment backends\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePostgreSQL database(s) with custom extensions\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eElasticsearch indexing and search\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eNote: there will be occasional on-call duties.\u003c/p\u003e\n\u003cp\u003eMarketcircle Inc. is a fun and distributed tech company. We believe in the power of Kaizen, teamwork, creativity, ownership, and empathy. By embodying these core values we know we impact the lives of our customers, and each other.\u003c/p\u003e\n\u003cp\u003eOur mission is to empower small business worldwide which drives us to develop a native macOS and iOS app that helps thousands create organization of what would otherwise be chaos.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.lever.co/marketcircle/42848e2d-cb30-46cf-96d6-0a8c0e0a21ff\"\u003ehttps://jobs.lever.co/marketcircle/42848e2d-cb30-46cf-96d6-0a8c0e0a21ff\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbytjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--879a1c862a3d5e3b76a1fae145451b9bd2f1b4d7/MarketcircleLogotypeBlack.png"},{"id":"b65fa76e-c33c-4bee-abd1-701c0b357ad2","type":"Full Time","url":"https://jobs.github.com/positions/b65fa76e-c33c-4bee-abd1-701c0b357ad2","created_at":"Mon Mar 15 15:35:17 UTC 2021","company":"ownCloud GmbH","company_url":"https://www.owncloud.com","location":"Nuremberg, Remote","title":"Android Software Developer","description":"\u003cp\u003eownCloud is an open-source file sharing software designed and built to give businesses and individuals control over their data and sovereign workspaces. With a team of more than 70 people, we develop the ownCloud server, the sync clients, our mobile apps and the web interface to enable secure and effective file collaboration across companies, organizations, administrations, institutions and families. We also implement customized solutions for enterprises and directly manage and maintain ownCloud instances. With over 100 million users worldwide, ownCloud is the market-leading open-source software for content collaboration.\u003c/p\u003e\n\u003cp\u003eAs an Android developer with the ownCloud Engineering team, you will help build and improve our open-source enterprise-grade mobile applications. The ownCloud mobile apps for Android and iOS are an increasingly important part of the ownCloud experience – a sovereign file platform that makes it easy and secure for users to access, manage and share their data.\u003c/p\u003e\n\u003ch2\u003eYour responsibilities\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eYou develop and improve an existing premium app for the Android mobile platform that enables users to store, sync and share their data. You design and implement of new features. You extend and debug the existing open source code base of the ownCloud Android App.\u003c/li\u003e\n\u003cli\u003eYou will be working in a group with other Android developers and in a larger team of other engineers that work on the iOS App and the Desktop Client. Together with the other engineering teams, your team ensures that ownCloud delivers a consitent and helpful experience to out more than 100 million users around the world.\u003c/li\u003e\n\u003cli\u003eYour development workflow will be based on git, review processes and continuous integration.\u003c/li\u003e\n\u003cli\u003eYou will act as an open source player that shows an open, cooperative and responsive attitude to internal, external and enterprise communities.\u003c/li\u003e\n\u003cli\u003eYou will participate in the release process and carry out code maintenance.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eYour core competencies\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eYou have a degree in engineering or computer science, or any other IT related education, and ideally three years of work experience.\u003c/li\u003e\n\u003cli\u003eYou have actively programmed Android mobile apps for more than one year.\u003c/li\u003e\n\u003cli\u003eYou are well-versed in Android-specific functions for security, performance and enterprise use, for example Android for Work, MDM/EMM configuration (Appconfig.org), Scoped Storage and other enterprise-relevant features of the Android platform.\u003c/li\u003e\n\u003cli\u003eYou love to learn about new Android features and watch Android Dev space closely.\u003c/li\u003e\n\u003cli\u003eYou enjoy proposing your design ideas for architecture and GUI to the team.\u003c/li\u003e\n\u003cli\u003eYou take the responsiblity for parts of the software stack.\u003c/li\u003e\n\u003cli\u003eYou like to work in teams and are comfortable with modern workflows.\u003c/li\u003e\n\u003cli\u003eYour written and spoken English allows for effective communication.\u003c/li\u003e\n\u003cli\u003eBeing an experienced open source contributor is a big plus\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eCulture of work\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eAs a remote-equal comany with distributed teams, we believe that not everyone’s most productive workspace is the office. You can work remotely. If you prefer to work in an office, we maintain ours in Nuremberg, Bavaria\u003c/li\u003e\n\u003cli\u003eWe are hackers, coders and nerds. We have a contagious passion and inner enthusiasm for our work and our role\u003c/li\u003e\n\u003cli\u003eWe are constantly on the hunt for new solutions, unexpected connections and unforeseen possibilities. We are open to new experiences, explore new ideas and uncover even the last hack and trick along the way\u003c/li\u003e\n\u003cli\u003eWe believe that we are only as good as our next project. We encourage a culture of flat hierarchies, with great opportunities to move things forward. We build on flexibility and a sense of openness to change\u003c/li\u003e\n\u003cli\u003eBeing part of the ownCloud team is like joining a tribe. Meet us occasionally after work for a burger or billards. Or, in the current environment, a socially distanced beer in BigBlueButton\u003c/li\u003e\n\u003cli\u003eownCloud is open-source and community driven. It’s the people who make this place to what it is. Join our quest to give businesses and individuals control over their data!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are looking forward to getting to know you! Send your resume to \u003ca href=\"mailto:work@owncloud.com\"\u003ework@owncloud.com\u003c/a\u003e, and tell us why you’d like to work for ownCloud.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:work@owncloud.com\"\u003ework@owncloud.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3VjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--dea9bb71b193b0bae307b7668245d665f41b9007/owncloud_logo-420.png"},{"id":"8be02cee-e2f8-4821-8870-c74c521ff675","type":"Full Time","url":"https://jobs.github.com/positions/8be02cee-e2f8-4821-8870-c74c521ff675","created_at":"Mon Mar 15 15:28:05 UTC 2021","company":"ownCloud GmbH","company_url":"https://www.owncloud.com","location":"Nuremberg, Remote","title":"Desktop Software Developer C++/Qt","description":"\u003cp\u003eownCloud is an open-source file sharing software designed and built to give businesses and individuals control over their data. With a team of more than 70 people, we develop the ownCloud server, the sync clients, our mobile apps and the web interface to enable secure and effective file collaboration across companies, organizations, administrations, institutions and families. We also implement customized solutions for enterprises and directly manage and maintain ownCloud instances. With over 100 million users worldwide, ownCloud is the market-leading open-source software for content collaboration.\u003c/p\u003e\n\u003cp\u003eAs a C++ developer with the ownCloud Engineering team, you will help build and improve our open-source enterprise-grade file synchronization software. The ownCloud Desktop Client is cross-platform open source software for Windows, macOS and Linux, using the Qt class library extensively.\u003c/p\u003e\n\u003cp\u003eTo make best use of the features specific to the operating systems, we are also using native APIs where needed, for example for file access or virtual files.\u003c/p\u003e\n\u003ch2\u003eYour responsibilities\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eYou design and review new approaches to building a great ownCloud experience on all relevant desktop systems.\u003c/li\u003e\n\u003cli\u003eYou code new features, improve existing ones and fix bugs.\u003c/li\u003e\n\u003cli\u003eYou support the testing strategy by implementing tests on various levels.\u003c/li\u003e\n\u003cli\u003eYou set up test environments to analyze complex http based protocol flows.\u003c/li\u003e\n\u003cli\u003eYou collaborate with other client developers, ie. for mobile apps, to find consistent solutions.\u003c/li\u003e\n\u003cli\u003eYou embrace our git-based development workflow and help review software.\u003c/li\u003e\n\u003cli\u003eYou participate in the software lifecycle with testing, releasing and maintaining.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eYour core competencies\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eYou have a degree in engineering or computer science, or any other IT related education, and ideally three years of work experience.\u003c/li\u003e\n\u003cli\u003eYou have actively developed with C, C++ 11 or higher and ideally Qt.\u003c/li\u003e\n\u003cli\u003eYou have worked in teams that provide production-grade software.\u003c/li\u003e\n\u003cli\u003eYou bring a cross-platform mindset.\u003c/li\u003e\n\u003cli\u003eYou are familiar with the Windows C++ API.\u003c/li\u003e\n\u003cli\u003eYou like to work in teams and are comfortable with modern workflows.\u003c/li\u003e\n\u003cli\u003eYour written and spoken English allows for effective communication.\u003c/li\u003e\n\u003cli\u003eBeing an experienced open source contributor is a big plus\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eCulture of work\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eAs a remote-equal company with distributed teams, we believe that not everyone’s most productive workspace is the office. You can work remotely. If you prefer to work in an office, we maintain ours in Nuremberg, Bavaria\u003c/li\u003e\n\u003cli\u003eWe are hackers, coders and nerds. We have a contagious passion and inner enthusiasm for our work and our role\u003c/li\u003e\n\u003cli\u003eWe are constantly on the hunt for new solutions, unexpected connections and unforeseen possibilities. We are open to new experiences, explore new ideas and uncover even the last hack and trick along the way\u003c/li\u003e\n\u003cli\u003eWe believe that we are only as good as our next project. We encourage a culture of flat hierarchies, with great opportunities to move things forward. We build on flexibility and a sense of openness to change\u003c/li\u003e\n\u003cli\u003eBeing part of the ownCloud team is like joining a tribe. Meet us occasionally after work for a burger or billards. Or, in the current environment, a socially distanced beer in BigBlueButton\u003c/li\u003e\n\u003cli\u003eownCloud is open-source and community driven. It’s the people who make this place to what it is. Join our quest to give businesses and individuals control over their data!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are looking forward to getting to know you! Send your resume to \u003ca href=\"mailto:work@owncloud.com\"\u003ework@owncloud.com\u003c/a\u003e, and tell us why you’d like to work for ownCloud.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:work@owncloud.com\"\u003ework@owncloud.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb21jIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d828436d6899efa166a94a30f364e6f4c10d3bc9/owncloud_logo-420.png"},{"id":"945da79e-9b3f-4333-95a4-5a4e170b5ba1","type":"Full Time","url":"https://jobs.github.com/positions/945da79e-9b3f-4333-95a4-5a4e170b5ba1","created_at":"Mon Mar 15 13:06:49 UTC 2021","company":"Segic","company_url":"https://vonq.io/3vqJLjC","location":"Brossard","title":"Développeur .Net Back-End","description":"\u003ch2\u003eDescription de l'entreprise\u003c/h2\u003e\n\u003cp\u003eSegic est une compagnie informatique jeune et dynamique, spécialisée dans le domaine de l’assurance collective. Notre mission est de révolutionner l’assurance collective en développant une plateforme de gestion innovante axée sur la prévention, la santé collective et les saines habitudes de vie.\u003c/p\u003e\n\u003cp\u003eLa conception infonuagique de notre plateforme et sa commercialisation sous le modèle logiciel en tant que service (SaaS) en font une solution unique dans le marché. Souhaitant répondre aux besoins changeant de sa clientèle, la plateforme Segic est mise à jour, optimisée et améliorée de façon continue.\u003c/p\u003e\n\u003cp\u003eChez Segic, nous accordons beaucoup d’importance au bien-être de nos employés. C’est pourquoi nous privilégions la transparence, la communication ouverte, l’esprit d’équipe, l’attitude positive, la reconnaissance, ainsi que l’humour et le plaisir au travail.\u003c/p\u003e\n\u003ch2\u003eDescription du poste\u003c/h2\u003e\n\u003cp\u003eEn tant que développeur .Net, vous aurez la chance de contribuer à la conception d’une plateforme SaaS en utilisant tous les outils et méthodologies de travail modernes, tels que Microsoft Azure, le DDD, le TDD, l’agile/Scrum et le DevOps, Git, le déploiement en continu avec tests automatisés, le développement en microservices et plus encore.\u003c/p\u003e\n\u003cp\u003eL’écosystème en place vous permettra de passer plus de temps à programmer plutôt qu’à planifier la mise en production de vos nouvelles fonctionnalités. Vous utiliserez Azure DevOps pour créer des applications dans l'infonuagique. Les outils de déploiement en continu vous permettront de livrer chacune de vos nouvelles fonctionnalités dans les environnements de production dès qu’elles seront complétées. Vous participerez à l’amélioration de la sécurité et à la conformité dans l’entreprise.\u003c/p\u003e\n\u003cp\u003eVous aurez la chance de travailler dans un environnement jovial, dynamique, flexible et performant.\u003c/p\u003e\n\u003ch2\u003eDescription de la fonction\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eComme membre d’une équipe de développement, vous participerez activement à chacune des phases de développement liées à la conception de notre plateforme d’assurance collective;\u003c/li\u003e\n\u003cli\u003eVous procéderez à la révision de code des membres de votre équipe ainsi qu'au contrôle de la qualité;\u003c/li\u003e\n\u003cli\u003eVous aurez la responsabilité de maintenir les outils facilitant le déploiement en continu de nos solutions en production;\u003c/li\u003e\n\u003cli\u003eVous participerez aux diagnostics ainsi qu’à la correction des anomalies découvertes dans les environnements de tests et de production;\u003c/li\u003e\n\u003cli\u003eVous aurez la possibilité de fournir votre opinion et de collaborer aux efforts communs afin d’améliorer la qualité et l’efficacité des projets de développement;\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eQualifications\u003c/h2\u003e\n\u003ch2\u003eTechniques\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eBaccalauréat universitaire ou DEC en informatique, génie logiciel, ou l'équivalent;\u003c/li\u003e\n\u003cli\u003eMaîtrise de Visual Studio et d’autres outils de développement .NET;\u003c/li\u003e\n\u003cli\u003eTrès bonne connaissance de C#, NET MVC (Razor), Entity Framework 6 +, LINQ;\u003c/li\u003e\n\u003cli\u003eExpérience avec un outil de gestion de code source, tel que Git, TFS ou SVN (Git privilégié);\u003c/li\u003e\n\u003cli\u003eÊtre innovateur, bon joueur d’équipe et apte à travailler dans un environnement qui bouge rapidement et qui comporte des délais serrés;\u003c/li\u003e\n\u003cli\u003eFaire preuve de créativité pour régler les difficultés techniques et optimiser l’utilisation des ressources;\u003c/li\u003e\n\u003cli\u003ePosséder d’excellentes aptitudes interpersonnelles et de communication;\u003c/li\u003e\n\u003cli\u003ePosséder une grande capacité d’apprentissage et être ouvert aux défis;\u003c/li\u003e\n\u003cli\u003eFaire preuve de discipline et d’autonomie;\u003c/li\u003e\n\u003cli\u003eAvoir une bonne communication orale et écrite (français et anglais).\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003ePersonnelles\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003ePosséder d’excellentes aptitudes interpersonnelles et de communication ;\u003c/li\u003e\n\u003cli\u003eSavoir travailler en équipe et être prêt à offrir son aide ;\u003c/li\u003e\n\u003cli\u003eFaire preuve d’esprit critique ;\u003c/li\u003e\n\u003cli\u003ePosséder une grande capacité et désir d’apprentissage, être ouvert aux défis;\u003c/li\u003e\n\u003cli\u003eFaire preuve de créativité pour régler les difficultés techniques ;\u003c/li\u003e\n\u003cli\u003eAvoir le souci du détail ;\u003c/li\u003e\n\u003cli\u003eÊtre à l’aise dans un environnement de télétravail ;\u003c/li\u003e\n\u003cli\u003eAvoir une bonne communication orale et écrite (français/anglais).\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eAtouts\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eExpérience sur la plateforme infonuagique Microsoft Azure\u003c/li\u003e\n\u003cli\u003eExpérience avec le développement en microservices\u003c/li\u003e\n\u003cli\u003eExpérience avec le DDD et le TDD\u003c/li\u003e\n\u003cli\u003eExpérience de déploiement en continu et la mise en place de tests automatisés.\u003c/li\u003e\n\u003cli\u003eConnaissance technique des applications dans le domaine de l’assurance collective\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eRenseignements complémentaires\u003c/h2\u003e\n\u003ch2\u003eAvantages Segic\u003c/h2\u003e\n\u003cp\u003eNous offrons des avantages sociaux très compétitifs et un cadre de travail exceptionnel :\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePossibilité de télétravail pour conciliation travail-vie privée;\u003c/li\u003e\n\u003cli\u003eHoraire flexible;\u003c/li\u003e\n\u003cli\u003eBureau moderne (avec cuisine, salle de jeux, douches);\u003c/li\u003e\n\u003cli\u003eStationnement gratuit;\u003c/li\u003e\n\u003cli\u003eCafé gratuit;\u003c/li\u003e\n\u003cli\u003eAssurances collectives (soins de santé, soins dentaires, et autres);\u003c/li\u003e\n\u003cli\u003eSoins de santé 2.0 offerts :\u003c/li\u003e\n\u003cli\u003eAccès sécurisé en ligne à des médecins, infirmières et spécialistes de la santé à partir de votre ordinateur ou de votre appareil mobile;\u003c/li\u003e\n\u003cli\u003eRenouvellement en ligne et livraison des médicaments;\u003c/li\u003e\n\u003cli\u003ePlan de retraite;\u003c/li\u003e\n\u003cli\u003eActivités sociales et 5@7;\u003c/li\u003e\n\u003cli\u003ePrise en charge d’une partie de l’abonnement à votre centre de conditionnement physique;\u003c/li\u003e\n\u003cli\u003eClub de course et activités sportives à l’interne de niveau débutant à avancé;\u003c/li\u003e\n\u003cli\u003ePiste cyclable à proximité;\u003c/li\u003e\n\u003cli\u003eReconnaissance de l’ancienneté;\u003c/li\u003e\n\u003cli\u003ePrime pour référence d’employés;\u003c/li\u003e\n\u003cli\u003eMéthode de gestion basée sur l'holocratie et la méritocratie;\u003c/li\u003e\n\u003cli\u003eEn été, vendredis écourtés!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/3vqJLjC\"\u003eCliquez ici pour accéder au formulaire de candidature!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/3vqJLjC\"\u003eCliquez ici pour accéder au formulaire de candidature!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb2VjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--074184ee86db78bb80b41854ac8deccfeafa6890/huge.png"},{"id":"40b87bde-8e89-4f7a-bafb-b93133c062ac","type":"Full Time","url":"https://jobs.github.com/positions/40b87bde-8e89-4f7a-bafb-b93133c062ac","created_at":"Mon Mar 15 09:26:01 UTC 2021","company":"Consorsbank","company_url":"https://vonq.io/30EaD18","location":"Nürnberg","title":"Mobile Developer iOS (w/m/d)","description":"\u003cp\u003e\u003cstrong\u003eFür unseren Standort Nürnberg in Voll- oder Teilzeit\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eGestalten Sie mit uns das Banking von Morgen! Denn wir bieten nicht nur modernes Online-Banking, sondern erleichtern mit selbst entwickelten Innovationen den Alltag unserer Kunden. Dabei hören wir zu und lassen die Kunden aktiv ihre Meinungen und Ideen beisteuern. Gestalten auch Sie mit – werden Sie Teil der Consorsbank und des starken Netzwerks von BNP Paribas.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIhre Aufgaben:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSie sind für die Implementierung unserer mobilen iOS App einschließlich deren Livenahme verantwortlich\u003c/li\u003e\n\u003cli\u003eSie arbeiten aktiv an Konzeption und Lösungsdesign innerhalb Ihres Entwicklungsteams mit\u003c/li\u003e\n\u003cli\u003eSie übernehmen die Pflege und Wartung unserer Bestandssysteme und unterstützen die Produktexperten und den Betrieb mit Ihrem Knowhow\u003c/li\u003e\n\u003cli\u003eSie sind mitverantwortlich für die Einhaltung von Architekturrichtlinien und Code-Qualität in diesem Bereich\u003c/li\u003e\n\u003cli\u003eSie tragen zur stetigen Qualitätsverbesserung mittels Testautomatisierung und der Umsetzung von Optimierungspotenzialen bei\u003c/li\u003e\n\u003cli\u003eSie übernehmen diese Aufgaben in einem agilen Softwareentwicklungsprozess, der sowohl selbständige Arbeitsweise als auch produktive Teamarbeit beinhaltet. Dabei haben Sie immer den Kunden und seine Bedürfnisse im Fokus\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eIhr Profil:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHochschulabschluss im Bereich IT oder vergleichbare Ausbildung mit langjähriger Erfahrung im Bereich der nativen iOS-Entwicklung\u003c/li\u003e\n\u003cli\u003eSie haben fundierte Kenntnisse in Swift, Objective C und sind vertraut mit Architektur-Patterns wie z.B. MVP/MVVM/VIPER\u003c/li\u003e\n\u003cli\u003eErfahrungen mit Core Data und SwiftUI wären von Vorteil\u003c/li\u003e\n\u003cli\u003eSie haben Kenntnisse in Webservices, REST, JSON, HTML\u003c/li\u003e\n\u003cli\u003eCI / CD Pipelines und Reactive Programming sind kein Fremdwort für Sie\u003c/li\u003e\n\u003cli\u003eErfahrung in der Entwicklung von betriebswirtschaftlichen Anwendungen sind wünschenswert, wenn möglich im Banken- /Finanzumfeld\u003c/li\u003e\n\u003cli\u003eKreativität, Team- und Kommunikationsfähigkeit sowie Qualitätsbewusstsein\u003c/li\u003e\n\u003cli\u003eGute Deutschkenntnisse in Wort und Schrift\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWas wir Ihnen bieten:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEin hervorragendes Betriebsklima, kompetente Kollegen und Veranstaltungen, welche Zusammenarbeit und Kommunikation fördern\u003c/li\u003e\n\u003cli\u003eBegegnung auf Augenhöhe in einer Du-Kultur\u003c/li\u003e\n\u003cli\u003eModerne Arbeitswelten an zentralen Standorten\u003c/li\u003e\n\u003cli\u003eBetriebliches Gesundheitsmanagement mit vielfältigen Mitarbeiterangeboten rund um das Thema „Gesundheit“\u003c/li\u003e\n\u003cli\u003eGewinnbeteiligung: Sie profitieren direkt von unserem gemeinsamen Erfolg\u003c/li\u003e\n\u003cli\u003eBetriebliche Altersvorsorge: Mit dem Testsieger BVV können Sie das Alter entspannt auf sich zukommen lassen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDynamische Perspektiven in stabilem Umfeld\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDie BNP Paribas Gruppe bietet in Deutschland ein einzigartiges Arbeitsumfeld: Unsere 12 Gesellschaften bilden gemeinsam eine lernende Organisation, in der unsere Mitarbeitenden ihr Wissen miteinander teilen und sich dafür einsetzen, dass unsere Kunden von diesem großen Erfahrungsschatz profitieren. Werden Sie Teil unseres Teams, und treiben Sie eine Welt im Wandel mit Ihren eigenen Ideen voran.\u003c/p\u003e\n\u003cp\u003eFür Ihre Fragen ist Verena Blum unter 0911 3690 sowie per Mail: \u003ca href=\"mailto:recruiting@consorsbank.de\"\u003erecruiting@consorsbank.de\u003c/a\u003e für Sie da. Wir freuen uns auf Ihre Bewerbung als Mobile Developer iOS (w/m/d) mit Nennung Ihrer Gehaltsvorstellung, dem frühestmöglichen Eintrittstermin und relevanten Zeugnissen!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/30EaD18\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/30EaD18\"\u003eKlicken Sie hier um zum Bewerbungsformular zu gelangen!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1NjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--17276ce838332b37ef37bfc4eeba98d6964f61a3/consors.jpeg"},{"id":"22dc3e8b-30ea-428c-bec0-010ad723c1d9","type":"Full Time","url":"https://jobs.github.com/positions/22dc3e8b-30ea-428c-bec0-010ad723c1d9","created_at":"Mon Mar 15 05:37:36 UTC 2021","company":"Shorthand","company_url":"http://www.shorthand.com","location":"United States","title":"Principal Software Engineer","description":"\u003ch1\u003eThe Opportunity\u003c/h1\u003e\n\u003cp\u003eShorthand is a growing company that provides a digital publishing platform to many of the world's best known publishers, brands, not-for-profits, and universities. With customers on every continent (except Antarctica!), there's never been a more exciting time to join Shorthand. Our company has the rare distinction in this era of money-burning startups of being both investor-backed and comfortably profitable. We're a small team of geeks with art and heart, and a high bar for quality.\u003c/p\u003e\n\u003cp\u003eTo deliver our magic to customers and their audiences, we build software that is scalable, flexible, reliable and as simple as possible but no simpler.\u003c/p\u003e\n\u003ch1\u003eThe Role\u003c/h1\u003e\n\u003cp\u003eWe tend to do things a little differently at Shorthand. For one thing, we're a small, fully remote team distributed around the world and have been for over 3 years, meaning we have established systems and processes in place. For this role we'll happily take applications from anywhere in the United States.\u003c/p\u003e\n\u003cp\u003eThis role will share responsibility for designing, engineering and scaling our backend systems and services.\u003c/p\u003e\n\u003cp\u003eWe are looking for someone who:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eIs whip smart, as demonstrated by career achievements and / or school / college results\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHas good knowledge of cloud-based web architectures.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperienced in system design and distributed computing.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHas a wide range of experience and expertise across languages, frameworks and approaches such as Javascript, Typescript, and ReactJS, NodeJS, scripting, serverless, and microservices.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eIs an expert in using git.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHas worked with CI/CD processes before (CircleCI/Jenkins preferably).\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHas an extremely high bar for quality.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eIs thorough and detail-oriented.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCan learn fast.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHas great communication skills, particularly with respect to writing.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eGains deep satisfaction from helping to make products better.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHas experience of working in a small business or startup environment.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePreferably has experience collaborating with diverse, geographically-dispersed teams.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch1\u003eCore Responsibilities:\u003c/h1\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eOwn backend development and contribute to other areas of the product. \u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eLearn, evolve and improve an existing application/system architecture.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eReview code from other engineers and provide feedback.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHelp secure the environment.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eDevelop Shorthand app server-side and API functionality to help improve the customer experience. \u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eContribute to the technical direction of the Shorthand tool.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eReport bugs.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCommunicate with the customer support team and customers to suggest solutions to issues.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAssist in the creation of product documentation when required.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch1\u003eQualifications:\u003c/h1\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eA minimum 10 years of experience in Software Engineering roles.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA minimum 3 years of experience in web application development.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eThorough knowledge of NodeJS and the web.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with AWS.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eA university qualification in computer science or a closely related field, or equivalent career experience required.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch1\u003ePersonality Attributes: \u003c/h1\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eYou are a proactive self-starter, who does not need to be told what to do and will be resourceful in order to find solutions to any challenge.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eYou thrive in a fast-paced and demanding environment, and possess a high level of intellectual curiosity.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eYou are collaborative.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eYou find fulfilment in the job itself, and happiness in a job well done.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch1\u003eSalary Range: \u003c/h1\u003e\n\u003cp\u003e$115k - $150k USD\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease send your cover letter and resume via the link below: \u003ca href=\"https://shorthand.freshteam.com/jobs/KzNG-kDh-KLX/principal-software-engineer-us-remote?ft_source=Github%20Jobs_4000184310\u0026amp;ft_medium=Job%20Boards_4000125529\"\u003ehttps://shorthand.freshteam.com/jobs/KzNG-kDh-KLX/principal-software-engineer-us-remote?ft_source=Github%20Jobs_4000184310\u0026amp;ft_medium=Job%20Boards_4000125529\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb0NjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--18701cc658d44370a3bc1927135655c3fc736848/logo-black%20square.png"},{"id":"eb0f52d3-1171-448c-a1b2-e92bd31e710a","type":"Full Time","url":"https://jobs.github.com/positions/eb0f52d3-1171-448c-a1b2-e92bd31e710a","created_at":"Sun Mar 14 18:58:17 UTC 2021","company":"Infiltrator Water Technologies","company_url":null,"location":"Connecticut ","title":"IT Project Manager ","description":"\u003cp\u003eHeadquartered in Old Saybrook, CT, Infiltrator Water Technologies is the leading provider of engineered plastic chambers, synthetic aggregates, tanks, advanced wastewater treatment systems, and accessories for the onsite/decentralized wastewater and storm water management industries. The majority of Infiltrator products are manufactured from recycled plastic. Founded in 1987, we operate throughout the US and Canada with 8 manufacturing plants in the US, dedicated sales, and corporate team members.  Infiltrator is a pioneer in innovative plastic technologies for underground water management. Infiltrator components are used in most onsite septic systems installed in the United States and Canada. Infiltrator is a proud Corporate Partner of Habitat for Humanity and each year donates components for 50 septic systems serving Habitat homes in North America. Infiltrator is committed to advancing the state of the art in all fronts, including product design, manufacturing, materials, wastewater science, marketing, management, and employee development. In other words, we strive to be the best we can be.\u003c/p\u003e\n\u003cp\u003eResponsibilities\nIn this role, we are looking for a Project Manager with Information Technology experience implementing service application tools.  The candidate is highly self-motivated and has a passion for managing multiple, technical, and complex projects.  This role will implement new business processes leveraging new technology to support the strategic growth of Infiltrator Water Technologies in Old Saybrook, CT.\u003c/p\u003e\n\u003cp\u003eInfiltrator Water Technologies is in the process of building new standardized processes to interface with growing customer and vendor base by implementing application base IT projects.  The Project manager will lead and manage the roadmap and implementation of information technology projects.\u003c/p\u003e\n\u003cp\u003eThis position reports to the VP of Finance \u0026amp; IT.\u003c/p\u003e\n\u003cp\u003eWork closely with stakeholders at all levels including business leadership, executive teams, project teams, and business users.\nDevelop project charters and identify appropriate technology to meet business goals, working with internal groups and third-party providers to develop an effective solution that meets all stakeholder goals.\nInterface with the technology team members, and with external managed services providers.\nBecome the in-house expert on available technology solutions in the areas of Ecommerce, EDIO, and supply chain management.\nDevelop and manage capital budgeting, project planning and resource planning.\nLead internal business and technology updates.\u003c/p\u003e\n\u003cp\u003eQUALIFICATIONS:\u003c/p\u003e\n\u003cp\u003e4-year college degree or relevant education and experience.\n7+ years of experience leading and managing information technology projects, including multiple concurrent large-scale projects.\nHighly motivated and shows initiative, exceptional organizational and time management skills.\nAbility to effectively prioritize and execute tasks in a fast paced, high velocity, environment; ability to stay focused on responsibilities, meet deadlines and manage competing priorities under pressure.\nAbility to drive effective meetings: workshops, design, and problem-solving sessions.\nAble to scale, apply, and adapt project management methodologies and frameworks.\nManage all project documentation.\nDemonstrate and apply strong problem solving, analytical and conflict management skills\nAbility to present ideas in business friendly and user-friendly language; demonstrated aptitude for working with, supporting and communicating with users and customers.\nBusiness process acumen on customer invoicing and accounts receivable.\nExperience working win a team-oriented, collaborative, matrix environment, across multiple functions with a variety of operating environments, application software, tools and technologies.\nProficient in MS Project.\u003c/p\u003e\n\u003cp\u003eQUALIFICATIONS (beneficial):\u003c/p\u003e\n\u003cp\u003eWindows platform; Microsoft SQL Server.\nExperience with functional configuration and SaaS.\nExposure/experience with agile implementation software application products for business process improvements that interfaces with customers and suppliers.\nSome background and understanding of operational processes in a manufacturing environment; functional competency in manufacturing, distribution, and financials.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"http://www.infiltratorwater.com\"\u003ewww.infiltratorwater.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"46ab84b4-12dc-4a95-ab08-422428554dfc","type":"Full Time","url":"https://jobs.github.com/positions/46ab84b4-12dc-4a95-ab08-422428554dfc","created_at":"Fri Oct 09 19:42:30 UTC 2020","company":"Playco","company_url":"http://www.play.co","location":"Remote","title":"Core/Backend Engineer","description":"\u003cp\u003eHere at Playco, we make games that bring the world closer together through play.\u003c/p\u003e\n\u003cp\u003eOur ideal teammates are thoughtful, humble, and passionate professionals who can both zoom into the details and zoom out to embrace the big picture. We are inspired by makers and tinkerers, who are unafraid to experiment with a healthy disregard for constraints. We hope you'll enrich our team with your enthusiasm and passion, both for games and for life.\u003c/p\u003e\n\u003cp\u003eOur engineers are generally amazing at something and great at everything else. We write scalable serverless backend systems, JavaScript / TypeScript game APIs and tools, and whatever else it takes to make our game studios efficient at what they do best -- create games. No matter what you work on each day, you will work with the best engineers in the world; we have top talent in every part of our stack.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe Role\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe’re looking for engineers who are excited about redefining the technology stack to build and operate games reaching millions of people. Playco’s instant play first approach means that traditional industry approaches to game engine design, client/server architecture, big data and analytics, and games as a service needs to be rethought and redone. When you join our team, you’ll be at the forefront of the technology stack to enable millions of gamers to play with their friends, instantly.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe a key member of a high performing software engineering team.\u003c/li\u003e\n\u003cli\u003eArchitect and code sophisticated client/server systems for instant gaming.\u003c/li\u003e\n\u003cli\u003ePlay a critical role in day-to-day coding, performance profiling, optimization, and general troubleshooting.\u003c/li\u003e\n\u003cli\u003eCollaborate with design, engineering, and production teams to devise optimal engineering solutions to game requirements.\u003c/li\u003e\n\u003cli\u003eLearn from and mentor other engineers on your team.\u003c/li\u003e\n\u003cli\u003eTake ownership of your projects to make them the best they can possibly be.\u003c/li\u003e\n\u003cli\u003eProvide valuable input on the company’s long-term engineering roadmap and help identify areas of opportunity for improvement.\u003c/li\u003e\n\u003cli\u003eDefine the cutting edge of social gaming!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSome projects that we work on\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBackend as a service platform for game studios that allows game developers to effortlessly add persistence and multiplayer features for their games.\u003c/li\u003e\n\u003cli\u003eSynchronous multiplayer game hosting platform that scales horizontally to any load.\u003c/li\u003e\n\u003cli\u003eCommon analytics layer to that allows to capture data consistently across games.\u003c/li\u003e\n\u003cli\u003eIntegration with new and exciting platforms that run instant games.\u003c/li\u003e\n\u003cli\u003eCustom tooling framework to allow developers to deploy custom-purpose tools that help games with live ops.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDesired Skills\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor’s degree in Computer Science or related field, or equivalent experience.\u003c/li\u003e\n\u003cli\u003e3+ years of professional software engineering experience.\u003c/li\u003e\n\u003cli\u003eExperience writing clean, testable, high-quality code and designing highly scalable systems in production.\u003c/li\u003e\n\u003cli\u003eSolid familiarity with deployment on cloud environments (AWS, GCP, Azure, etc.).\u003c/li\u003e\n\u003cli\u003eStrong Computer Science fundamentals in software systems design, algorithms, and data structures.\u003c/li\u003e\n\u003cli\u003eAbility to interact with peers in a constructive and productive style.\u003c/li\u003e\n\u003cli\u003eFamiliarity with git, svn, or other VCS.\u003c/li\u003e\n\u003cli\u003eGood communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers, and other developers.\u003c/li\u003e\n\u003cli\u003eStrong team player with a positive attitude.\u003c/li\u003e\n\u003cli\u003eWe are a growing distributed team that embraces remote work. You must be capable of working in a fast-paced environment and multiple time zones.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBonus\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExpert knowledge of NodeJS and ES6 / TypeScript.\u003c/li\u003e\n\u003cli\u003eDevOps experience -- setting up CI/CD environments, orchestrating deployments, creating monitoring dashboards, anything that makes the development process easier, more enjoyable and more accountable.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.lever.co/playco/4cbca38a-563f-432f-978b-b41f1dabc66c?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003eApply Here\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc2FMIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cb29d1ab0fec648aee52b0ad6e7ec0a0485551ca/Round_Logo1%20(1).png"},{"id":"c797eeb3-347d-411f-80fa-574d7f765585","type":"Full Time","url":"https://jobs.github.com/positions/c797eeb3-347d-411f-80fa-574d7f765585","created_at":"Fri Mar 12 21:38:51 UTC 2021","company":"Lifted Logic","company_url":null,"location":"Kansas City","title":"PHP Full-stack Web Developer","description":"\u003cp\u003eDescription:\nAs a PHP Full-stack Web Developer, your focus would be on building out interfaces, interactions, and functionality for custom websites and web apps. While the framework or CMS may change from project to project, one constant is our commitment to quality. We primarily build and maintain sites built on WordPress and Laravel, but we value every developer’s input on the best tools for the job. We understand that there is no one-size-fits-all solution, so figuring out the best tools for the job is something we take seriously.\u003c/p\u003e\n\u003cp\u003eEssential Job Functions:\nUse modern technologies and tools to build frontend and backend web experiences, including e-commerce and application development.\nCollaborate with other developers on various projects.\nWork with designers and content strategists to determine style, interaction, and functional requirements for upcoming projects.\nTroubleshoot bugs and other issues on live sites.\nManage multiple projects at any one time.\u003c/p\u003e\n\u003cp\u003eWhat We Use:\nPHP\nHTML/CSS\nJS / jQuery / Vue\nGrunt / Gulp / Webpack\nNode / NPM / Bower\nWordPress / Laravel\u003c/p\u003e\n\u003cp\u003eQualifications:\n3+ years of coding experience\nA strong working knowledge of frontend languages such as HTML, JavaScript, PHP and MySQL.\nExperience working with front-end JavaScript libraries (jQuery, Vue, etc) and style frameworks (Bootstrap, Bulma, etc).\nExperience working with PHP-based CMSes (WordPress, Drupal, etc) and Frameworks (Laravel, Symfony, etc).\nA keen eye for user interaction and flow.\nA good sense of code structure and modern development methodologies.\nCares about the code they write.\nCan communicate effectively about development topics with non-technical roles.\nHigh attention to detail.\nAnd of course, someone who is willing to learn and grow in development and explore new ideas.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePleas send your Github link to \u003ca href=\"mailto:todd@liftedlogic.com\"\u003etodd@liftedlogic.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"c057b159-202c-4abb-b03e-7f4ee7856638","type":"Full Time","url":"https://jobs.github.com/positions/c057b159-202c-4abb-b03e-7f4ee7856638","created_at":"Fri Mar 12 21:40:49 UTC 2021","company":"Versiti","company_url":"http://www.versiti.org","location":"Indianapolis, IN","title":"Sr. Systems Analyst, Applications ","description":"\u003cp\u003ePOSITION SUMMARY\nUnder the direction and guidance of the Director IT or Manager, this software development/systems professional is responsible for developing and/or supporting a broad range software of applications, integration solutions and systems for Versiti.\nDUTIES AND RESPONSIBILITIES\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eApplies expertise in the technical architecture design, development, delivery and support of software application solutions and system interfaces to meet business requirements following departmental standards and best practices\u003c/li\u003e\n\u003cli\u003eDevelops reports and queries to aid business and service lines\u003c/li\u003e\n\u003cli\u003ePerforms and/or assists with required maintenance and upgrades of assigned systems/solutions\u003c/li\u003e\n\u003cli\u003eAssists in the evaluation and selection of off-the-the shelf solutions and systems, as well as technologies, and plays a key role in implementation, integration, and maintenance of those systems and technologies.\u003c/li\u003e\n\u003cli\u003eEstablishes strong working and consultative relationships with business partner and users, vendors and internal staff\u003c/li\u003e\n\u003cli\u003eDevelops estimates for assigned work and manages time and work plans effectively to meet deadlines, provides routine updates to appropriate business and IS teams.\u003c/li\u003e\n\u003cli\u003eWorking with extended development team and management, assists in establishment of policies, processes, procedures and standards including coding standards, testing, etc.\u003c/li\u003e\n\u003cli\u003eAssists peers in design and development efforts by being an active participant in code walkthroughs and design reviews\u003c/li\u003e\n\u003cli\u003ePerforms other duties as required.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eQUALIFICATIONS\u003c/p\u003e\n\u003cp\u003eEducation\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBS from an accredited institution; Computer Science, Software Engineering, Management Information Systems degree preferred; equivalent work experience may be considered\u003c/li\u003e\n\u003cli\u003eITIL foundation certification a definite plus\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e \nExperience, Skills and Knowledge – Clinical and Research Systems and Software Development\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5-8 years of progressive responsibility and experience in application development and support, with at least 3 years of demonstrated systems analysis and design experience.\u003c/li\u003e\n\u003cli\u003eExperience in laboratory, hospital, pharma or healthcare solutions and/or integrations a definite plus\u003c/li\u003e\n\u003cli\u003eDemonstrated understanding and appreciation of structure software development and support lifecycle disciplines\u003c/li\u003e\n\u003cli\u003eExperience working in a Regulated industry like healthcare, banking etc. with knowledge of privacy and compliance regulations such as HIPAA, GDPR preferred\u003c/li\u003e\n\u003cli\u003eGood communication and listening skills, with an ability to translate business requests and requirements into proposed technical solutions\u003c/li\u003e\n\u003cli\u003eUnderstands the need to balance technical solutions with practical business needs and short-term vs long-term approaches\u003c/li\u003e\n\u003cli\u003eStrong collaborator and team player, with the ability to partner well with users, peers, internal and external/vendor partners and management\u003c/li\u003e\n\u003cli\u003eMotivated, self-starter, self-directed, results-oriented\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eKey Development Tools\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDatabase and report development: MS SQL Server and Oracle; SQL to develop queries, stored procedures, reports and analytics\u003c/li\u003e\n\u003cli\u003eReporting tools: Power BI, Business Objects\u003c/li\u003e\n\u003cli\u003eCCL for Cerner\u003c/li\u003e\n\u003cli\u003eJava, VBA and/or Python scripting\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eKey Application Technologies and Environments in Use/Supported\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCerner Laboratory\u003c/li\u003e\n\u003cli\u003eSurround\u003c/li\u003e\n\u003cli\u003eOracle and MS SQL Server databases\u003c/li\u003e\n\u003cli\u003eOperating systems: Unix/Linux and Windows\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePHYSICAL REQUIREMENTS \u0026amp; WORKING CONDITIONS\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThis role can require providing system support coverage during off hours.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThis job description reflects the current assignment of essential functions and is not meant to be all-inclusive or in any way construed as an employment contract.  Duties and responsibilities may be assigned or reassigned to this position at any time and may be modified to reasonably accommodate an individual with a disability or for other reasons solely at management’s discretion.  All position descriptions will be reviewed and updated at least once per year when the incumbent is reviewed or as attrition occurs\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease email \u003ca href=\"mailto:rmargolis@versiti.org\"\u003ermargolis@versiti.org\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbmVjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1c860f51b877feadf720f906c735be5a8eb64f0a/Versiti%20Color%20Logo.jpg"},{"id":"6554f4fa-9e9f-4b96-9584-50bb74993e3d","type":"Full Time","url":"https://jobs.github.com/positions/6554f4fa-9e9f-4b96-9584-50bb74993e3d","created_at":"Fri Mar 12 16:17:55 UTC 2021","company":"Pursuit","company_url":"https://www.pursuit.org/","location":"New York, NY **Currently remote**","title":"Full Stack Web Development Instructor","description":"\u003cp\u003e\u003cstrong\u003eAbout Pursuit\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePursuit is a social impact organization that creates transformation where it’s needed most. Through our intensive software developer training program, we teach high-need, high-potential adults the technical skills and industry smarts needed to get their first tech jobs, advance in their careers, and become the next generation of leaders in tech. In addition to training and career support, Pursuit’s innovative operating model combines partnerships with tech companies to retrain their blue-collar workers and social impact investments to re-envision funding for outcomes-based organizations.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout the Role\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt Pursuit, all employees have the opportunity to make a profound, positive social impact. Our Web Instructors perhaps have the greatest direct impact on our program participants and we are hiring several instructors to support our program expansion. As an Instructor, you will manage a class of approximately 36 Fellows with no technical background to become job-ready over a 12-month period. Instructors will deliver technical curriculum, provide feedback to Fellows and create a positive learning environment. We are hiring instructors at all levels, from associate to lead instructor.\u003c/p\u003e\n\u003cp\u003eOur office is located in Long Island City, NY but we are currently fully remote due to Coronavirus, including our classes, and will remain so for the entirety of 2021.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCohorts have two schedules: Days (Monday - Friday 10:00 - 6:00) and Nights \u0026amp; Weekends (Saturday \u0026amp; Sunday 10:00 - 6:00; Monday - Wednesday 2:00 - 10:00pm)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout You\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are passionate about teaching and mentoring, and have a strong connection to our mission\u003c/li\u003e\n\u003cli\u003eYou have demonstrated professional experience working with front end and back end javascript, for example Node.js, React/Redux, and Postgres\u003c/li\u003e\n\u003cli\u003eYou have a no-fail attitude and love working with a big cross-functional team\u003c/li\u003e\n\u003cli\u003eYou are compassionate and able to work with a broad range of students\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eKey Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDeliver full-class instruction - currently remote over Zoom\u003c/li\u003e\n\u003cli\u003eLead small-group and one-on-one sessions for fellows in need of additional review\u003c/li\u003e\n\u003cli\u003eMonitor chat and answer fellow questions\u003c/li\u003e\n\u003cli\u003eGrade fellow work; offer robust written and verbal feedback to fellows\u003c/li\u003e\n\u003cli\u003eSpearhead workshops and activities that respond to the needs of cohort\u003c/li\u003e\n\u003cli\u003eBuild and refine curriculum materials\u003c/li\u003e\n\u003cli\u003eAssess individual Fellows and support forecasting efforts to meet org goals\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e2+ years experience in a technical instruction or technical role\u003c/li\u003e\n\u003cli\u003eDemonstrated experience developing web applications using JavaScript and React\u003c/li\u003e\n\u003cli\u003ePassion for teaching and mentorship\u003c/li\u003e\n\u003cli\u003eKnowledge of our tech stack: Postgres - Express - React/Redux - Node.js, aka PERN\u003c/li\u003e\n\u003cli\u003eStrong work ethic and reliability\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eNice to have\u003c/strong\u003e\nJest, Cypress, React Testing Library/Enzyme, and automation platforms such as CircleCI\u003c/p\u003e\n\u003cp\u003eThis is a \u003cstrong\u003efull-time, salaried position with competitive compensation and a wide range of benefits.\u003c/strong\u003e Our offerings include premium health, dental, and vision insurance, flexible paid time off, and robust 401k matching.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:talent@pursuit.org\"\u003etalent@pursuit.org\u003c/a\u003e and please indicate which schedule you prefer.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbk9jIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7cd6a370030b45eb588a308118d8718893d5fe95/Pursuit%20Wordmark%20Black.jpg"},{"id":"4150a9c0-438e-47f3-8c38-f0436e51522c","type":"Full Time","url":"https://jobs.github.com/positions/4150a9c0-438e-47f3-8c38-f0436e51522c","created_at":"Fri Mar 12 16:00:59 UTC 2021","company":"CTI Clinical Trial and Consulting Services, Inc.","company_url":null,"location":"Covington, KY \u0026 Raleigh, NC","title":"Senior Developer","description":"\u003cp\u003eJob Purpose / Summary:\nThe Senior Developer works with system owners to understand the business requirements of a system and is able to use various technologies to develop the supporting infrastructure and user interfaces.  This can involve working with data from a variety of sources and developing the most efficient methods to manage data flow.  The Senior Developer communicates with both internal and external clients during all phases of system development, working within agreed upon budget and timelines.  The Senior Developer is proficient with industry best practices for processes and development technologies, and serves as a resource and mentor to other developers.\u003c/p\u003e\n\u003cp\u003eWhat You'll Do:\nWork with system owners to develop requirements and transform into a usable system within the systems development life cycle (SDLC) framework\nDevelop custom databases and user interfaces using standard web and database technologies such as Microsoft SQL, Microsoft SSRS, Microsoft C#, etc.\nDevelop extract, transform, and load (ETL) processes on complex data sets\nPrepare reports, tables, charts, and graphs using Tableau and Microsoft SSRS\nDevelopment work in systems such as Medidata suite, SharePoint, and Intacct\nWork with and support other developers to create and implement best practices for processes and systems; provide leadership to other developers\nCommunicate results within the organization and to clients\nFollow applicable Standard Operating Procedures (SOPs) and maintain appropriate project documentation\nPerform, track, and manage related project work as assigned\nIdentify areas for improvement and provides recommendations to address\nAdhere to requirements of 21 CFR Part 11 where applicable\u003c/p\u003e\n\u003cp\u003eWhat You'll Bring:\nBachelor's Degree in Computer Science or related field\n5 years industry experience in related field\nExperience with Microsoft SQL Server, Microsoft SSRS, SQL, Microsoft C#, and Tableau\u003c/p\u003e\n\u003cp\u003eWhy CTI?:\nWe support career progression –  We have a structured mentoring program to provide the support you need to move forward\nWe value education and training – We provide tuition reimbursement, partner with universities and colleges to create programs in our field, and have a dedicated training department\nWe value our people - We have never had a layoff in our 20-year history, support a work-life balance, and have provided cash bonuses every year for the past decade\nOur culture is unparalleled – We've received multiple awards recognizing CTI as one of the best places to work in the greater Cincinnati area, as well as one of the top CROs in the industry\nWe think globally and act locally – We have a global philanthropic program supporting our team’s efforts to improve their local communities (click here to learn more about our “CTI Cares” program)\nWe are looking toward the future – We have had a consistent double-digit growth rate over the last decade, invest in cutting-edge technology, and pride ourselves on our average 95% annual retention rate (a recent report found that the average turnover for CROs in the US was 30%)\nOur work makes a difference – We focus our work on treatments for chronically and critically-ill patients, who are depending on us to bring these life-changing therapies to market\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://www.ctifacts.com/careers/join-the-cti-team?gnk=job\u0026amp;gni=8a7885ac767274b60176f1e375d60e49\u0026amp;gns=Industry+Website\"\u003ehttps://www.ctifacts.com/careers/join-the-cti-team?gnk=job\u0026amp;gni=8a7885ac767274b60176f1e375d60e49\u0026amp;gns=Industry+Website\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"ad662975-bab2-47a1-877f-486759533180","type":"Full Time","url":"https://jobs.github.com/positions/ad662975-bab2-47a1-877f-486759533180","created_at":"Fri Mar 12 15:41:35 UTC 2021","company":"arxes-tolina GmbH","company_url":"https://smardigo.de/","location":"Berlin","title":"Senior Java Developer (m/w/d)","description":"\u003cp\u003e\u003cstrong\u003eFür unseren Geschäftsbereich Software am Standort Siemensdamm in Berlin suchen wir Senior Java Entwickler (m/w/d)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003earxes-tolina GmbH ist ein führender Anbieter von hochwertigen und praxisbewährten Lösungen und Services in den Bereichen IT, Software und Consulting. Dabei verbinden wir in unserem Portfolio das klassische IT-Systemhausgeschäft mit unseren eigenen Softwarelösungen zur Digitalisierung von Geschäftsprozessen. arxes-tolina GmbH verfügt über fast 30 Jahre Erfahrung bei der Entwicklung von intelligenten Softwarelösungen zum Automatisieren und Optimieren von Geschäftsprozessen, die kundenindividuell gestaltet und über Schnittstellen schnell und effizient in bestehende IT-Infrastrukturen integriert werden können.\u003c/p\u003e\n\u003cp\u003eMit unserer Low-Code-Plattform smardigo setzen wir auf eine einfache und schnelle digitale Transformation von Geschäftsprozessen mittels BPMN. In Kombination mit unserer Automatisierungsplattform Camino und unserem End-to-End verschlüsselten Austauschhub e-DEN bieten wir unseren Kunden somit eine Komplettlösung zur Digitalisierung von Geschäftsprozessen.\u003c/p\u003e\n\u003cp\u003eWir bieten unseren Kunden im Rahmen unseres Consulting-Services branchenübergreifendes Wissen in verschiedensten Fachbereichen, unter anderem durch langjährige Praxiserfahrung aus zahllosen erfolgreichen Kundenprojekten, an. So begleiten wir namenhafte Unternehmen und öffentliche Auftraggeber als Digitalisierungspartner auf ihrem Weg in ein zukunftsfähiges Geschäftsmodell.\nAls arxes-tolina Team verfolgen wir das Ziel einer der TOP Digitalisierungspartner in Deutschland zu sein und gemeinsam mit der neu gewonnenen Unterstützung der netgo group werden wir zum „Digital Gamechanger“.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eProud to be part of netgo group\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAls Senior Java Entwickler erwartet dich bei uns:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAgile Software-Entwicklung mit Scrum oder Kanban\u003c/li\u003e\n\u003cli\u003eSpannende und abwechslungsreiche Projekte zur Unterstützung der digitalen Transformation\u003c/li\u003e\n\u003cli\u003eEntwicklung von innovativen Lösungen mit modernen Web Technologien und nach dem Clean-Code-Prinzipien\u003c/li\u003e\n\u003cli\u003eUnterstützung des Product Owners bei der Konzeption von Kundenanforderungen und technischen Umsetzung im Team\u003c/li\u003e\n\u003cli\u003eSelbstorganisierte Teams mit einer flachen Hierarchie\u003c/li\u003e\n\u003cli\u003eKreatives Arbeiten und das Ausprobieren neuer Technologien\u003c/li\u003e\n\u003cli\u003eFeedbackkultur auf Augenhöhe\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDas wünschen wir von dir:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu bringst mehrjährige Berufserfahrung als Softwareentwickler mit, idealerweise auch in Softwarearchitektur und -konzeption\u003c/li\u003e\n\u003cli\u003eDu fühlst dich als Fullstack-Entwickler wohl (Frontend - SPA z.B. Angular, React, VueJS, Vaadin und/oder Backend - Java, Spring, JPA(Hibernate), SQL, Buildprozesse CD/CI)\u003c/li\u003e\n\u003cli\u003eDu hast einen hohen Anspruch an Code-Qualität, Design und die Schaffung einer agilen Software-Architektur\u003c/li\u003e\n\u003cli\u003eDu arbeitest dich schnell in neue Themen und Technologien ein\u003c/li\u003e\n\u003cli\u003eDu hast Erfahrung mit agilen Softwareentwicklungsmethoden\u003c/li\u003e\n\u003cli\u003eDu bringst dich mit deiner Kommunikationsfähigkeit ins Team bzw. beim Kunden ein\u003c/li\u003e\n\u003cli\u003eDeine Deutschkenntnisse sind verhandlungssicher in Wort und Schrift\u003c/li\u003e\n\u003cli\u003ePluspunkte geben Erfahrung im Mentoring, Elastic-Stack und Docker\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003earxes-tolina bietet dir:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEinen Job in einem zukunftsweisenden und wachsenden Unternehmen\u003c/li\u003e\n\u003cli\u003eGestaltungsspielraum und hohe Einflussmöglichkeiten auf die eigene Arbeit für deine persönliche Entfaltung\u003c/li\u003e\n\u003cli\u003eEine angenehme offene und familiäre Arbeitsatmosphäre in unseren Teams sowie unternehmensübergreifend zwischen den Mitarbeiter*Innen.\u003c/li\u003e\n\u003cli\u003eEin Mentoringprogramm und ein Einarbeitungsplan für deinen gelungenen Einstieg\u003c/li\u003e\n\u003cli\u003eEine offene Kommunikationskultur, in der auch „der Elefant im Raum“ angesprochen werden kann\u003c/li\u003e\n\u003cli\u003eWir sorgen mit Weiterbildungsmöglichkeiten für deine persönliche und berufliche Entwicklung\u003c/li\u003e\n\u003cli\u003eBetriebliche Altersvorsorge für dich und deine Familie\u003c/li\u003e\n\u003cli\u003eMit einem JobRad, unserem Remotework-Konzept sowie deiner flexiblen Arbeitszeitgestaltung steht deiner Work-Life-Balance nichts mehr im Weg!\u003c/li\u003e\n\u003cli\u003eDu kommst mit dem öffentlichen Nahverkehr zur Arbeit? Dann nutze unseren BVG- Zuschuss!\u003c/li\u003e\n\u003cli\u003eEinen Dienstwagen für deine Kundentermine und Familienausflüge\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eFühlst Du dich der Herausforderung gewachsen? Dann schick uns deinen Lebenslauf!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAnsprechpartner: Felix Schwarz\nTelefonnummer: 030 264745 337\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your CV to \u003ca href=\"mailto:felix.schwarz@arxes-tolina.de\"\u003efelix.schwarz@arxes-tolina.de\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXVjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--22fd138e123dee60d94613e260f3168f63c4751b/MicrosoftTeams-image.png"},{"id":"afb5f880-8368-4d6b-9904-082b56da6772","type":"Full Time","url":"https://jobs.github.com/positions/afb5f880-8368-4d6b-9904-082b56da6772","created_at":"Fri Mar 12 14:19:00 UTC 2021","company":"Smart Pricer GmbH ","company_url":"http://www.smart-pricer.com","location":"Berlin ","title":"Backend Developer - (m/f/d)","description":"\u003cp\u003eSmart Pricer is the leading ticket pricing company in Europe. We offer pricing services in the areas of sports, entertainment and ski resorts and are proud to work with partners such as FC Bayern Munich, DFB, Hertha BSC, Sölden ski resort, Zermatt Bergbahnen and many more. Our work is characterized by entrepreneurial thinking, effective transaction management and innovative solutions. We owe our success as one of the world's leading specialists in our field not least to a distinctly team-oriented approach.\u003c/p\u003e\n\u003cp\u003eTogether we want to grow further and are therefore looking for a\u003c/p\u003e\n\u003cp\u003eBackend Developer - (m/f/d)\u003c/p\u003e\n\u003cp\u003eto support us as soon as possible.\u003c/p\u003e\n\u003cp\u003eWith us, you are part of a committed and motivated team that rethinks the way pricing is done with a lot of enthusiasm and drive from Berlin. If you want to take on responsibility from day one and drive our mission forward with your own ideas, then your application is just right with us.\u003c/p\u003e\n\u003cp\u003eYour Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWithin the first three months, you will familiarize yourself with our existing services (you have access to documentations and team members)\u003c/li\u003e\n\u003cli\u003eYou will lead and own the development of our back-end pricing services incl. the design and deployment of APIs to run our services\u003c/li\u003e\n\u003cli\u003eYour responsibilities will range - from rapidly building prototypes in product discovery phase, to delivering reliable quality products in delivery phase, to developing our tech architecture further ensuring functionality, scalability, reliability and security (a hands-on mind-set and strategic oversight are essential for this)\u003c/li\u003e\n\u003cli\u003eYou will define the technical requirements of the company in detail and set up all required processes\u003c/li\u003e\n\u003cli\u003eIn 6-9 month time you will start to build and manage a small technical team of A-players (including software engineers, data scientists)\u003c/li\u003e\n\u003cli\u003eTogether with the founders you and your team will continuously iterate our product by developing hypotheses, validating them (e.g. through user research and tests) and shipping new features\u003c/li\u003e\n\u003cli\u003eYou own the operative KPIs tech and will be the voice of tech in all strategic decisions\u003c/li\u003e\n\u003cli\u003eYou oversee the monitoring of our live pricing services\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSoftware Developer with a degree in a technical related field such as Computer Science, Bio/Informations or similar\u003c/li\u003e\n\u003cli\u003eYou have at least 3 years experience working in Software Development\u003c/li\u003e\n\u003cli\u003eYou are skilled in several backend languages (Go, Ruby) and in working with and deploying cloud services in a Unix environment\u003c/li\u003e\n\u003cli\u003eOptionally you have some frontend experience in TypeScript and CoffeeScript as well as some data analytics background in Python\u003c/li\u003e\n\u003cli\u003eYou combine a strong hands-on-attitude (and are happy to develop and maintain code yourself) with strategic thinking and an entrepreneurial mindset\u003c/li\u003e\n\u003cli\u003eYou have a high focus on customer needs and contribute your best knowledge and experience about technology, products and processes\u003c/li\u003e\n\u003cli\u003eYou are interested in pricing, data mining, ML\u003c/li\u003e\n\u003cli\u003eYou are characterized by a sovereign appearance as well as good presentation and communication skills\u003c/li\u003e\n\u003cli\u003eYou are fluent in English and German\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat We Offer:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA friendly and respectful team with a family work culture\u003c/li\u003e\n\u003cli\u003eA great workplace in Berlin Mitte with a part-time remote work option\u003c/li\u003e\n\u003cli\u003eThe chance to take over a large area of expertise very quickly and to make a steep entry into a management position\u003c/li\u003e\n\u003cli\u003eAn attractive compensation package\u003c/li\u003e\n\u003cli\u003eFlexible working hours\u003c/li\u003e\n\u003cli\u003eA secure employment relationship\u003c/li\u003e\n\u003cli\u003eMeaning - our work has direct impact on sports and entertainment pricing across all of Europe\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eWe are happy to receiving your application by e-mail, stating your desired salary and earliest possible starting date, at: \u003ca href=\"mailto:miriam.weber@smart-pricer.com\"\u003emiriam.weber@smart-pricer.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbWFjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--74a56e5e88ac7195798fd6d2d553cec130e90f9e/Smart%20Pricer%20Logo.jpg"},{"id":"50e7a6e5-cfc9-415e-a681-2eec2f631d3b","type":"Part Time","url":"https://jobs.github.com/positions/50e7a6e5-cfc9-415e-a681-2eec2f631d3b","created_at":"Fri Mar 12 13:56:42 UTC 2021","company":"Hallo Welt Systeme UG (haftungsbeschränkt)","company_url":"http://volla.online","location":"Germany","title":"Android System Developer for the Volla Phone","description":"\u003cp\u003eWe are a young German company based in Remscheid, which started with private equity and two successful crowd funding projects and offers you a perspective for the future.\u003c/p\u003e\n\u003cp\u003eWe want to make an innovative alternative to Google and Apple available for everyone, that ensures our freedom through simplicity and privacy protection. It implements a new approach of user interface and user experience.\u003c/p\u003e\n\u003cp\u003eYou would work with a small international Team and growing community from all over the world. You are free to work in your home office with an agreed availability of 1, 2 or 3 days per week for three month with a perspective to extend the contract.\u003c/p\u003e\n\u003cp\u003eYour tasks:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMaintenance and improvement of Volla OS\u003c/li\u003e\n\u003cli\u003eEnabling regular system updates and patches of AOSP upstream project\u003c/li\u003e\n\u003cli\u003eCustom patches for security and privacy protection\u003c/li\u003e\n\u003cli\u003eMaintenance and improvement of custom system app integration\u003c/li\u003e\n\u003cli\u003eIntegrating network traffic control\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYou should have the following skills:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with the development of custom ROMs based on AOSP\u003c/li\u003e\n\u003cli\u003eExperience with Android Board Support Packages\u003c/li\u003e\n\u003cli\u003eExperience with Continuous Integration, preferably GitLab\u003c/li\u003e\n\u003cli\u003eKnowledge in hardware adaptation of Android\u003c/li\u003e\n\u003cli\u003eknowledge in Android Studio and Android Tools\u003c/li\u003e\n\u003cli\u003eKnowledge in open source projects and platforms like GitHub\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eInterested? We look forward to receiving your application with CV and references!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"mailto:jobs@volla.online\"\u003ejobs@volla.online\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbVNjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--647918d0d162d445c63fdde7b3fb28a4604fcbf6/Logo%20for%20Device.png"},{"id":"84416907-e6ce-43f7-9a1d-351818c076dc","type":"Full Time","url":"https://jobs.github.com/positions/84416907-e6ce-43f7-9a1d-351818c076dc","created_at":"Fri Mar 12 13:37:22 UTC 2021","company":"ORTEC ","company_url":"https://ortec.com","location":"Zoetermeer","title":"DevOps Engineer","description":"\u003cp\u003eAs a \u003cstrong\u003eDevOps engineer\u003c/strong\u003e at ORTEC, one of your main goals is to empower our 130+ software developers around the globe with regards to our software development tools. This means maintenance on existing tools and R\u0026amp;D and implementation of new systems \u0026amp; tools supporting our product transition to the cloud (Azure)\u003c/p\u003e\n\u003cp\u003eOur team of DevOps - and System engineers is the spinning wheel in the software and product development unit. As a \u003cstrong\u003eDevOps engineer\u003c/strong\u003e you work on technical projects.\u003c/p\u003e\n\u003cp\u003eThe team maintains, improves, migrates, and supports all the development systems and tooling that are needed to keep the software and product development empowered and productive. The team is responsible for a versatile portfolio like:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eContinuous integration and Continuous deployment environment (Jenkins, Azure DevOps, Team city)\u003c/li\u003e\n\u003cli\u003eVersion control system (Perforce \u0026amp; Git)\u003c/li\u003e\n\u003cli\u003eTest case management software (Testrail)\u003c/li\u003e\n\u003cli\u003eNuGet repository management (Nexus)\u003c/li\u003e\n\u003cli\u003eIssue and project software (Jira, Azure DevOps)\u003c/li\u003e\n\u003cli\u003eVirtual Machines (vSphere and HyperV) for software \u0026amp; test engineers with the required tooling to do the job!\nAnd more…\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe team is growing towards a team of four to five DevOps - and System engineers. It is also responsible for all integrations between the systems \u0026amp; tools. Next to that, the system engineers maintain and develop all automation to deploy and update the systems \u0026amp; tools.\u003c/p\u003e\n\u003cp\u003eIt is important that you embrace the “DevOps” culture. If people have questions or want support and advice regarding (cloud) infrastructure, automation or the best tooling for the job, you are the “go to” person. We also monitor that the software is automatically build, tested and deployed in the cloud using our continuous integration and continuous delivery pipelines. You work close together with the IT department and you keep aligned with other internal stakeholders.\u003c/p\u003e\n\u003ch2\u003eWho you are\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eYou embrace the DevOps culture\u003c/li\u003e\n\u003cli\u003eAutomating is your second nature\u003c/li\u003e\n\u003cli\u003eYou have knowledge of Virtualization, PowerShell and Windows Server Platform\u003c/li\u003e\n\u003cli\u003eYou can learn quickly to understand Jira, Perforce, Git, etc.\u003c/li\u003e\n\u003cli\u003eYou have a relevant bachelor’s degree\u003c/li\u003e\n\u003cli\u003eYou like to consult others, but also to do the work yourself\u003c/li\u003e\n\u003cli\u003eYou have 2+ years of relevant working experience\u003c/li\u003e\n\u003cli\u003eWillingness to take part in on-call duties to support our customers 24/7 (approx. 8 weeks per year).You will be generously compensated\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWhat we offer\u003c/h2\u003e\n\u003cp\u003eWe are a small, relatively new growing team and with that you will find a ‘start-up’-atmosphere which gives you ample opportunity to explore, learn and grow, and make it your team.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEntrance to the most passionate powerhouse in applied mathematics\u003c/li\u003e\n\u003cli\u003eJoin our movement and improve the world\u003c/li\u003e\n\u003cli\u003eEnjoy an open, kind and fun culture\u003c/li\u003e\n\u003cli\u003eNS Business Card 100%, NS Business Card, lease opportunity or commuting allowance: it’s your choice\u003c/li\u003e\n\u003cli\u003eMobility allowance of 3% of your base salary\u003c/li\u003e\n\u003cli\u003e25 annual leave days, additional days from the age of 35\u003c/li\u003e\n\u003cli\u003eResult related remuneration\u003c/li\u003e\n\u003cli\u003eActive employee association for fun activities with colleagues and content driven Young ORTEC for you to join\u003c/li\u003e\n\u003cli\u003eWe help you to #stayhealthy, to #stayeffective and to #stayconnected: we organize online activities such as pub quizzes, online sports events, social calls with colleagues, and much more\u003c/li\u003e\n\u003cli\u003eYear-end bonus equal to a full month’s pay\u003c/li\u003e\n\u003cli\u003eWe believe in commitment: your permanent contract will be waiting for you\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWhat to expect\u003c/h2\u003e\n\u003cp\u003eWe will help you to thrive in your field of expertise. We offer development programs, tailored to your individual needs and function requirements, including opportunities to attend courses and seminars. We offer challenging, practical hands-on experience with opportunities to work abroad. We operate in a flat organizational structure that keeps communication lines short. The atmosphere is open, informal, cooperative and positive. We employ over 1000 people in the Netherlands (HQ), Belgium, Germany, France, the U.K., Romania, Italy, the U.S., Australia, Brazil, Poland, Denmark and Singapore. Visit our website \u003ca href=\"http://www.ortec.com\"\u003ewww.ortec.com\u003c/a\u003e to learn more about our solutions and clients’ experiences.\u003c/p\u003e\n\u003cp\u003ePlease do not use this vacancy as an acquisition opportunity.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eInterested?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eApply now via the \u003cstrong\u003eapplication form\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/3rEupFy\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/3rEupFy\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbCtjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9c2c222f6ca6056210264a039dc35d35a6ce8e91/ortec.jpeg"},{"id":"2a2a95ca-0c3d-4e37-8817-67dacefafa50","type":"Full Time","url":"https://jobs.github.com/positions/2a2a95ca-0c3d-4e37-8817-67dacefafa50","created_at":"Fri Mar 12 12:46:11 UTC 2021","company":"Invinity Energy Systems","company_url":"https://vonq.io/3tq0hi3","location":"Vancouver","title":"Electronics Test Engineer","description":"\u003ch2\u003eCompany Description\u003c/h2\u003e\n\u003cp\u003eThe Invinity team is growing rapidly, and we’re looking for people with a passion for renewable energy to join us at this remarkable point in our growth.\u003c/p\u003e\n\u003cp\u003eWe are an emerging global cleantech leader; well-funded with category-leading technology. Our culture is collaborative, entrepreneurial, and one in which speaking up is encouraged and ideas are chosen on merit not who they come from.\u003c/p\u003e\n\u003cp\u003ePeople love working at Invinity because we know we are empowered to make a meaningful impact. We’re small enough that every team member plays a critical role in our daily business, but large enough that the batteries we build are being deployed at significant scale in landmark clean energy projects around the world.\u003c/p\u003e\n\u003cp\u003eWhether you are a cleantech veteran or looking to make a career shift, Invinity offers you a chance to work as part of an expert team located across multiple geographies, aligned in our mission to build a sustainable energy future.\u003c/p\u003e\n\u003cp\u003eInvinity is committed to providing equal opportunities in the workplace and follows a comprehensive Equal Opportunities Policy to ensure all employees are valued and can reach their full potential.\u003c/p\u003e\n\u003ch2\u003eJob Description\u003c/h2\u003e\n\u003cp\u003eAs the world transitions to a renewable energy future, large-scale energy storage systems are required to bridge the gap between intervals of renewable energy production. Invinity Energy Systems, listed on the London Stock Exchange, is the leader in vanadium flow batteries, a proven technology addressing the global demand for energy storage.\u003c/p\u003e\n\u003cp\u003eInvinity is seeking an Electronics Test Engineer to join its product development team. This role will work closely with the electronics design team to develop and conduct comprehensive verification test plans. You will be responsible for developing and maintaining the testing infrastructure and equipment necessary to verify robust designs and design the test methods. You will work closely with other teams to establish and conduct various integration tests and provide detailed reports back to design teams.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, source, and build test electronic test equipment including complex electronic test benches.\u003c/li\u003e\n\u003cli\u003eWork with electronics design team to create test plans and conduct tests.\u003c/li\u003e\n\u003cli\u003eSupport root cause analysis and troubleshooting of field failures of electronic\ncomponents.\u003c/li\u003e\n\u003cli\u003eEngage with contract electronic designers, reviewing and auditing test plans.\u003c/li\u003e\n\u003cli\u003eSupport and conduct product certification testing, working with third-party testing labs to provide equipment.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eQualifications\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years experience testing and/or designing electronic systems and related components.\u003c/li\u003e\n\u003cli\u003eExperience working with high voltage AC and DC electronic systems and related test equipment: power supplies, oscilloscopes, dataloggers, etc.\u003c/li\u003e\n\u003cli\u003eStrong documentation skills, writing and reviewing test plans and reports.\u003c/li\u003e\n\u003cli\u003eExperience working in a structured product development environment.\u003c/li\u003e\n\u003cli\u003eAble to read and understand DFMEA and various design documentation.\u003c/li\u003e\n\u003cli\u003eExperience working with contract design and development teams. Proficiency working hands-on with electronics and printed circuit board assemblies, capable of reworking through-hole and SMD components.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDesirable\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCapable of developing interface software programming (LabVIEW, Python, other) to support use and automation of test equipment.\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eAdditional Information\u003c/h2\u003e\n\u003cp\u003eIf the idea of building a world-class development team and helping the world transition to renewable energy is exciting to you. If being a part of a dynamic, global company where the team works with passion but not ego sounds appealing, Invinity may just be where you belong.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/3tq0hi3\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHljIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5705486e3a9bfa1b6ec23ea659b37d7f7346e9d6/Invinity%20Energy%20Systems.jpg"},{"id":"77402588-6286-4aa3-b8c5-988f8dcbbba3","type":"Full Time","url":"https://jobs.github.com/positions/77402588-6286-4aa3-b8c5-988f8dcbbba3","created_at":"Fri Mar 12 12:07:48 UTC 2021","company":"DONE! Berlin","company_url":"https://doneberlin.com","location":"Berlin","title":"Fullstack Developer (m/f/d) @Footprint in Berlin","description":"\u003cp\u003eWe are DONE! Berlin, an international consultancy specializing in helping fast-growing companies of all sizes to navigate the ever-changing world of work. Among other things, we help our clients attract the best talent to their companies.\u003c/p\u003e\n\u003cp\u003eOur client Footprint Technologies GmbH is a young, ambitious start-up located in Berlin. The company's mission is to develop a technology that allows online shoppers to easily and accurately measure their feet at home in order to always find the perfect fitting shoe. With this solution, online retailers will reduce their returns, costs and emissions. In product development Footprint consistently places the user and data insights at the center of all activities and decisions.\u003c/p\u003e\n\u003cp\u003eTo help Footprint achieve its mission, we are looking for a talented Fullstack developer (m/f/d). You’re a smart person with a strong drive and keen to work in a collaborative culture? Great! Because we want you to take the initiative to move Footprint forward by bringing in your own ideas.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop multi-platform web frontends for mobile and desktop\u003c/li\u003e\n\u003cli\u003eConceptualize, implement and maintain user-facing features for Footprint's products\u003c/li\u003e\n\u003cli\u003eDesign and develop backend APIs\u003c/li\u003e\n\u003cli\u003eDevelop reusable libraries\u003c/li\u003e\n\u003cli\u003eOptimize the applications for performance and responsiveness\u003c/li\u003e\n\u003cli\u003eSupport maintaining CI/CD pipelines and databases in the cloud\u003c/li\u003e\n\u003cli\u003eDevelop web frontend applications when needed\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIdeally a completed degree in Computer Science, Software Engineering or related field\u003c/li\u003e\n\u003cli\u003eAround 5 years of experience in developing web applications in cloud, ideally using node.js/ nest.js and Typescript\u003c/li\u003e\n\u003cli\u003eProven experience in developing frontend projects, ideally using React and Typescript/ JavaScript with HTML5 and CSS\u003c/li\u003e\n\u003cli\u003eGood understanding of Test-driven development (TDD), CI/CD pipelines, DevOps principles and MS-Azure\u003c/li\u003e\n\u003cli\u003eHaving fun in solving complex problems\u003c/li\u003e\n\u003cli\u003eGood level of English (C1 Level minimum)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eNice to Have\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with Kubernetes and Docker\u003c/li\u003e\n\u003cli\u003eExperience in using Grafana and Sentry (or similar)\u003c/li\u003e\n\u003cli\u003eExperience in developing with C# and Go for cloud applications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBeing transparent is the best way for Footprint to find solutions and grow together. The team pursues a culture where they frankly address anything that concerns them or affects their work. They bring in a rich combination of skillsets and individual strengths, making them a powerful team.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSteep learning curve by working independently in your own field within Footprint's fabulous development team\u003c/li\u003e\n\u003cli\u003eOpportunity to further develop your experience by certified trainings when required\u003c/li\u003e\n\u003cli\u003eMaximum freedom and trust in terms of your working time, location and holidays\u003c/li\u003e\n\u003cli\u003eGuidance and coaching whenever needed as well as support in finding the right mentors from our broad network of experts\u003c/li\u003e\n\u003cli\u003eFair and transparent compensation model\u003c/li\u003e\n\u003cli\u003eAnd yes - fresh fruits and unlimited coffee are guaranteed! So are team lunches and beers as soon as we're allowed to have them again!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eLooking forward to hearing from you!\u003c/strong\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://doneberlin.join.com/jobs/1967509-fullstack-developer-m-f-d-footprint-in-berlin?pid=357a3b4531918760973f\u0026amp;oid=7b2bd1b9-6d24-4e96-9bfe-fb7fea6a4d6e\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=fullstack%2Bdeveloper%2Bm%2Bf%2Bd%2Bfootprint%2Bin%2Bberlin\"\u003ehttps://doneberlin.join.com/jobs/1967509-fullstack-developer-m-f-d-footprint-in-berlin?pid=357a3b4531918760973f\u0026amp;oid=7b2bd1b9-6d24-4e96-9bfe-fb7fea6a4d6e\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=fullstack%2Bdeveloper%2Bm%2Bf%2Bd%2Bfootprint%2Bin%2Bberlin\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbGljIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--591982ec4af55dc7aa33632d01b31c88aa030974/done-berlin-logo-l.jpg"},{"id":"05b6e9b2-8a2c-4af8-aa18-9d5c93fe6699","type":"Full Time","url":"https://jobs.github.com/positions/05b6e9b2-8a2c-4af8-aa18-9d5c93fe6699","created_at":"Fri Mar 12 11:59:42 UTC 2021","company":"presize.ai","company_url":"https://www.presize.ai","location":"Munich, München","title":"Front End Software Engineer (m/f/d)","description":"\u003cp\u003e\u003cstrong\u003eYour responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eMission\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eEnable millions of people to get the right size when shopping online by integrating Presize with leading fashion eCommerce vendors. Work closely with major online shops to ensure the success of each new project, release groundbreaking new features, and build a world-class UX, to help many more people return much fewer packages.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIntegrate Presize with leading fashion eCommerce shops\u003c/li\u003e\n\u003cli\u003eDevelop novel features for our sizing app, integrations, customer dashboard according to the Build Measure - Learn cycle\u003c/li\u003e\n\u003cli\u003eSetup A/B tests and rapidly iterate based on data-driven insights from user analytics and business intelligence\u003c/li\u003e\n\u003cli\u003eBuild world-class, beautiful, and simple to use UIs that users will absolutely love with our product designer and UX team\u003c/li\u003e\n\u003cli\u003eCreate exciting customer demos for Pre-Sales and prototype PoCs for user tests\u003c/li\u003e\n\u003cli\u003eOptimize loading speed and performance and increase device support\u003c/li\u003e\n\u003cli\u003eDevelop automated tests to ensure world-class software quality\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour profile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eGraduate in BSc/MSc in Informatics, Data Science, Business Information - Systems or similar\u003c/li\u003e\n\u003cli\u003e2 years professional experience in Software Engineering and web development\u003c/li\u003e\n\u003cli\u003eExcellent knowledge in the HTML5 stack (HTML, JavaScript ES6+, CSS3)\u003c/li\u003e\n\u003cli\u003eProven sense of great design and attention to detail\u003c/li\u003e\n\u003cli\u003eFoundational knowledge in React, LitElement (or a similar library/framework) is a big plus\u003c/li\u003e\n\u003cli\u003eKnowledge in visual prototyping tools such as Figma / Sketch or similar is a plus\u003c/li\u003e\n\u003cli\u003eExperience in Cloud Services (AWS, GCP, similar) is a plus\u003c/li\u003e\n\u003cli\u003eReliable, impact-driven, and eager to learn fast with an independent working style, and aiming to go meet and exceed expectations and go beyond\u003c/li\u003e\n\u003cli\u003eProduct, growth, and excellence-driven mindset with the desire to solve big problems in a startup environment\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://presize.join.com/jobs/1959751-front-end-software-engineer-m-f-d?pid=357a3b4531918760973f\u0026amp;oid=0fab34cd-7456-423f-a568-d9511cb9730b\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=front%2Bend%2Bsoftware%2Bengineer%2Bm%2Bf%2Bd\"\u003ehttps://presize.join.com/jobs/1959751-front-end-software-engineer-m-f-d?pid=357a3b4531918760973f\u0026amp;oid=0fab34cd-7456-423f-a568-d9511cb9730b\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=front%2Bend%2Bsoftware%2Bengineer%2Bm%2Bf%2Bd\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbGFjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2bb1aa1e7f67ae0ad1c081a37c7d55b169e85050/presize.jpg"},{"id":"8a68aad7-c6ae-4b42-a56a-f187f1850207","type":"Full Time","url":"https://jobs.github.com/positions/8a68aad7-c6ae-4b42-a56a-f187f1850207","created_at":"Fri Mar 12 11:55:39 UTC 2021","company":"ValueWorks GmbH","company_url":"https://www.valueworks.ai","location":"Remote","title":"Front-end developer","description":"\u003cp\u003eValueWorks is a management platform to help executives and managers make data-driven management decisions. We enable them to manage and measure the performance of their business by integrating the data from different information systems (JIRA, Salesforce, LinkedIn,) to build KPIs and OKRs.\u003c/p\u003e\n\u003cp\u003eWe are looking for a front-end developer to build and implement our user interface. You will work with our small team consisting of developers, founders and a UX designer. We provide an opportunity to become full-stack by teaching you python and django.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStrong knowledge of HTML, CSS \u0026amp; Javascript\u003c/li\u003e\n\u003cli\u003eVue.js and Vuex experience (alternatively React)\u003c/li\u003e\n\u003cli\u003eAbility to build responsive, cross-browser user interfaces from design prototype\u003c/li\u003e\n\u003cli\u003eAbility to create simple, intuitive web interfaces for complex features.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eNo special qualification is needed. Just experience and talent.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBootstrap experience\u003c/li\u003e\n\u003cli\u003eEagerness to become a full stack developer\u003c/li\u003e\n\u003cli\u003eExperience working with relational databases\u003c/li\u003e\n\u003cli\u003eWe are looking forward to your application.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://valueworks.join.com/jobs/1990556-front-end-developer?pid=357a3b4531918760973f\u0026amp;oid=b83c4b8b-8f91-493f-8bb7-5901344e9f8d\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=front-end%2Bdeveloper\"\u003ehttps://valueworks.join.com/jobs/1990556-front-end-developer?pid=357a3b4531918760973f\u0026amp;oid=b83c4b8b-8f91-493f-8bb7-5901344e9f8d\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=front-end%2Bdeveloper\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbEtjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7aa1d9010f1d849fde6c5634ee2a843cb50b4778/value-works-gmb-h-logo-xl.png"},{"id":"97d8aff5-1c3c-4f41-b4e3-672d3aae0c31","type":"Full Time","url":"https://jobs.github.com/positions/97d8aff5-1c3c-4f41-b4e3-672d3aae0c31","created_at":"Fri Mar 12 11:01:01 UTC 2021","company":"ORTEC - Optimize Your World","company_url":"https://vonq.io/3cfRmbS","location":"Zoetermeer","title":"Junior System Engineer IT Infrastructure","description":"\u003ch2\u003eJob description\u003c/h2\u003e\n\u003cp\u003eHave you just finished your studies or already have experience in IT and you want to play a key role in the functionality of all ORTEC IT products worldwide? Do you want to develop yourself further in the world of IT infrastructure as a (junior/medior) System Engineer IT Infrastructure? Then keep reading!\u003c/p\u003e\n\u003cp\u003eORTEC is world leader in optimizing business processes and enriching data, which enables our customers to be more efficient, profitable and competitive. With our mathematical knowledge, clever algorithms, data science models and software engineering skills, we support global companies in making smart strategic, tactical as well as real-time operational decisions.\u003c/p\u003e\n\u003cp\u003eIn this role as Junior/Medior System Engineer IT Infrastructure, you are part of the Infra Team and you manage, monitor, extend and improve our IT infrastructure globally. You participate in various projects. Key tasks consist of preparing, executing and administration of projects.\u003c/p\u003e\n\u003cp\u003eYou work together with your team on functional and technical maintenance tasks, developing, testing, accepting and implementing of changes and solving third line requests. Using your analytical skills as well as your experience and knowledge you are a knowledgeable sparring partner for the business. Together with your team members you anticipate on how the current infrastructure should develop and how to adapt new technologies beneficial to ORTEC.\u003c/p\u003e\n\u003cp\u003eThe IT department consist of about 30 people, where your team contains 6 including yourself. We have an informal, social atmosphere within the IT department; we go for lunch together, we meet online, we organize events, we know how to have fun, and we share personal stories just as well. And of course we work together a lot, as we believe we all have our strengths and combined we will come to the best solution possible.\u003c/p\u003e\n\u003cp\u003eDo you like to be part of our journey to (continuous) success? Then apply online today, or contact Falko Hage (Recruiter) at \u003ca href=\"mailto:recruitment@ortec.com\"\u003erecruitment@ortec.com\u003c/a\u003e for more information.\u003c/p\u003e\n\u003ch2\u003eWho you are\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eA bachelor’s degree in computer science or comparable level gained through experience\u003c/li\u003e\n\u003cli\u003eYou are currently living in the Netherlands and are able to fluently communicate in Dutch and English (verbally and in writing)\u003c/li\u003e\n\u003cli\u003eYou have 2+ years of experience in IT or are a recent bachelor graduate eager and able to quickly grow into this role.\u003c/li\u003e\n\u003cli\u003eExperienced in:\n\u003cul\u003e\n\u003cli\u003eMicrosoft Windows systems\u003c/li\u003e\n\u003cli\u003eVirtualization platform Hyper-V VMM (VMWare is a preference)\u003c/li\u003e\n\u003cli\u003eNetwork protocols such as TCP/IP, DNS, DHCP and VPN\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/li\u003e\n\u003cli\u003eKnowledge of storage (Microsoft Storage Space Direct), switching/ routing technology and firewalls is a preference\u003c/li\u003e\n\u003cli\u003eAnalytical, with the ability to translate towards solutions\u003c/li\u003e\n\u003cli\u003eYou prefferably have experience in projects and are used to delivering a high standard of quality.\u003c/li\u003e\n\u003cli\u003eYou are open-minded to the ideas of others, and understand the different (cultural) perspectives and you are able to convey your ideas to others\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWhat we offer\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eEntrance to the most passionate powerhouse in applied mathematics\u003c/li\u003e\n\u003cli\u003eWe believe in commitment: your permanent contract will be waiting for you\u003c/li\u003e\n\u003cli\u003eAn open, kind and fun culture\u003c/li\u003e\n\u003cli\u003eNS Business Card, lease opportunity or commuting allowance: it’s your choice\u003c/li\u003e\n\u003cli\u003eMobility allowance of 3% of your base salary\u003c/li\u003e\n\u003cli\u003e25 annual leave days, additional days from the age of 35\u003c/li\u003e\n\u003cli\u003eResult related remuneration\u003c/li\u003e\n\u003cli\u003eYear-end bonus equal to a full month’s pay\u003c/li\u003e\n\u003cli\u003eDevelopment tailored to your needs, including opportunities to attend courses and seminars\u003c/li\u003e\n\u003cli\u003eActive employee association for fun activities with colleagues and content driven Young ORTEC for you to join\u003c/li\u003e\n\u003cli\u003eFootball table, our own bar the “ORtap”, Christmas party, annual barbecue at one of our founders’ home, and much more\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eWhat to expect\u003c/h2\u003e\n\u003cp\u003eWe help you to thrive in your field of expertise. We offer development programs, tailored to your individual needs and function requirements, including opportunities to attend courses and seminars. We offer challenging practical hands-on experience with opportunities to work abroad. We operate a flat organizational structure that keeps communication lines short. The atmosphere is open, informal, cooperative and positive. We employ over 1000 people in the Netherlands (HQ), Belgium, Germany, France, the U.K., Romania, Italy, the U.S., Australia, Brazil, Poland and Denmark.\u003c/p\u003e\n\u003cp\u003eVisit our website \u003ca href=\"http://www.ortec.com\"\u003ewww.ortec.com\u003c/a\u003e to learn more about our solutions and clients' experiences.\u003c/p\u003e\n\u003ch2\u003eInterested?\u003c/h2\u003e\n\u003cp\u003e\u003ca href=\"https://vonq.io/3cfRmbS\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eAcquisition as a result of this vacancy is not appreciated.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/3cfRmbS\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaytjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d5c0c1658651d1b2cdaec63b5c848fdf67dabd65/companyLogo-ORTEC_logo_2021.jpg"},{"id":"31dd226f-7c4d-4b5a-934d-b139c66ed835","type":"Full Time","url":"https://jobs.github.com/positions/31dd226f-7c4d-4b5a-934d-b139c66ed835","created_at":"Fri Mar 12 09:33:16 UTC 2021","company":"ti\u0026m AG","company_url":"https://www.ti8m.com/","location":"Zürich","title":"Senior Software Engineer Web Front-end","description":"\u003cp\u003eti\u0026amp;m steht für technology, innovation \u0026amp; management. Wir sind Leader für Digitalisierungs-, Security-, Innovationsprojekte und -produkte in der Schweiz und streben dasselbe in weiteren Finanz- und Technologiezentren an. Dabei integrieren wir für unsere anspruchsvollen Kunden die gesamte IT-Wertschöpfungskette vertikal. In unseren Niederlassungen in Zürich, Bern, Frankfurt am Main und Singapur beschäftigen wir aktuell über 400 exzellente Ingenieure, Designer und Berater. Weitere Niederlassungen werden folgen. Die Grundlage unseres Wachstums sind unsere Stärken und unsere Werte: Mut, Ideenreichtum, Agilität und unternehmerisches Flair gepaart mit Nachhaltigkeit und Swissness.\u003c/p\u003e\n\u003cp\u003eWen wir suchen:\u003c/p\u003e\n\u003cp\u003eIm Rahmen unseres starken Wachstums suchen wir für die Beratung unserer Kunden und die Umsetzung von Projekten im Bereich Web-Applikationen interessierte Persönlichkeiten als Senior Software-Ingenieur Web-Frontend. Die anspruchsvollen Tätigkeiten setzen einen (Fach-) Hochschulabschluss in Informatik, ausgewiesene Berufserfahrung, stilsicheres Deutsch und Englisch in Wort und Schrift, Flexibilität, Einsatzbereitschaft und Interesse am Umgang mit Kunden und Mitarbeitenden voraus.\u003c/p\u003e\n\u003cp\u003eWas dich erwartet:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUnterstützung bei der Analyse, Konzeption und der Umsetzung von komplexen Projekten im Bereich Web-, CMS-, Shop- und Portallösungen mit Fokus Frontend\u003c/li\u003e\n\u003cli\u003eMitarbeit bei technischen Lösungskonzepten sowie Abwicklung von Beratungsmandaten im Web-Frontend Umfeld\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWas du mitbringen solltest:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMehrjährige Erfahrung in Konzeption, Design und Umsetzung von Frontend-Lösungen mittels modernen Web-Technologien (HTML5, CSS3, JavaScript/TypeScript)\u003c/li\u003e\n\u003cli\u003eErfahrung in der Umsetzung von grafischen Entwürfen für unterschiedliche Ausgabemedien (Desktop und mobile Endgeräte, Responsive Webdesign)\u003c/li\u003e\n\u003cli\u003eFähigkeit, Kompatibilität für die verschiedenen Web-Browser sicherzustellen\u003c/li\u003e\n\u003cli\u003eProfunde Kenntnisse in mindestens einem JavaScript-Framework wie React oder Angular\u003c/li\u003e\n\u003cli\u003eErfahrung mit Build-Tools wie Webpack oder Grunt\u003c/li\u003e\n\u003cli\u003eErfahrungen und Know-how mit CSS-Precompilern wie SASS/SCSS, Stylus oder LESS\u003c/li\u003e\n\u003cli\u003eErfahrung mit Unit- und e2e-Testing Tools wie Jest, Karma, Jasmine, Protractor oder ähnlichen Tools\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWas wir bieten:\u003c/p\u003e\n\u003cp\u003eUnsere Mitarbeitenden wählten uns zu einem der besten Arbeitgeber der Schweiz. Als Gewinner von Best of Swiss Apps und vom Digital Economy Award surfst du mit uns an der Spitze der technologischen Entwicklung. Zudem erlebst du bei uns ein interessantes und dynamisches Umfeld, abwechslungsreiche Arbeit an aufregenden Projekten mit Mut für Innovation, ein kollegiales Arbeitsklima und flexible Arbeitszeiten. Mit ti\u0026amp;m liquid working bieten wir dir ausserdem einfach anpassbare Arbeitszeitmodelle und die Möglichkeit Auszeiten zu nehmen. Die ti\u0026amp;m academy ermöglicht dir konstante Weiterbildung am Puls der Zeit.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://ti8mcareer.abacuscity.ch/de/job_1_1035/Senior-Software-Engineer-Web-Front-end\"\u003ehttps://ti8mcareer.abacuscity.ch/de/job_1_1035/Senior-Software-Engineer-Web-Front-end\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBajJjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--517035d1db291cfa40eb67f565a215a3907f9618/ti8m_logo_ict.jpg"},{"id":"ae9b5e05-e2cc-4461-a07d-69dde55566eb","type":"Full Time","url":"https://jobs.github.com/positions/ae9b5e05-e2cc-4461-a07d-69dde55566eb","created_at":"Fri Mar 12 10:34:34 UTC 2021","company":"v-Office","company_url":"https://intro.v-office.com/de/","location":"Remote","title":"Web-Developer (m,w,d)","description":"\u003cp\u003eWir, das Team von vOffice, tun alles dafür, um unseren Kunden die Arbeit zu erleichtern. Unsere Software macht die Verwaltung und Organisation von Ferienobjekten zum Kinderspiel. Von der Onlinebuchung auf unseren Websites bis zur Team-Einsatzplanung wird alles über unsere moderne Cloudsoftware abgewickelt. Als schnell wachsendes Unternehmen und Marktführer in Deutschland benötigen wir tatkräftige Unterstützung im Bereich Web-Entwicklung.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAufgaben\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eJeder unserer Kunden braucht eine tolle Webseite. Viele nutzen dafür unser in-house-Angebot, dass auf unserem custom CMS beruht. Du richtest darin neue Websites ein, d.h. Du integrierst die individuellen Anforderungen in die vorhandenen Templates. Du entwickelst die Templates weiter, damit jeder unserer Kunden das Passende findet. Und Du hilfst unseren Bestandskunden, ihre Websites zu verbessern und zu aktualisieren.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eQualifikation\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFundierte Kenntnisse in der Webseiten-Entwicklung: CSS (LESS/Post CSS), Javascript, webpack, Erfahrung mit Vue.js von Vorteil\u003c/li\u003e\n\u003cli\u003eAutonome und strukturierte Arbeitsweise\u003c/li\u003e\n\u003cli\u003eZielorientierter Teamplayer, den nichts so schnell aus der Ruhe bringt\u003c/li\u003e\n\u003cli\u003eEnglisch (verhandlungssicher)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWerde Teil eines sympathischen Teams in einem dynamischen Umfeld\u003c/li\u003e\n\u003cli\u003eViel Handlungsspielraum, kurze Abstimmungswege\u003c/li\u003e\n\u003cli\u003eEin flexibles, familienfreundliches Arbeitszeitmodell\u003c/li\u003e\n\u003cli\u003eEin modern ausgestatteter Arbeitsplatz mit Blick auf die Ostsee oder citynah in Hamburg-Altona\u003c/li\u003e\n\u003cli\u003eHome-Office möglich, egal wo Du wohnst\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eDas ist der richtige Job wenn Du Bock hast auf\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStart-up-Feeling\u003c/li\u003e\n\u003cli\u003eTeam-Work\u003c/li\u003e\n\u003cli\u003eGestalten und Gewinnen\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://v-office.join.com/jobs/1970469-web-developer-m-w-d?pid=357a3b4531918760973f\u0026amp;oid=53e226e2-b7d9-4793-8c22-7ed2d2dfa8a3\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=web-developer%2Bm%2Bw%2Bd\"\u003ehttps://v-office.join.com/jobs/1970469-web-developer-m-w-d?pid=357a3b4531918760973f\u0026amp;oid=53e226e2-b7d9-4793-8c22-7ed2d2dfa8a3\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=web-developer%2Bm%2Bw%2Bd\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3ljIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bf22073c9b977970f4037000ce0183594ac5db4b/v-office-logo-xl.jpg"},{"id":"457c1b76-447a-4b55-b8a5-cb14fe08c626","type":"Full Time","url":"https://jobs.github.com/positions/457c1b76-447a-4b55-b8a5-cb14fe08c626","created_at":"Fri Mar 12 10:24:17 UTC 2021","company":"Flexoptix GmbH","company_url":"http://www.flexoptix.net","location":"Darmstadt","title":"Mobile Software Engineer, Senior","description":"\u003cp\u003eWe’re looking to grow our product development team!\u003c/p\u003e\n\u003cp\u003eMobile Software Engineer, Senior\u003c/p\u003e\n\u003cp\u003eFor over twelve years Flexoptix has been a successful provider for transceiver solutions. With over 50 colleagues, we occupy a growing niche that we have successfully disrupted and defined through our unconventional approach.\u003c/p\u003e\n\u003cp\u003eYou will be part of our development team, not just limited to software development using the latest technologies, but also finding new challenges, as well as solutions for our company.\u003c/p\u003e\n\u003cp\u003eWe hope for your support with:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign of innovative software solutions\u003c/li\u003e\n\u003cli\u003eCoding our apps\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat you bring to the table:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePassion for software development; ideally you’d contribute to open-source projects\u003c/li\u003e\n\u003cli\u003eA remote workplace, since we're on a pandemic remote working schedule\u003c/li\u003e\n\u003cli\u003eThe ability to work at the office in Darmstadt once the pandemic isn't a challenge anymore\u003c/li\u003e\n\u003cli\u003eWillingness to shape our self-organizing team\u003c/li\u003e\n\u003cli\u003eSkills in Swift and a great interest in SwiftUI and Apple design guidelines\u003c/li\u003e\n\u003cli\u003eYou want to get into Android development and can tell us if Kotlin is worth considering\u003c/li\u003e\n\u003cli\u003eYou’re a Linux Guru and know how to use a shell\u003c/li\u003e\n\u003cli\u003eYou already have experience with one or more of the following scripting languages: Lua,\nJavaScript, Python and Bash\u003c/li\u003e\n\u003cli\u003eYou are pleased that everything is committed through git and you would like to help us with the\ndocumentation in our Atlassian products\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat you can expect from us:\nWe’re a pragmatic bunch of cowboys who think outside the box, which helps us to find creative solutions for technical problems. We offer a lot of freedom as well as opportunities to Influence our processes, though with great power comes great responsibility. This freedom also includes the choice of tools and materials, as well as ways of personal development (conferences, workshops, teachings, webinars).\u003c/p\u003e\n\u003cp\u003eApply now! We’re looking forward to meeting you in person. 😷\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease send our application to our HR Office via email: \u003ca href=\"mailto:jobs@flexoptix.net\"\u003ejobs@flexoptix.net\u003c/a\u003e.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3FjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--317537e02f818fe8798605ef6ad1666fe7eae3f1/FO_Logo_Sonderform_RGB.jpg"},{"id":"d42fd076-e1cb-482f-8329-b34ea3f1a634","type":"Full Time","url":"https://jobs.github.com/positions/d42fd076-e1cb-482f-8329-b34ea3f1a634","created_at":"Fri Mar 12 10:01:07 UTC 2021","company":"Nictiz","company_url":"https://www.nictiz.nl/","location":"Den Haag","title":"Developer ART-DECOR","description":"\u003cp\u003eIs het jouw uitdaging om als Developer (Front/Back-End) onze ART-Decor omgeving perfect op orde te krijgen en houden? Wil jij je steentje bijdragen in de standaardisatie in de zorg? Dan maken wij graag kennis met jou. Twijfel niet en solliciteer direct!\u003c/p\u003e\n\u003cp\u003eNictiz heeft voor haar locatie in Den Haag een vacature voor een\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDeveloper ART-DECOR\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTer uitbreiding van het Toolingcentrum van Nictiz zijn wij op zoek naar ART-Decor DeveloperS (Front/Back-End) die meewerken aan de (door)ontwikkeling van onze ART-DECOR omgeving.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat ga je doen als Developer ART-DECOR?\u003c/strong\u003e\nART-DECOR is een open source ontwikkelingstool, wat door Nictiz gebruikt wordt bij het opstellen, beheren en beschikbaar stellen van informatiestandaarden. ART-DECOR wordt intern en extern intensief gebruikt. Nictiz wil de verdere ontwikkeling van ART-DECOR met voorrang aanpakken.\u003c/p\u003e\n\u003cp\u003eAls Front-End Developer wordt het jouw taak om te werken aan een noodzakelijke platformverbetering, maar ook het vergroten van de gebruiksvriendelijkheid en uitbreiding van functionaliteit. Deze verbeteringen moeten goed aansluiten op de eisen en wensen van gebruikers. Ook zal je een rol spelen bij het realiseren van Nictiz specifieke wensen.\u003c/p\u003e\n\u003cp\u003eAls Back-End Developer wordt het jouw taak om te werken aan de doorontwikkeling van ons platform, waaronder API ontwikkeling.\nOnze back-end bestaat uit NoSQL database (eXist-db), XQuery, JSON/SML en OpenAPI (OAS).\nNaast het ontwikkelen, ben je ook verantwoordelijk voor het testen én documenteren van de ontwikkelde functionaliteit.\u003c/p\u003e\n\u003cp\u003eOm tot de juiste oplossingen te komen, werken wij niet alleen als team samen, maar ook met andere belanghebbende, zoals de Internationale Expertgroep.\nVoor meer informatie \u003ca href=\"https://www.nictiz.nl/standaardisatie/art-decor/\"\u003ehttps://www.nictiz.nl/standaardisatie/art-decor/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat breng je mee?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHBO opleiding op het gebied informatiekunde is een pre;\u003c/li\u003e\n\u003cli\u003eAls Back-end developer: Ervaring met XQuery, Open API, Git, REST en JSON;\u003c/li\u003e\n\u003cli\u003eAls Front-end: Ervaring met Vue.js, Git, REST en JSON;\u003c/li\u003e\n\u003cli\u003eJe bent communicatief vaardig (Nederlands en Engels) en klantgericht;\u003c/li\u003e\n\u003cli\u003eJe bent in staat zelfstandig te functioneren;\u003c/li\u003e\n\u003cli\u003eUitstekend analytisch vermogen.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDe volgende kennis is een pré, zeker geen must:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKennis van en ervaring met informatiestandaarden in de zorg;\u003c/li\u003e\n\u003cli\u003eKennis en ervaring met FHIR;\u003c/li\u003e\n\u003cli\u003eKennis en ervaring met terminologiestelsels zoals SNOMED en LOINC.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWat biedt Nictiz jou?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEen mooi, marktconform salaris;\u003c/li\u003e\n\u003cli\u003eAantrekkelijke secundaire arbeidsvoorwaarden, zoals een premievrij pensioen, eindejaarsuitkering, korting op ziektekostenverzekering;\u003c/li\u003e\n\u003cli\u003eEen jaarlijks persoonlijk opleidingsbudget van 5% van je bruto jaarsalaris;\u003c/li\u003e\n\u003cli\u003eEen jaarcontract voor 32 – 40 uur met mogelijkheid tot verlenging en aansluitend uitzicht op vast dienstverband;\u003c/li\u003e\n\u003cli\u003eEen gedreven en enthousiast team, dat samenwerking hoog in het vaandel heeft en vol ambitie zit;\u003c/li\u003e\n\u003cli\u003eEen fijne werksfeer met ruimte voor reflectie.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOver Nictiz\u003c/strong\u003e\nNictiz is de landelijke, onafhankelijke kennisorganisatie die zich inzet voor digitale informatie-uitwisseling in de zorg. Nictiz doet dit onder meer door het gebruiksgericht ontwikkelen en het beheren van informatiestandaarden in opdracht van en samen met de partijen in de zorg. Nictiz signaleert en adviseert partijen in de zorg over informatie-uitwisseling en over (toekomstige) nationale en internationale ontwikkelingen.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eWe maken graag ruimte voor jouw expertise!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMeer informatie\u003c/strong\u003e\nVoor meer informatie over de functie of de selectieprocedure kun je contact opnemen met onze recruiter, Audrey van der Linde, via 06 2120 5164 of \u003ca href=\"werving@nictiz.nl\"\u003ewerving@nictiz.nl\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSolliciteren op de functie van Developer ART-DECOR\u003c/strong\u003e\nGeen vragen meer, maar wil je direct solliciteren? Upload dan snel je Curriculum Vitae en motivatiebrief via onze \u003cstrong\u003e\u003ca href=\"https://nictiz.zohorecruit.eu/jobs/Careers/31034000000823039/Developer-ART-DECOR?source=CareerSite\u0026amp;utm_source=github\u0026amp;utm_medium=referral\u0026amp;utm_term=2021\u0026amp;utm_content=181174\u0026amp;utm_campaign=developer-art-decor\"\u003esollicitatiepagina\u003c/a\u003e\u003c/strong\u003e.\u003c/p\u003e\n\u003cp\u003eAcquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eTrefwoorden: Developer, Front-end Developer, Back-end Developer, IT, ICT, Informatiekunde, HBO, vacature Den Haag\u003c/em\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2FjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d3fb9696e42749259b9ac102696614d649c01926/Logo%202021.jpg"},{"id":"8a221c8f-0722-483a-9c8b-94b76769873d","type":"Full Time","url":"https://jobs.github.com/positions/8a221c8f-0722-483a-9c8b-94b76769873d","created_at":"Fri Mar 12 09:57:21 UTC 2021","company":"BLVRD","company_url":"http://www.blvrd.de/home-gh","location":"Hannover (Germany)","title":"Backend Developer (m/w/d) - Java (Spring Boot)","description":"\u003cp\u003eBLVRD ist die erste Online-Plattform für lokale Mode. Mit unserer Cross-Platform-App revolutionieren wir die Art, wie Menschen lokal Mode shoppen und arbeiten hier bereits mit großen Namen aus der Branche zusammen. Unser Ziel ist es, dem lokalen Handel wieder auf die Beine zu helfen und Paketmüll durch Online-Retouren zu reduzieren.\u003c/p\u003e\n\u003cp\u003eGemeinsam mit dem Team steuerst du die Weiterentwicklung unseres Backends hin zu einer Plug\u0026amp;Play-Lösung, um die Anbindung neuer Händler iterativ zu vereinfachen. Dabei bist du bei uns Teil eines crossfunktionalen Teams, in dem jeder liebt, was er tut und sein Bestes gibt - für das große Ganze.\u003c/p\u003e\n\u003cp\u003eDEINE AUFGABEN\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu entwickelst Services für den Import und das Mapping der Produkt- \u0026amp; Bestandsdaten lokaler\nHändler\u003c/li\u003e\n\u003cli\u003eDu entwickelst skalierbare Micro-Services, die schnell wachsende Nutzerzahlen unterstützen können\u003c/li\u003e\n\u003cli\u003eDu unterstützt bei der Konzeption und Entwicklung unserer Full-Service Lösung zur Digitalisierung\ndes Modehandels (Produkt- \u0026amp; Bestandsdatenaktualisierung)\u003c/li\u003e\n\u003cli\u003eDu unterstützt bei der Konzeption \u0026amp; Entwicklung unseres internen App-CMS\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDEINE SKILLS\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu hast mindestens 2 Jahre Erfahrung mit Java-Entwicklung (Spring Boot)\u003c/li\u003e\n\u003cli\u003eDu kennst dich mit Datenbanksystemen wie MongoDB und PostgreSQL aus\u003c/li\u003e\n\u003cli\u003eDu siehst in Problemen keine Hindernisse, sondern Chancen für dich persönlich, dein Team und\nBLVRD\u003c/li\u003e\n\u003cli\u003eDu triffst schnell, smarte Entscheidungen und wägst das Risiko intelligent ab\u003c/li\u003e\n\u003cli\u003eDu verfügst über eine ausgeprägte ‘Hands-on’ Mentalität, du liebst es, mit anzupacken und Erfolge zu\nsehen\u003c/li\u003e\n\u003cli\u003eNice-To-Have: Erfahrung mit Firebase, GraphQL und/oder Elastic Search\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBENEFITS\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDie Möglichkeit, die erste SaaS-Plattform für lokale Einkaufserlebnisse mit aufzubauen\u003c/li\u003e\n\u003cli\u003eEin junges Team mit starkem Zusammenhalt und flachen Hierarchien\u003c/li\u003e\n\u003cli\u003eStart-up-Mentalität: dynamische Atmosphäre und großartiger Teamspirit.\u003c/li\u003e\n\u003cli\u003eKreative Freiheit und den Raum, diese zu leben, ob remote oder bei uns im Office mit Blick über\nHannover.\u003c/li\u003e\n\u003cli\u003eExponentielle Lernkurve – BLVRD wächst rasant und das gleiche erwarten wir von dir. Du stehst nie\nstill, du wirst permanent gechallenged, lernst aus deinen Fehlern a la Fail Fast and Often.\u003c/li\u003e\n\u003cli\u003eEin top motiviertes Team, das dafür brennt, eine nachhaltige Alternative zum ,,Establishment“ der\nOnline-Pure-Player im Mode-Bereich zu bieten, ohne Paketmüll und Retouren.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eINTERESSE GEWECKT?\nDann steck deine Zeit nicht in ein Anschreiben, sondern schick uns deinen CV und Links zu deinen letzten Projekten an \u003ca href=\"mailto:hello@blvrd.de\"\u003ehello@blvrd.de\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eINTERESSE GEWECKT?\nDann steck deine Zeit nicht in ein Anschreiben, sondern schick uns deinen CV und Links zu deinen letzten Projekten an \u003ca href=\"mailto:hello@blvrd.de\"\u003ehello@blvrd.de\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa09jIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--80145599ed4c3ac326056a1f60c1a0c22bfcdb68/BLVRD%20Logo%20Schrift%202.png"},{"id":"6283a69f-6cee-4f59-9386-c2fd9619e918","type":"Full Time","url":"https://jobs.github.com/positions/6283a69f-6cee-4f59-9386-c2fd9619e918","created_at":"Fri Mar 12 09:21:20 UTC 2021","company":"Politie","company_url":"http://www.politie.nl","location":"Odijk","title":"Java ontwikkelaar Opsporing (FOV)","description":"\u003cp\u003e\u003cstrong\u003eJava ontwikkelaar Opsporing (FOV)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAls Java ontwikkelaar bij het domein Opsporing zit je bovenop onze meest cruciale informatievoorzieningsdiensten voor de uitvoerende politiecollega’s. Het bouwen en onderhouden van centrale politiesystemen en producten die cruciaal zijn voor het politiewerk op straat en in de opsporing: dat is wat jij doet als Java ontwikkelaar bij het Productiehuis in Odijk.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat ga je doen?\u003c/strong\u003e\nDe verregaande digitalisering van de samenleving vraagt om een kentering in het denken en werken van de politie én om optimale informatievoorziening. Waar sporen zich vroeger hoofdzakelijk beperkten tot fysieke resten zoals bloed of vingerafdrukken, heeft de hedendaagse criminaliteit vrijwel altijd ook een digitale component. En die wordt letterlijk met de dag groter en zwaarwegender. Willen we die criminaliteit terugdringen, dan is het van cruciaal belang om continu vernieuwende ICT te ontwikkelen. Als Java ontwikkelaar binnen het Opsporing domein speel jij hierin een zeer belangrijke rol. Jij ontwikkelt en beheert samen met je andere DevOps teamleden bestaande en nieuwe applicaties. Als ervaren ontwikkelaar voer jij de regie over diverse programmeeropdrachten.\u003c/p\u003e\n\u003cp\u003eJij pakt je verantwoordelijkheid bij het:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e(door)ontwikkelen van centrale politiesystemen;\u003c/li\u003e\n\u003cli\u003euitleveren van software conform kwaliteits- en performance-eisen;\u003c/li\u003e\n\u003cli\u003everzorgen van (installatie)scripts;\u003c/li\u003e\n\u003cli\u003eondersteunen van het Ops-team bij het uitvoeren van installaties;\u003c/li\u003e\n\u003cli\u003eadviseren over toe te passen methodes en technieken.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWaar ga je werken?\u003c/strong\u003e\nAls Java ontwikkelaar bij het domein Opsporing maak je deel uit van het Productiehuis. Binnen het Productiehuis zijn zeven productielijnen ingericht; elke productielijn bedient een specifiek domein. Deze vacature betreft een functie binnen de productielijn Opsporing. In deze productielijn werken meerdere DevOps teams aan Opsporing-applicaties in vijf clusters. Jij gaat werken in het Cluster Forensische Opsporing en Verhoorregistratie (FOV). De DevOps teams werken nauw samen met de Product Owner om de wensen, behoeften en problemen van de eindgebruikers te realiseren en/of op te lossen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWie ben jij?\u003c/strong\u003e\nEr wordt verwacht dat je een teamspeler bent want we werken agile/scrum. Je bent flexibel, open en eerlijk en je neemt je verantwoordelijkheid als persoon en als teamlid. Een proactieve houding en de juiste communicatieve skills zijn hierbij een vereiste. Jij bent iemand met een frisse blik, iemand die open staat voor veranderingen en de drive heeft om continu de dienstverlening te verbeteren. Je bent ondernemend, creatief en wilt met jouw ideeën graag iets bijdragen aan het politiewerk. Je staat open voor nieuwe zaken, bent van nature nieuwsgierig en leergierig. Werken in een dynamische en soms hectische omgeving past bij jou als persoon. Daarnaast ben je goed in staat om je eigen werk te organiseren en durf je kritische vragen te stellen. Je kunt over de grenzen van het eigen vakgebied heen kijken en verbindingen leggen. Je hebt een oplossend denkvermogen.\u003c/p\u003e\n\u003cp\u003eVerder beschik je over:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ehbo-diploma, bijvoorbeeld in de richting (technische) informatica of software-engineering;\u003c/li\u003e\n\u003cli\u003ewerkervaring met Agile-, CI-CD en DevOps omgevingen;\u003c/li\u003e\n\u003cli\u003eup-to-date ervaring met Java 8 of hoger;\u003c/li\u003e\n\u003cli\u003ewerkervaring met Oracle WebLogic Server 12 of JBoss EAP 7;\u003c/li\u003e\n\u003cli\u003ewerkervaring met:\u003c/li\u003e\n\u003cli\u003ein frontend én backend ontwikkelen;\u003c/li\u003e\n\u003cli\u003eJava enterprise applicaties;\u003c/li\u003e\n\u003cli\u003emicroservices bij voorkeur in een cloud omgeving;\u003c/li\u003e\n\u003cli\u003eJenkins, Maven, SonarQube, Bitbucket, Jira en Confluence;\u003c/li\u003e\n\u003cli\u003ewerkervaring met testautomatisering, bij voorkeur met Fitnesse en Cucumber;\u003c/li\u003e\n\u003cli\u003ebij voorkeur werkervaring met Springboot framework of Quarkus en secure software development, SAST, OWASP en DAST tools.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWat wij bieden\u003c/strong\u003e\nDe standplaats is Odijk. Er is ruimte voor 5 fte. Het betreft een functie voor 36 uur per week.\u003c/p\u003e\n\u003cp\u003eOmdat goede mensen belangrijk zijn binnen de politie investeren we in jouw toekomst. We bieden uitgebreide ontwikkelingsmogelijkheden en een vaste aanstelling, waarbij een proeftijd van 1 jaar van toepassing is.\u003c/p\u003e\n\u003cp\u003eVerder kun je het volgende van ons verwachten:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eeen bruto maandsalaris van minimaal € 2.866,- en maximaal € 4.624, - (schaal 10 Bbp) op basis van een 36-urige werkweek;\u003c/li\u003e\n\u003cli\u003e8% vakantie- en 8,33% eindejaarsuitkering;\u003c/li\u003e\n\u003cli\u003egoede pensioenregeling en betaald ouderschapsverlof (\u003ca href=\"https://kombijde.politie.nl/binaries/content/assets/academie/lfnp/lfnp62.pdf\"\u003emeer info over verlof, regelingen en mogelijkheden\u003c/a\u003e).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDe formele functie binnen het functiegebouw van de politie is bedrijfsvoeringspecialist B, werkterrein informatie- en communicatietechnologie.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eBel of mail met Katja Damming, ICT Recruiter, (06 - 53 29 83 17, \u003ca href=\"katja.damming@politie.nl\"\u003ekatja.damming@politie.nl\u003c/a\u003e) als je meer informatie over de functie wilt hebben.\u003c/p\u003e\n\u003cp\u003eSolliciteer uiterlijk 8 april  2021 via de \u003ca href=\"https://kombijde.politie.nl/vacatures/java-ontwikkelaar-opsporing-fov-_2653649.html?utm_source=adveronline\u0026amp;utm_medium=paid\u0026amp;utm_content=vacature-alert\u0026amp;utm_campaign=niet-initieel-java-ontwikkelaar-opsporing\u0026amp;utm_term=44266\"\u003esollicitatiebutton\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat verder belangrijk is\u003c/strong\u003e\n•\tEen veiligheidsonderzoek maakt deel uit van de selectieprocedure.\n•\tZonder IT'ers zijn we nergens. Ben jij expert in IT? Lees alles over o.a. data science, legaal hacken of cybersecurity en test je digitale skills in de Cybercrime challenge op \u003ca href=\"https://it.kombijdepolitie.nl/?_ga=2.153159032.194516751.1615447825-1788394226.1615447825\"\u003eit.kombijdepolitie.nl\u003c/a\u003e\n•\tDe politie zet in op vernieuwing en cultuurverschillen binnen teams. Divers samengestelde teams presteren beter. Daarom werken we hard aan een open en veilige cultuur waarin divers talent tot bloei komt.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBamFjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1c9e7776e9963ab48c83f7c43af9fe0e70960096/logo%202021%20blauw.jpg"},{"id":"9ae220e5-a889-493a-9523-0ecf39b89a03","type":"Full Time","url":"https://jobs.github.com/positions/9ae220e5-a889-493a-9523-0ecf39b89a03","created_at":"Fri Mar 12 09:15:59 UTC 2021","company":"Torn Banner Studios","company_url":"https://vonq.io/3ev8wVF","location":"Toronto","title":"Lead Programmer","description":"\u003ch2\u003eCompany Description\u003c/h2\u003e\n\u003cp\u003eWe're the studio behind the hit franchise Chivalry: Medieval Warfare. At Torn Banner we understand that long, hard hours are not conducive to being a happy, healthy person. Combine this idea with a flat studio structure and profit sharing and you've got ideals that promote a positive, low stress environment to help us create awesome games. As a small team of developers, each individual has a huge impact on the final product that we put out, so we put emphasis on being open with each other, giving/receiving critical feedback, and not letting an false sense of authority cloud our vision. The more eyes and input that we have from different disciplines and personality types, the better our releases will be.\u003c/p\u003e\n\u003ch2\u003eJob Description\u003c/h2\u003e\n\u003cp\u003eTorn Banner Studios is looking for a Lead Programmer to manage the programming team. The ideal candidate is passionate about providing high-level direction, supporting a team of engineers, and getting their hands dirty with day-to-day development.\u003c/p\u003e\n\u003cp\u003eYou are an accomplished engineer that enjoys collaborating closely with the engineering team to build a technically excellent game across multiple platforms.\u003c/p\u003e\n\u003ch2\u003eQualifications\u003c/h2\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLead and manage a programming team at technical and personnel level\u003c/li\u003e\n\u003cli\u003eProvide estimate time to complete programming task/objectives and be committed to meet them\u003c/li\u003e\n\u003cli\u003eHelp in setting up best practices for coding and conduct regular code reviews\u003c/li\u003e\n\u003cli\u003eEncourage and help guide the creation of technical design documents\u003c/li\u003e\n\u003cli\u003eSetup a process to review the game on a regular interval during development cycle and identify area of improvement\u003c/li\u003e\n\u003cli\u003eCollaborate directors, designers and production to ensure efficient development practices\u003c/li\u003e\n\u003cli\u003eEnsure that solid coding practices, technical briefs and code reviews are maintained\u003c/li\u003e\n\u003cli\u003eMaintain regular internal communications and encourage a positive and ambitious team atmosphere\u003c/li\u003e\n\u003cli\u003eDemonstrate good leadership, enthusiasm and sense of commitment\u003c/li\u003e\n\u003cli\u003eTake responsibility for recruitment, on-boarding, development and professional training of the programming team\u003c/li\u003e\n\u003cli\u003ePropose solutions to improve the development of projects in the studio\u003c/li\u003e\n\u003cli\u003eMaintain a strong understanding of multiplayer FPS games\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProficiency in C++\u003c/li\u003e\n\u003cli\u003eAt least 5 years professional video game programming experience\u003c/li\u003e\n\u003cli\u003eA strong and efficient communicator with excellent management skills\u003c/li\u003e\n\u003cli\u003eA bachelor's degree in Computer Science, Software Engineering, or equivalent.\u003c/li\u003e\n\u003cli\u003ePrevious leadership/mentorship experience, or leadership interest and potential\u003c/li\u003e\n\u003cli\u003eA good knowledge of programming languages and software engineering practices\u003c/li\u003e\n\u003cli\u003eExperience developing AAA titles on multiple platforms\u003c/li\u003e\n\u003cli\u003eExperience with Unreal Engine 4 or other large engines\u003c/li\u003e\n\u003cli\u003eComfortable wandering around unexplored game design territory, and excited to help refine ideas i-into shippable features\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBonus\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePrevious experience as a Lead Programmer on a shipped game\u003c/li\u003e\n\u003cli\u003ePrevious experience in small/medium sized development studios\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eAdditional Information\u003c/h2\u003e\n\u003cp\u003e\u003cem\u003ePortfolio and résumé required for any application.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eBenefits \u0026amp; Perks\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProfit sharing\u003c/li\u003e\n\u003cli\u003e4 weeks Paid vacation\u003c/li\u003e\n\u003cli\u003eA no crunching policy\u003c/li\u003e\n\u003cli\u003eRelocation assistance\u003c/li\u003e\n\u003cli\u003eFlexible schedule\u003c/li\u003e\n\u003cli\u003eWeekly happy hour\u003c/li\u003e\n\u003cli\u003eHealthcare \u0026amp; benefits\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vonq.io/3ev8wVF\"\u003eClick here for the application form!\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBalNjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--349a9542c9ff7207b95dfa4546cbccfd58273968/torn%20banner.jpg"},{"id":"2f4a4132-7625-4364-b22f-c5db175e8ede","type":"Full Time","url":"https://jobs.github.com/positions/2f4a4132-7625-4364-b22f-c5db175e8ede","created_at":"Fri Mar 12 08:42:30 UTC 2021","company":"Politie","company_url":"http://www.politie.nl","location":"Odijk","title":"Lead software engineer","description":"\u003cp\u003e\u003cstrong\u003elead software engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHet doel van het Programma Vernieuwend Registreren? Een landelijk platform realiseren waar al onze applicaties voor agenten op straat samenkomen. Met als resultaat: nog effectievere opsporing en handhaving. Als lead software engineer bouw je vanuit Odijk mee aan dit platform en focus je op het refactoren, innoveren en upgraden van de applicaties. Zo draag je bij aan een veiliger Nederland.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat ga je doen?\u003c/strong\u003e\nJe hebt een belangrijke rol in het tot stand brengen en up and running houden van het operationeel platform van de politie. Een flinke klus, want het platform telt ruim 50.000 gebruikers en combineert veel gegevens. Denk aan digitale informatie over aangiftes, executie en signalering, boetes, veroordelingen, straffen en daderinformatie. Mede dankzij jouw inzet kunnen agenten die gegevens snel en via hun mobiel verkrijgen. Zo verbeter je het opsporings- en handhavingsproces.\u003c/p\u003e\n\u003cp\u003eSamen met je team pas je nieuwe technieken toe en ontwikkel en beheer je applicaties. Jullie zijn ook (mede)verantwoordelijk voor het ontwikkelen, realiseren, uitdragen en bewaken van de visie op het platform. Zo vormen je collega’s en jij de technische basis waarop ook andere IT-developmentteams software kunnen bouwen. Doen er zich complexe problemen voor? Dan lossen jullie die op. Daarbij maak je onder andere gebruik van reactive programming.\u003c/p\u003e\n\u003cp\u003eDe ene dag werk je aan generieke componenten en de andere dag buig je je over een complex framework. Daarnaast geef je inhoudelijke support aan collega-developers. Je ontwikkelt de domain-specific language waarmee de featureteams Resource Description Framework-data kunnen ophalen, aanmaken én manipuleren. Verder werk je met backend-engineers aan de communicatie tussen client en backend via REST-services en WebSockets. Je zorgt er te allen tijde voor dat je code onderhoudbaar en goed getest is, zodat anderen er optimaal gebruik van kunnen maken.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWaar ga je werken?\u003c/strong\u003e\nJe werkt in het Productiehuis van de Dienst ICT. Hier ontwikkelen multidisciplinaire DevOps-teams snel en flexibel nieuwe functionaliteiten voor de operationele politiediensten. Binnen het Productiehuis maak jij deel uit van het Platformteam. Dit bestaat uit vijftien hardwerkende en gepassioneerde mensen van verschillende leeftijden. Zo is de jongste 33 en de oudste 64. Negen posities zijn extern opgevuld, maar we willen graag meer interne kandidaten verwelkomen om de kennis te borgen. Waar we heel blij van worden? Nieuwe technologieën benutten! Verder is het goed om te weten dat het weleens kan voorkomen dat je buiten kantoortijd wordt opgeroepen. Het werk van de politie gaat immers 24/7 door.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWie ben jij?\u003c/strong\u003e\nEen IT-professional met liefde voor het vak. Je bent nieuwsgierig en constant op zoek naar mogelijkheden om nieuwe technologieën in te zetten. Daarnaast houd je ervan om resultaten te boeken en stel je jezelf regelmatig de vraag: hoe kan dit nog beter? Jouw creatieve ideeën deel je graag. Bovendien ben je een echte teamspeler en pas je je gemakkelijk aan wanneer de situatie daarom vraagt. Verder heb je:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eeen hbo-diploma in de richting van ICT;\u003c/li\u003e\n\u003cli\u003eminimaal vier jaar relevante ervaring als core clientside-engineer;\u003c/li\u003e\n\u003cli\u003eminimaal twee jaar relevante ervaring met TypeScript;\u003c/li\u003e\n\u003cli\u003ekennis van Angular 2+, Node.js en RxJS;\u003c/li\u003e\n\u003cli\u003ekennis van Gang of Four (GoF) en reactive programming design patterns.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWat wij bieden\u003c/strong\u003e\nDe standplaats is Odijk. Er is ruimte voor 1 fte. Het betreft een functie voor 36 uur per week. Omdat goede mensen belangrijk zijn binnen de politie investeren we in jouw toekomst. We bieden uitgebreide ontwikkelingsmogelijkheden en een vaste aanstelling, waarbij een proeftijd van één jaar van toepassing is.\u003c/p\u003e\n\u003cp\u003eVerder kun je het volgende van ons verwachten:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eeen bruto maandsalaris van minimaal € 3.502,- en maximaal € 5.228,- (schaal 11 Bbp) op basis van een 36-urige werkweek;\u003c/li\u003e\n\u003cli\u003e8% vakantie- en 8,33% eindejaarsuitkering;\u003c/li\u003e\n\u003cli\u003egoede pensioenregeling en betaald ouderschapsverlof (\u003ca href=\"https://kombijde.politie.nl/vakgebieden/arbeidsvoorwaarden\"\u003emeer info over verlof, regelingen en mogelijkheden\u003c/a\u003e).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDe formele functie binnen het functiegebouw van de politie is \u003ca href=\"https://kombijde.politie.nl/binaries/content/assets/academie/lfnp/lfnp61.pdf\"\u003ebedrijfsvoeringspecialist C\u003c/a\u003e, werkterrein informatie- en communicatietechnologie.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eNeem contact op met Donja Huidar, Recruiter ICT als je meer informatie over de functie wilt hebben via 06 - 18 63 45 09 of \u003ca href=\"donja.huidar@politie.nl\"\u003edonja.huidar@politie.nl\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eSolliciteer uiterlijk 24 maart 2021 via de \u003ca href=\"https://kombijde.politie.nl/vacatures/lead-software-engineer_2633669.html?utm_source=adveronline\u0026amp;utm_medium=paid\u0026amp;utm_content=vacature-alert\u0026amp;utm_campaign=niet-initieel-lead-software-engineer\u0026amp;utm_term=44266\"\u003esollicitatiebutton\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat verder belangrijk is\u003c/strong\u003e\n•\tEen veiligheidsonderzoek P maakt deel uit van de selectieprocedure.\n•\tZonder IT'ers zijn we nergens. Ben jij expert in IT? Lees alles over o.a. data science, legaal hacken of cybersecurity en test je digitale skills in de Cybercrime challenge op \u003ca href=\"https://it.kombijdepolitie.nl/?_ga=2.153183736.194516751.1615447825-1788394226.1615447825\"\u003eit.kombijdepolitie.nl\u003c/a\u003e\n•\tDe politie zet in op vernieuwing en cultuurverschillen binnen teams. Divers samengestelde teams presteren beter. Daarom werken we hard aan een open en veilige cultuur waarin divers talent tot bloei komt\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTZjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9488e22cbaa07d19ea02ddc2329a8421594f96e8/logo%202021%20blauw.jpg"},{"id":"aa52a585-f919-4205-8b33-690187ef7a60","type":"Full Time","url":"https://jobs.github.com/positions/aa52a585-f919-4205-8b33-690187ef7a60","created_at":"Fri Mar 12 05:30:20 UTC 2021","company":"Koffie Labs","company_url":"http:","location":"Remote","title":"Software Engineer","description":"\u003cp\u003eThis is a unique role that offers broad exposure to software engineering and data science. We are eager to find underrepresented candidates who are early in their career and don’t want to choose between engineering or data science.\u003c/p\u003e\n\u003cp\u003eWorking with data science and engineering, you will be deeply enmeshed in the critical nuances of disambiguation, normalization, standardization and other ETL skills. You will also have the opportunity to work in all stages of our software process from researching data sources to developing data pipelines and building business intelligence visualization tools.\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign and build data pipelines\u003c/li\u003e\n\u003cli\u003eRun and iterate data science experiments in the cloud and in a production environment\u003c/li\u003e\n\u003cli\u003eSupport business intelligence and data science needs via visualization/reporting\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBackground/Experience\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUndergraduate CS degree or equivalent; 3-5 years professional experience\u003c/li\u003e\n\u003cli\u003eFluent in python; the ideal candidate will be comfortable with web programming, consuming APIs, data wrangling, SQL, etc.\u003c/li\u003e\n\u003cli\u003eExperience with python pandas, scikit-learn, numpy and NVDIA’s CUDA and visualization libraries such as seaborn, plotly, etc. strongly preferred\u003c/li\u003e\n\u003cli\u003eExperience working with large tabular (\u0026gt;100m rows) datasets a plus\u003c/li\u003e\n\u003cli\u003eFamiliarity with basic statistical concepts\u003c/li\u003e\n\u003cli\u003eCuriosity for insurance and autonomous technology applied to transportation/trucking\u003c/li\u003e\n\u003cli\u003eEntrepreneurial mindset and comfort with ambiguity\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBenefits\u003c/p\u003e\n\u003cp\u003eKoffie is an insurance company purpose built for the autonomous vehicle era. We are taking transportation insurance out of the dark ages by using modern technology to deliver instant policies based on advanced safety and autonomous technology. As an InsurTech, Koffie is free from legacy systems and inefficient processes, our AI-driven predictive models deliver a reimagined insurance experience for fleets. We believe strongly in diversity of thought which comes from different backgrounds and experiences.\u003c/p\u003e\n\u003cp\u003eOur vision is to align incentives across fleets, technology providers, brokers and the automotive industry. By catalyzing the adoption of safety technology, we positively impact road safety and facilitate a more efficient supply chain. We’re backed by top-tier VCs in the fintech and mobility sectors.\u003c/p\u003e\n\u003cp\u003eIf you're ready to work obsessively with us to make insurance better, faster, more efficient and build products for the next 100 years of mobility, we want to hear from you, regardless of where you live.\u003c/p\u003e\n\u003cp\u003eFor US employees we offer a competitive salary, stock options, unlimited vacation, 100% employer paid health, vision and dental plans, commuter benefits and discounted fitness classes, generous WFH stipend, personal learning/training (for professional and industry certification) and conference budget. For remote hires outside the US, we are unable to provide some of these benefits.\u003c/p\u003e\n\u003cp\u003eAlthough this position is WFH, we envision meeting face-to-face as a team every 6-8 weeks for several days once things return to 'normal.'\u003c/p\u003e\n\u003cp\u003eHiring process for this role is as follows: initial screen by hiring manager, coding challenge (administered by iMocha), Zoom screen, Zoom technical interview, Zoom interview with additional team members, then offer. We hope to have candidates go from submission to offer in under two weeks.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease visit \u003ca href=\"https://apply.workable.com/koffie-labs/\"\u003ehttps://apply.workable.com/koffie-labs/\u003c/a\u003e to learn more and apply!\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaXljIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ef6a67ee15183410545a3222a8f1ce009f75ffee/koffie%20logo.png"},{"id":"3c8c0c1b-d7df-4dd6-93c1-bc556d97d06b","type":"Full Time","url":"https://jobs.github.com/positions/3c8c0c1b-d7df-4dd6-93c1-bc556d97d06b","created_at":"Thu Mar 11 22:51:47 UTC 2021","company":"ONENIGMA","company_url":"http://www.onenigma.com","location":"Remote (United States)","title":"Android Software Engineer (Remote)","description":"\u003cp\u003eOnenigma is a fully remote, flexible, ultra-casual, and forward-thinking software studio that works on new concepts, projects, and products we care about with people and companies we strongly believe in. Onenigma has worked with various companies over the years like AirBnB, Cognito, Udacity, Bloom, Tranche, Peapod, as well as many more to build new concepts and ideas. We always have liked to fly under the radar by building products used by millions around the world without seeking attention, because we simply really enjoy making cool and intuitive things.\u003c/p\u003e\n\u003cp\u003eThis position focuses on both Android and occasionally web stacks. We work with leaders in the cryptocurrency, finance, and emerging technology spaces to deliver high impact products that have served as the backbone for many industries. This position will expose you to a number of different products, fields, and concepts that require adaptive thinking. This position also allows for you to work on an idea or hobbyist project alongside company projects. We are a constantly evolving company, always looking to take unorthodox approaches to new ideas and ventures and love working with people who think the same way.\u003c/p\u003e\n\u003cp\u003eYou will:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork closely with designers and engineers to be solely responsible for maintaining existing and creating new Android libraries and applications\u003c/li\u003e\n\u003cli\u003eCreate cutting-edge front end user experiences that everyone actually​ enjoys using\u003c/li\u003e\n\u003cli\u003eLearn new technologies and practices required to stay up to date with the latest developments and security requirements\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYou have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e2+ years of prior experience developing/releasing Android applications in Kotlin and Java\u003c/li\u003e\n\u003cli\u003eUnderstanding of Android framework components and their lifecycles\u003c/li\u003e\n\u003cli\u003ePrior experience working with product, design, and other developers to create strong products\u003c/li\u003e\n\u003cli\u003eExperience with test-driven development\u003c/li\u003e\n\u003cli\u003eStrong communication skills\u003c/li\u003e\n\u003cli\u003eAbility to self-manage time and development targets\u003c/li\u003e\n\u003cli\u003eOpen-mindness and adaptability to shifting to new products or\npriorities\u003c/li\u003e\n\u003cli\u003eDesire to improve on existing skills and learn new ones\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBonus points:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSome prior experience with Full-Stack Development\u003c/li\u003e\n\u003cli\u003eExperience with React\u003c/li\u003e\n\u003cli\u003eStrong sense of design, both big picture and nano details\u003c/li\u003e\n\u003cli\u003ePrefer simple solutions over complicated ones\u003c/li\u003e\n\u003cli\u003eHave a desire to work on products in a variety of different industries\nfrom cryptocurrency to insurance, and even identity verification\ntechnologies\u003c/li\u003e\n\u003cli\u003eEnjoys participating in occasional banter about things like life,\nhobbies, and crypto\u003c/li\u003e\n\u003cli\u003eSome history working in a fully remote environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePerks:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eClose knit, family-like work culture\u003c/li\u003e\n\u003cli\u003eFully and indefinitely remote\u003c/li\u003e\n\u003cli\u003eUnlimited vacation days\u003c/li\u003e\n\u003cli\u003eCompletely flexible working hours and work schedule\u003c/li\u003e\n\u003cli\u003eTop coverage health insurance\u003c/li\u003e\n\u003cli\u003eLife insurance\u003c/li\u003e\n\u003cli\u003eDental insurance\u003c/li\u003e\n\u003cli\u003eVision insurance\u003c/li\u003e\n\u003cli\u003eVisa sponsorship\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOnenigma is an equal opportunity employer and participates in the US Federal E-Verify program.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease email your resume to \u003ca href=\"mailto:apply@onenigma.com\"\u003eapply@onenigma.com\u003c/a\u003e!\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaXFjIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ae7b41a3a946274ba472e4cc0bfaf27a0792d2c0/Animated%20Logo-Round.png"}]